{
  "facts": [
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Abbotsford is a city in British Columbia next to the Canada–United States border, Greater Vancouver, and the Fraser River."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is home to Tradex, the University of the Fraser Valley, and Abbotsford International Airport."
    },
    {
      "cityName": "Aberdeen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Historically, Aberdeen was within the historic county of Aberdeenshire, but is now separate from the council area of Aberdeenshire."
    },
    {
      "cityName": "Aberdeen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Aberdeen City Council is one of Scotland's 32 local authorities."
    },
    {
      "cityName": "Aberdeen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Aberdeen has a population of \n198,590 (2020) for the main urban area and \n220,690 (2020) for the wider settlement including outlying localities, making it the United Kingdom's 39th most populous built-up area."
    },
    {
      "cityName": "Aberdeen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Aberdeen has a long, sandy coastline and features an oceanic climate, with cool summers and mild, rainy winters."
    },
    {
      "cityName": "Agassiz",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Agassiz is a small community located in the Eastern Fraser Valley region of British Columbia, Canada, about 97 kilometres east of Vancouver and 24 kilometres north-east of the city of Chilliwack."
    },
    {
      "cityName": "Agassiz",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Agassiz is the only town centre within the jurisdiction of the District Municipality of Kent."
    },
    {
      "cityName": "Agassiz",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The majority of Kent's population resides in the Agassiz area."
    },
    {
      "cityName": "Albion",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the oldest non-indigenous community of the district's settlements, and is only slightly younger than Fort Langley, adjacent across the Fraser River, and Kanaka Creek, which is just to the west and lies along the creek of the same name."
    },
    {
      "cityName": "Albion",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Burgeoning newer home construction east of 240th Street near the Lougheed Highway is also often referred to as part of Albion."
    },
    {
      "cityName": "Aldergrove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Aldergrove is a community in the Township of Langley within British Columbia, Canada, approximately 59 km (37 mi) east of Vancouver."
    },
    {
      "cityName": "Aldergrove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Aldergrove is located at the southeastern edge of both the Township of Langley and the Greater Vancouver metropolitan area, near the western edge of the Abbotsford metropolitan area."
    },
    {
      "cityName": "Aldergrove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is home to the Lynden–Aldergrove Border Crossing, one of the Lower Mainland's five land border crossings, connecting it with Lynden, Washington."
    },
    {
      "cityName": "Anmore",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Anmore is a village in Metro Vancouver, British Columbia, Canada."
    },
    {
      "cityName": "Anmore",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is north of the city of Port Moody and along the shores of the Indian Arm."
    },
    {
      "cityName": "Anmore",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Anmore is one of three politically independent village municipalities in the Greater Vancouver area, the others being its neighbour Belcarra, and Lions Bay."
    },
    {
      "cityName": "Arbutus Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Arbutus Ridge is an affluent residential neighbourhood in Vancouver's West Side."
    },
    {
      "cityName": "Arbutus Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by 16th Avenue in the north, 41st Avenue in the south, Mackenzie Street in the west, and East Boulevard in the east."
    },
    {
      "cityName": "Arbutus Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighbourhood is characterized by larger than average lot sizes, with stately homes on tree-lined streets."
    },
    {
      "cityName": "Blundell",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Blundell is both a surname and a given name."
    },
    {
      "cityName": "Blundell",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Notable people with the name include:"
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bowen Island, British Columbia, is an island municipality that is part of Metro Vancouver, and within the jurisdiction of the Islands Trust."
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located in Howe Sound, it is approximately 6 kilometres (3.7 mi) wide by 12 kilometres (7.5 mi) long, and at its closest point is about 3 kilometres (1.9 mi) west of the mainland."
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "There is regular ferry service from Horseshoe Bay provided by BC Ferries, and semi-regular water taxi services."
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The population of 4,256 is supplemented in the summer by about 1,500 visitors."
    },
    {
      "cityName": "Bridgeview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Surrey is a city in British Columbia, Canada."
    },
    {
      "cityName": "Bridgeview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located south of the Fraser River on the Canada–United States border."
    },
    {
      "cityName": "Bridgeview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is a member municipality of the Metro Vancouver regional district and metropolitan area."
    },
    {
      "cityName": "Bridgeview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Mainly a suburban city, Surrey is the province's second-largest by population after Vancouver and the third-largest by area after Abbotsford and Prince George."
    },
    {
      "cityName": "Bridgeview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Seven neighbourhoods in Surrey are designated town centres: Cloverdale, Fleetwood, Guildford, Newton, South Surrey, and City Centre encompassed by Whalley."
    },
    {
      "cityName": "Brighouse-City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Richmond–Brighouse is an elevated station on the Canada Line of Metro Vancouver's SkyTrain rapid transit system."
    },
    {
      "cityName": "Brighouse-City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located in the Brighouse area of Richmond, British Columbia, Canada, it is one of the outbound terminus stations of the Canada Line, the other being YVR–Airport."
    },
    {
      "cityName": "Brighouse-City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Like YVR–Airport, Richmond–Brighouse only has a single track."
    },
    {
      "cityName": "Broadmoor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Broadmoor Hospital is a high-security psychiatric hospital in Crowthorne, Berkshire, England."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brocklehurst is a neighbourhood in the western area of Kamloops, British Columbia, Canada."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Brocklehurst is bordered by the Thompson River to the south, North Shore to the east, Tranquille to the west, and the Batchelor hills and Batchelor Heights aka Batchelor Hills to the north."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community is named after Ernest Brocklehurst, from Liverpool, England who lived in the area between 1896 and 1907."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brookswood is a community in the Township of Langley, British Columbia, Canada, located on the west side of that municipality to the south of the Nicomekl River."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is largely a residential area with several commercial areas, a Recreation Centre with a hockey area and curling rink."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Several hills and mountains are named Burke, including:"
    },
    {
      "cityName": "Burnaby Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Burnaby Heights, often referred to as The Heights, is a residential neighbourhood in North Burnaby."
    },
    {
      "cityName": "Burnaby Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by Boundary Road to the west, Gamma Avenue to the east and Hastings Street to the south."
    },
    {
      "cityName": "Burnaby Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its northern edge facing the North Shore Mountains comes down rather steeply to the shores of Burrard Inlet."
    },
    {
      "cityName": "Burquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Moody-Burquitlam is a provincial electoral district in British Columbia, Canada."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is on the Trans-Canada Highway in the province of British Columbia at a junction with Highway 97."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The same intersection and the town that grew around it was at the point on the Cariboo Wagon Road where a branch road, and previously only a trail, led east to Savona's Ferry on Kamloops Lake."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "This community is also the point at which a small stream, once known as Riviere de la Cache, joins the Bonaparte River."
    },
    {
      "cityName": "Campbell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Campbell River is a city in the Sayward Land District of British Columbia, Canada, on the east coast of Vancouver Island at the south end of Discovery Passage, which lies along the 50th parallel north along the important Inside Passage shipping route."
    },
    {
      "cityName": "Campbell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Campbell River has a population of 35,138 and has long been touted as the \"salmon capital of the world.\" Campbell River and Region are near the communities of Quadra and the Discovery Islands, Sayward, Oyster River, Gold River, Tahsis and Zeballos."
    },
    {
      "cityName": "Canal Flats",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Canal Flats is a village municipality in the East Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Canal Flats",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "This Columbia Valley community lies between the southern end of Columbia Lake and the northwest shore of the Kootenay River."
    },
    {
      "cityName": "Canal Flats",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The locality, on Highway 93/95, is by road about 83 kilometres (52 mi) north of Cranbrook and 165 kilometres (103 mi) southeast of Golden."
    },
    {
      "cityName": "Cape Horn",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cape Horn is the southernmost headland of the Tierra del Fuego archipelago of southern Chile, and is located on the small Hornos Island."
    },
    {
      "cityName": "Cape Horn",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Although not the most southerly point of South America, Cape Horn marks the northern boundary of the Drake Passage and marks where the Atlantic and Pacific Oceans meet."
    },
    {
      "cityName": "Carey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Roman invasion of Africa lasted from 204 to 201 BC when a Roman army under Publius Cornelius Scipio landed near Utica and decisively defeated the Carthaginian Empire, thus ending the Second Punic War."
    },
    {
      "cityName": "Carey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The First Punic War was fought between Carthage and Rome for 23 years, from 264 to 241 BC."
    },
    {
      "cityName": "Carey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "After a 23-year interbellum, war broke out again in 218 BC."
    },
    {
      "cityName": "Carey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "After a further 13 years of war—marked by Hannibal's campaign in Italy—Scipio, Rome's most successful commander, was assigned to Sicily with the intention of invading the Carthaginian homeland in North Africa."
    },
    {
      "cityName": "Cariboo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Cariboo is an intermontane region of British Columbia, Canada, centered on a plateau stretching from Fraser Canyon to the Cariboo Mountains."
    },
    {
      "cityName": "Cariboo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name is a reference to the caribou that were once abundant in the region."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Castlegar is a community in the West Kootenay region of British Columbia, Canada."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In the Selkirk Mountains, at the confluence of the Kootenay and Columbia Rivers, it is a regional trade and transportation centre, with a local economy based on forestry, mining and tourism."
    },
    {
      "cityName": "Cedar Valley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mission is a city in the Lower Mainland of the province of British Columbia, Canada."
    },
    {
      "cityName": "Cedar Valley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by the city of Abbotsford to the south and the city of Maple Ridge to the west."
    },
    {
      "cityName": "Central Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coquitlam is a city in the Lower Mainland of British Columbia, Canada."
    },
    {
      "cityName": "Central Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Central Lonsdale is a precinct in British Columbia, Canada, the central neighbourhood of Lonsdale, in the City of North Vancouver."
    },
    {
      "cityName": "Central Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It extends from Lower Lonsdale & Keith Road to Highway 1 near 24th Street, where it meets Upper Lonsdale."
    },
    {
      "cityName": "Central Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Central Lonsdale is somewhat densely populated, having many apartment buildings and stores on Lonsdale Avenue."
    },
    {
      "cityName": "Central Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Central Lonsdale is proud of many unique Green Homes such as first Net-Zero Home in the whole of Canada."
    },
    {
      "cityName": "Central Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "15th St West and Jones Ave, 20th St West and Mahon Ave as well as two side by side Green Homes at 19th St West and Jones Ave are examples of these homes."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Central Saanich is a district municipality in Greater Victoria, British Columbia, Canada, and a member municipality of the Capital Regional District."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located on the Saanich Peninsula, in the far south-east of Vancouver Island."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the traditional territory of the W̱SÁNEĆ people."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The district began as a farming community, and many hobby farms, along working farms and vineyards, still exist."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In recent decades, the area has seen increasing residential, commercial, and industrial development, especially around the neighbourhoods of Brentwood Bay and Saanichton, which are occasionally referred to as separate communities."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chase is a village located in the Interior of British Columbia, Canada."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has a population of 2,399, and its main industries are forestry and tourism."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is located at the outlet of Little Shuswap Lake, which is the source of the South Thompson River."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Chase Creek, which drops over three small waterfalls before flowing through the town, enters the South Thompson just below the lake's outlet."
    },
    {
      "cityName": "Chilliwack",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located about 100 km (62 mi) east of the City of Vancouver in the Fraser Valley."
    },
    {
      "cityName": "Chilliwack",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The enumerated population is 93,203 in the city and 113,767 in the greater metropolitan area."
    },
    {
      "cityName": "Chilliwack-Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located about 100 km (62 mi) east of the City of Vancouver in the Fraser Valley."
    },
    {
      "cityName": "Chilliwack-Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The enumerated population is 93,203 in the city and 113,767 in the greater metropolitan area."
    },
    {
      "cityName": "Chinatown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chinatown is a common term used to describe an ethnic enclave of Chinese people located outside of Mainland China, Hong Kong, Macau, and Taiwan, typically situated in an urban area."
    },
    {
      "cityName": "Chinatown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Chinatowns can be found around the world, including in Europe, Asia, Africa, Oceania, and the Americas."
    },
    {
      "cityName": "Chinatown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The history of Chinatowns date back to the Tang dynasty in the 10th century, arising from the nation's important role in global trade."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Clearwater is a district municipality in the North Thompson River valley in British Columbia, Canada, where the Clearwater River empties into the North Thompson River."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located 124 km (77 mi) north of Kamloops."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The District of Clearwater was established on December 3, 2007, making it one of the newest municipalities in British Columbia."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is near Wells Gray Provincial Park and is surrounded by the Trophy Mountains, Raft Mountain and Dunn Peak."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Clinton is a village in British Columbia, Canada, located approximately 40 km (25 mi) northwest of Cache Creek and 30 km south of 70 Mile House."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cloverdale is a town centre in the city of Surrey, British Columbia, a southeastern suburb of Greater Vancouver, located just west of the City of Langley."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town centre was initially founded as a small farm community in 1870 for its fertile land and temperate climate."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Cloverdale eventually amalgamated into Surrey as one of its six town centres."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coal Harbour is a section of Burrard Inlet lying between Vancouver's Downtown Peninsula and the Brockton Point of Stanley Park."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has also now become the name of the neighbourhood adjacent to its southern shoreline."
    },
    {
      "cityName": "Coldstream",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coldstream is a town and civil parish in the Scottish Borders area of Scotland."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Colwood is a city on Vancouver Island to the southwest of Victoria, capital of British Columbia, Canada."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Colwood lies within the boundaries of the Greater Victoria area or Capital Regional District, in a region called the Western Communities, or the West Shore."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Set along more than 5 kilometres (3.1 mi) of oceanfront, this fast-growing seaside community is one of the 13 component municipalities of Greater Victoria."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Comox is a town on the southern coast of the Comox Peninsula in the Strait of Georgia on the eastern coast of Vancouver Island, British Columbia."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Thousands of years ago, the warm dry summers, mild winters, fertile soil, and abundant sea life attracted First Nations, who called the area kw'umuxws."
    },
    {
      "cityName": "Coquitlam Town Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coquitlam Town Centre is the main commercial and retail neighbourhood for the city of Coquitlam, British Columbia."
    },
    {
      "cityName": "Coquitlam Town Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Coquitlam Town Centre covers 723 hectares."
    },
    {
      "cityName": "Coquitlam Town Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Town Centre also contains the highest concentration of high-rise condominiums in the Tri-Cities and northeastern Metro Vancouver."
    },
    {
      "cityName": "Coquitlam West",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coquitlam is a city in the Lower Mainland of British Columbia, Canada."
    },
    {
      "cityName": "Cordova Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cordova Bay is a bay in the Alexander Archipelago of southeast Alaska."
    },
    {
      "cityName": "Cordova Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It opens onto Dixon Entrance to the south, between Cape Muzon on Dall Island and Point Marsh."
    },
    {
      "cityName": "Cordova Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The name Puerto Cordova y Cordova was given by the Spanish explorer Lieutenant Don Jacinto Caamaño in 1792, in honor of Admiral Luis de Córdova y Córdova."
    },
    {
      "cityName": "Cordova Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The name was published by George Vancouver in 1798."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Courtenay is a city of 28,420 on the east coast of Vancouver Island, in the Canadian province of British Columbia."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the largest community and only city in the area commonly known as the Comox Valley."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Courtenay is the seat of the Comox Valley Regional District; this district replaced the Comox-Strathcona Regional District."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cranbrook is a city in southeast British Columbia, Canada, located approximately 10 km southwest of the confluence of the Kootenay River and the St. Mary's River."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the largest urban centre in the region known as the East Kootenay."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the location of the headquarters of the Regional District of East Kootenay and also the location of the regional headquarters of various provincial ministries and agencies, notably the Rocky Mountain Forest District."
    },
    {
      "cityName": "Cumberland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Comox Valley community is west of BC Highway 19 and is by road about 105 kilometres (65 mi) northwest of Nanaimo and 10 kilometres (6 mi) southwest of Courtenay."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Daajing Giids, known as Queen Charlotte City from 1891–2022, is a village municipality in the Haida Gwaii archipelago in the province of British Columbia, Canada."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located on the southern end of Graham Island at Skidegate Inlet and is a member municipality of the North Coast Regional District."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The municipality of 24.37 square kilometres (9.41 sq mi) had a population of 12,978 in 2016."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Dawson Creek derives its name from the creek of the same name that runs through the community."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The creek was named after George Mercer Dawson by a member of his land survey team when they passed through the area in August 1879."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Once a small farming community, Dawson Creek became a regional centre after the western terminus of the Northern Alberta Railways was extended there in 1932."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The community grew rapidly in 1942 as the US Army used the rail terminus as a transshipment point during construction of the Alaska Highway."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "In the 1950s, the city was connected to the interior of British Columbia via a highway and a railway through the Rocky Mountains."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Since the 1960s, growth has slowed, but the area population has increased."
    },
    {
      "cityName": "Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Delta is a city in the Lower Mainland region of British Columbia, Canada, and part of Greater Vancouver."
    },
    {
      "cityName": "Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located on the Fraser Lowland south of Fraser River's south arm, it is bordered by the city of Richmond on Lulu Island to the north, New Westminster to the northeast, Surrey to the east, the Boundary Bay and the American pene-exclave Point Roberts to the south, and the Strait of Georgia to the west."
    },
    {
      "cityName": "Departure Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Departure Bay is a bay in central Nanaimo, British Columbia, on the east coast of Vancouver Island."
    },
    {
      "cityName": "Departure Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The surrounding neighbourhood is also referred to as \"Departure Bay\" —once a settlement of its own, it was amalgamated into the City of Nanaimo in the 1970s."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Downtown is a term primarily used in American and Canadian English to refer to a city's sometimes commercial, cultural and often the historical, political, and geographic heart."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is often synonymous with its central business district (CBD)."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It may also be a center for shopping and entertainment."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Downtowns typically contain a small percentage of a city's employment but are concentrated in services, including high-end services."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Sometimes, smaller downtowns include lower population densities and lower incomes than nearby suburbs."
    },
    {
      "cityName": "Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It is often distinguished as a hub of public transit and culture."
    },
    {
      "cityName": "Dunbar-Southlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Dunbar–Southlands is a neighbourhood situated on the western side of Vancouver, British Columbia, Canada, that stretches north from the Fraser River and covers most of the land between the mouth of the Fraser and English Bay."
    },
    {
      "cityName": "Duncan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Duncan is a city on southern Vancouver Island in the Cowichan Valley Regional District, British Columbia, Canada."
    },
    {
      "cityName": "Duncan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the smallest city in Canada by area."
    },
    {
      "cityName": "East Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Rhodes earthquake of 226 BC, which affected the island of Rhodes, Greece, is famous for having toppled the large statue known as the Colossus of Rhodes."
    },
    {
      "cityName": "East Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Following the earthquake, the statue lay in place for nearly eight centuries before being sold off by invaders."
    },
    {
      "cityName": "East Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "While 226 BC is most often cited as the date of the quake, sources variously cite 226 or 227 BC as dates when it occurred."
    },
    {
      "cityName": "East Hastings",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hastings Street is an east–west traffic corridor in the cities of Vancouver and Burnaby, British Columbia, Canada."
    },
    {
      "cityName": "East Hastings",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It used to be a part of the decommissioned Highway 7A."
    },
    {
      "cityName": "East Hastings",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In the central business district of downtown Vancouver, it is known as West Hastings Street; at Carrall Street it becomes East Hastings Street and runs eastwards through East Vancouver and Burnaby."
    },
    {
      "cityName": "East Hastings",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In Burnaby, there is no east-west designation."
    },
    {
      "cityName": "East Hastings",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The street ends in Westridge, a neighbourhood at the foot of Burnaby Mountain where it joins Burnaby Mountain Parkway and diverges from the continuation of the former Highway 7A as the Barnet Highway, to Port Moody, British Columbia."
    },
    {
      "cityName": "Edmonds",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Burnaby South-Metrotown is a provincial electoral district for the Legislative Assembly of British Columbia, Canada."
    },
    {
      "cityName": "Edmonds",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Created under the 2021 British Columbia electoral redistribution, the riding was first contested in the 2024 British Columbia general election."
    },
    {
      "cityName": "Edmonds",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was created out of parts of Burnaby-Edmonds and Burnaby-Deer Lake."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Elkford is a district municipality in the southeast region of the Canadian province of British Columbia in the Rocky Mountain range."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is 32 km (20 mi) north of the junction at Sparwood, on provincial Highway 43."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Outdoor recreational activities take place in Elkford throughout the year."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Elkford hosts an annual festival called Wildcat Days during the last weekend of June."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of Enderby is in the North Okanagan region of the Canadian province of British Columbia, between Armstrong and Salmon Arm."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is approximately 80 km north of Kelowna and 130 km east of Kamloops."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Highway 97A passes through Enderby and the Shuswap River marks the eastern and northeastern limits of the City."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "There are two major schools in Enderby: M.V."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Beattie Elementary School and A.L."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Beattie Elementary School was rebuilt in 2012."
    },
    {
      "cityName": "English Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "English Bay is an open bay northwest of the Burrard Peninsula in British Columbia, Canada, extending from the headland between Siwash Rock and Prospect Point on Vancouver's Downtown peninsula in the northeast, to the northwestern tip of Point Grey in the southwest."
    },
    {
      "cityName": "English Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The bay encompasses the coasts of Stanley Park, the West End, Kitsilano, West Point Grey and the University Endowment Lands, and makes up the southeastern portion of the outer Burrard Inlet."
    },
    {
      "cityName": "English Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "There is a narrow inlet named False Creek at its eastern end."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Township of Esquimalt is a municipality at the southern tip of Vancouver Island, in British Columbia, Canada."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is almost tangential to Esquimalt 1 Indian Reserve near Admirals Road."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is one of the 13 municipalities of Greater Victoria and part of the Capital Regional District."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It runs from False Creek in the north to 16th Avenue in the south, and from Burrard Street in the west to Cambie Street in the east."
    },
    {
      "cityName": "Fleetwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fleetwood is a coastal town in the Borough of Wyre in Lancashire, England, at the northwest corner of the Fylde."
    },
    {
      "cityName": "Fort St. James",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fort St. James is a district municipality and former fur trading post in northern central British Columbia, Canada."
    },
    {
      "cityName": "Fort St. James",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located on the south-eastern shore of Stuart Lake in the Omineca Country, at the northern terminus of Highway 27, which connects to Highway 16 at Vanderhoof."
    },
    {
      "cityName": "Fort St. John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located at Mile 47 of the Alaska Highway, it is one of the largest cities between Dawson Creek, British Columbia and Delta Junction, Alaska."
    },
    {
      "cityName": "Fort St. John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Established in 1794 as a trading post, Fort St. John is the oldest European-established settlement in present-day British Columbia."
    },
    {
      "cityName": "Fort St. John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is served by the Fort St. John Airport."
    },
    {
      "cityName": "Fort St. John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The municipal slogan is Fort St. John: The Energetic City."
    },
    {
      "cityName": "Fraser Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fraser Heights is a neighbourhood of Guildford, a town centre in the city of Surrey, British Columbia."
    },
    {
      "cityName": "Fraser Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Bounded by Highway 1 to the south, Golden Ears Connector and Golden Ears Way to the east and the Fraser River to the north, with most homes having a view of the Fraser River and Coquitlam Mountain."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fraser Lake is a village in northern British Columbia, Canada."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It's located on the southwest side of Fraser Lake between Burns Lake and Vanderhoof alongside the Yellowhead Highway."
    },
    {
      "cityName": "Fruitvale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This is a list of curling clubs in the Canadian province of British Columbia."
    },
    {
      "cityName": "Fruitvale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Curling in British Columbia is organized by the Curl BC."
    },
    {
      "cityName": "Fruitvale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Curl BC divides the province into 8 zones:"
    },
    {
      "cityName": "Gold River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pitt Lake's Lost Gold Mine is a legendary lost mine said to be near Pitt Lake, British Columbia, Canada, the supposed wealth of which has held the imagination of people worldwide for more than a century."
    },
    {
      "cityName": "Gold River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Ever since the years of the Fraser Canyon Gold Rush, prospectors and adventurers have been looking for the mine, and gold-rush rumors have evolved into legends repeated and enriched over time."
    },
    {
      "cityName": "Gold River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The mysterious riches are known as Slumach’s Lost Mine, or Lost Creek Mine."
    },
    {
      "cityName": "Golden",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Golden is a town in southeastern British Columbia, Canada, 262 kilometres (163 mi) west of Calgary, Alberta, and 713 kilometres (443 mi) east of Vancouver."
    },
    {
      "cityName": "Gordon Head",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Gordon Head is a seaside neighbourhood in the municipality of Saanich in Greater Victoria, British Columbia, Canada."
    },
    {
      "cityName": "Gordon Head",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Gordon Head lies north of McKenzie Avenue and east of the Blenkinsop Valley."
    },
    {
      "cityName": "Gordon Head",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The University of Victoria is located partly within Gordon Head along the southeast boundary."
    },
    {
      "cityName": "Gordon Head",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Finnerty Road separates Gordon Head from the adjacent neighbourhood of Cadboro Bay."
    },
    {
      "cityName": "Gordon Head",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The local area is dominated physically by Mount Douglas, a coastline along Haro Strait, and the central plateau."
    },
    {
      "cityName": "Grand Forks",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Grand Forks is a city in the Boundary Country of the West Kootenay region of British Columbia, Canada."
    },
    {
      "cityName": "Grand Forks",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located at the confluence of the Granby and Kettle Rivers, the latter being a tributary of the Columbia River."
    },
    {
      "cityName": "Grand Forks",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is just north of the Canada–United States border, approximately 500 km (310 mi) from Vancouver and 200 km (120 mi) from Kelowna and 23 km (14 mi) west of the resort area of Christina Lake by road."
    },
    {
      "cityName": "Grandview-Woodlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Grandview–Woodland, also commonly known as Grandview–Woodlands, is a neighbourhood in Vancouver, British Columbia, Canada to the east of the downtown area, stretching south from the shores of Burrard Inlet and encompassing portions of the popular Commercial Drive area."
    },
    {
      "cityName": "Grandview-Woodlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a mature neighbourhood in Vancouver that is a vibrant mixture of commercial, industrial, single-family and multi-family residential with a rich ethnic history and features."
    },
    {
      "cityName": "Granisle",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Granisle is a village on Babine Lake in the Northern Interior of British Columbia, Canada, to the north of Topley between Burns Lake and Houston."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Guildford is a town in west Surrey, England, around 27 mi (43 km) southwest of central London."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its name is thought to derive from a crossing of the River Wey, a tributary of the River Thames, that flows through the town centre."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Molossians were a group of ancient Greek tribes which inhabited the region of Epirus in classical antiquity."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Together with the Chaonians and the Thesprotians, they formed the main tribal groupings of the northwestern Greek group."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "On their northern frontier, they neighbored the Chaonians and on their southern frontier neighbored the kingdom of the Thesprotians."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "They formed their own state around 370 BC and were part of the League of Epirus."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The most famous Molossian ruler was Pyrrhus of Epirus, considered one of the greatest generals of antiquity."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Molossians sided with the Macedonians against Rome in the Third Macedonian War and were defeated."
    },
    {
      "cityName": "Hammond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Following the war, the region witnessed devastation while a considerable number of Molossians and other Epirotes were enslaved and transported to the Roman Republic, in the Italian Peninsula."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mission City is the eastern terminus station on the West Coast Express commuter rail line connecting Vancouver to Mission, British Columbia, Canada."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The station is located on the north side of the Canadian Pacific Railway (CPR) tracks in Mission on North Railway Avenue."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The station opened in 1995, when the West Coast Express began operating."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "254 park and ride spaces are available at the station."
    },
    {
      "cityName": "Harrison Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Harrison Hot Springs is a village located at the southern end of Harrison Lake in the Fraser Valley of British Columbia, Canada."
    },
    {
      "cityName": "Harrison Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a part of the Fraser Valley Regional District; its immediate neighbour is the District of Kent, which includes the town of Agassiz."
    },
    {
      "cityName": "Harrison Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As its name would suggest, it is a resort community known for its hot springs and has a population of just over 1,500 people."
    },
    {
      "cityName": "Harrison Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is named after Benjamin Harrison, a former deputy governor of the Hudson's Bay Company."
    },
    {
      "cityName": "Hastings-Sunrise",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hastings–Sunrise is a neighbourhood located in the northeastern corner of the city of Vancouver, British Columbia."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hazelton is a village municipality in the Skeena region of west central British Columbia, Canada."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The place is on the southeast side of the Skeena River immediately north of the Bulkley River mouth, where the confluence forms a peninsula."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "On BC Highway 62, the locality is by road about 75 kilometres (47 mi) northwest of Smithers and 144 kilometres (89 mi) northeast of Terrace."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Hazelton is the original of the \"Three Hazeltons\", the other two being New Hazelton to the southeast and South Hazelton to the south."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Highlands is a district municipality near Victoria, British Columbia, Canada."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The region stretches along the Saanich Inlet shoreline from north of Goldstream to Mackenzie Bight."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Highlands is one of the more undeveloped areas of the Greater Victoria region; it is one of the newest Greater Victoria municipalities created within the Capital Regional District."
    },
    {
      "cityName": "Hillside-Quadra",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria is the capital city of the Canadian province of British Columbia, located on the southern tip of Vancouver Island off Canada's Pacific coast."
    },
    {
      "cityName": "Hillside-Quadra",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city has a population of 91,867, and the Greater Victoria area has a population of 397,237."
    },
    {
      "cityName": "Hillside-Quadra",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4,406 inhabitants per square kilometre (11,410/sq mi)."
    },
    {
      "cityName": "Historic Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Downtown Oklahoma City is located at the geographic center of the Oklahoma City metropolitan area and contains the principal, central business district of the region."
    },
    {
      "cityName": "Historic Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Downtown has over 80,000 workers and over 13,310,000 sq ft (1,237,000 m2) of leasable office space to-date."
    },
    {
      "cityName": "Historic Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Downtown Oklahoma City is the legal, financial, economic, nightlife, and entertainment center of the region."
    },
    {
      "cityName": "Hockaday",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Notable people with the surname include:Arthur Hockaday (1926–2004), English civil servant\nDave Hockaday, English footballer and manager\nJim Hockaday, American football player\nMary Hockaday, British journalist"
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hope is a district municipality at the confluence of the Fraser and Coquihalla rivers in the province of British Columbia, Canada."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hope is at the eastern end of both the Fraser Valley and the Lower Mainland region, and is at the southern end of the Fraser Canyon."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "To the east, over the Cascade Mountains, is the Interior region, beginning with the Similkameen Country on the farther side of the Allison Pass in Manning Park."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Located 154 kilometres (96 mi) east of Vancouver, Hope is at the southern terminus of the Coquihalla Highway and the western terminus of the Crowsnest Highway, locally known as the Hope-Princeton, where they merge with the Trans-Canada Highway."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Hope is at the eastern terminus of Highway 7."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "As it lies at the eastern end of the Fraser Valley in the windward Cascade foothills, the town gets very high amounts of rain and cloud cover – particularly throughout the autumn and winter."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Houston is a forestry, mining and tourism town in the Bulkley Valley of the Northern Interior of British Columbia, Canada."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is known as the \"steelhead capital\" and it has the world's largest fly fishing rod."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Houston's tourism industry is largely based on ecotourism and Steelhead Park, situated along Highway 16."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Houston is named in honour of the pioneer newspaperman John Houston."
    },
    {
      "cityName": "Hudson's Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hudson's Hope is a district municipality in northeastern British Columbia, Canada, in the Peace River Regional District."
    },
    {
      "cityName": "Hudson's Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Most jobs in the economy are associated with the nearby W."
    },
    {
      "cityName": "Hudson's Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bennett Dam and Peace Canyon Dam, and timber logging."
    },
    {
      "cityName": "Invermere",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Invermere is a community in eastern British Columbia, Canada, near the border of Alberta."
    },
    {
      "cityName": "Invermere",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the hub of the Columbia Valley between Golden to the north and Cranbrook to the south."
    },
    {
      "cityName": "Invermere",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Invermere sits on the northwest shore of Windermere Lake and is a popular summer destination for visitors and second home owners from Edmonton and Calgary."
    },
    {
      "cityName": "James Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "James Bay is a body of water located on the southern end of Hudson Bay in Canada."
    },
    {
      "cityName": "James Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It borders the provinces of Quebec and Ontario, and is politically part of Nunavut."
    },
    {
      "cityName": "James Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its largest island is Akimiski Island."
    },
    {
      "cityName": "Jubilee",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A jubilee is often used to refer to a celebration, commemoration, or anniversary."
    },
    {
      "cityName": "Jubilee",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "\"Jubilation\" for joyful celebration comes from \"jubilee\"."
    },
    {
      "cityName": "Jubilee",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The term comes from the Hebrew Bible, initially concerning a recurring religious observance involving a set number of years, that notably involved freeing of debt slaves."
    },
    {
      "cityName": "Jubilee",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Emperors of ancient Rome customarily marked anniversaries of their rule with celebrations, although they did not use the term \"jubilee.\" Jubilee is also a term used in Roman Catholicism for special years."
    },
    {
      "cityName": "Jubilee",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The term came into English usage from translation of the Bible, together with customary celebration of a reign, and at least since the 19th century is regularly used to denote the celebrations associated with the reign of monarchs after a milestone number of years have passed."
    },
    {
      "cityName": "Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kamloops is a city in south-central British Columbia, Canada, at the confluence of the North and South Thompson Rivers, which join to become the Thompson River in Kamloops, and east of Kamloops Lake."
    },
    {
      "cityName": "Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is the administrative centre for, and largest city in, the Thompson-Nicola Regional District, a region of the British Columbia Interior."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kaslo is a village on the west shore of Kootenay Lake in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A member municipality of the Central Kootenay Regional District, the name derives from the adjacent Kaslo River."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kelowna is a city on Okanagan Lake in the Okanagan Valley in the southern interior of British Columbia, Canada."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It serves as the head office of the Regional District of Central Okanagan."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The name Kelowna derives from the Okanagan word kiʔláwnaʔ, referring to a grizzly bear."
    },
    {
      "cityName": "Kensington-Cedar Cottage",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kensington–Cedar Cottage is one of the most ethnically diverse neighbourhoods in east Vancouver, British Columbia, Canada."
    },
    {
      "cityName": "Kensington-Cedar Cottage",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighbourhood is approximately 7.23 square kilometres (2.79 sq mi) in area."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Kent is a district municipality located 116 kilometres (72 mi) east of Vancouver, British Columbia."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Part of the Fraser Valley Regional District, Kent consists of several communities, the largest and most well-known being Agassiz—the only town in the municipality—Harrison Mills, Kilby, Mount Woodside, Kent Prairie, Sea Bird Island and Ruby Creek."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Included within the municipality's boundaries are several separately-governed Indian reserves, including the Seabird Island First Nation's reserves on and around the island of the same name."
    },
    {
      "cityName": "Keremeos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Keremeos is a village in British Columbia, Canada."
    },
    {
      "cityName": "Keremeos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name originated from the Similkameen dialect of the Okanagan language word \"Keremeyeus\" meaning \"creek which cuts its way through the flats\" referring to Keremeos Creek which flows down from the Upper Benchlands to the Similkameen River that flows past the village."
    },
    {
      "cityName": "Killarney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Killarney is a town in County Kerry, southwestern Ireland."
    },
    {
      "cityName": "Killarney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is on the northeastern shore of Lough Leane, part of Killarney National Park, and is home to St Mary's Cathedral, Ross Castle, Muckross House and Abbey, the Lakes of Killarney, MacGillycuddy's Reeks, Purple Mountain, Mangerton Mountain, Paps Mountain, the Gap of Dunloe and Torc Waterfall."
    },
    {
      "cityName": "Killarney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its natural heritage, history and location on the Ring of Kerry make Killarney a popular tourist destination."
    },
    {
      "cityName": "Kitsilano",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Named after Squamish chief August Jack Khatsahlano, Kitsilano is located along the southern shore of English Bay between Fairview and West Point Grey, with Burrard Street as the neighbourhood's eastern boundary, Alma Street its western boundary, and 16th Avenue its southern boundary."
    },
    {
      "cityName": "Kitsilano",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The area is mostly residential with two main commercial areas, West 4th Avenue and West Broadway, known for their retail stores, restaurants and organic food markets."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ladner is a part of the City of Delta, British Columbia, Canada, a suburb of Vancouver, British Columbia."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was created as a fishing village on the banks of the Fraser River."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lake Country is a district municipality with a population of approximately 15,000 in the Okanagan Valley region of British Columbia, Canada."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a part of the Central Okanagan Regional District, and of the Kelowna metropolitan area."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Kelowna lies to the south, while the city of Vernon lies to the north."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As its name suggests, there are a number of lakes in the vicinity of Lake Country, and outside the municipal boundaries in the hills to the east."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Okanagan Lake defines the western boundary of the municipality, while the entirety of Wood Lake and the southernmost portion of Kalamalka Lake are encompassed by it."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lake Cowichan is a town located near the eastern end of Cowichan Lake and, by highway, is a little over one hour northwest of Victoria, British Columbia."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Cowichan River flows through the middle of the town."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Cowichan River is designated as a Heritage River, and is also a popular location for tubing."
    },
    {
      "cityName": "Langford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Langford is one of the 13 component municipalities of Greater Victoria and is within the Capital Regional District."
    },
    {
      "cityName": "Langley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of Langley, commonly referred to as Langley City, or just Langley, is a municipality in the Metro Vancouver Regional District in British Columbia, Canada."
    },
    {
      "cityName": "Langley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It lies directly east of Surrey, adjacent to the Cloverdale area, and is surrounded elsewhere by the Township of Langley, bordered by its neighbourhoods of Willowbrook to the north, Murrayville to the east, and Brookswood and Fern Ridge to the south."
    },
    {
      "cityName": "Lantzville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lantzville is a coastal community on the east side of Vancouver Island, British Columbia, Canada, along the western shore of the Strait of Georgia and immediately north of Nanaimo."
    },
    {
      "cityName": "Lillooet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lillooet is a district municipality in the Squamish-Lillooet region of southwestern British Columbia."
    },
    {
      "cityName": "Lillooet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is on the west shore of the Fraser River immediately north of the Seton River mouth."
    },
    {
      "cityName": "Lillooet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "On BC Highway 99, the locality is by road about 100 kilometres (62 mi) northeast of Pemberton, 64 kilometres (40 mi) northwest of Lytton, and 172 kilometres (107 mi) west of Kamloops."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lions Bay is a small residential community in British Columbia, Canada, located between Vancouver and Squamish on the steep eastern shore of Howe Sound."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "At 2.53 square kilometres (0.98 sq mi), it is BC's 10th smallest municipality by land area."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Originally a boat-access summer camping destination for Vancouverites, Lions Bay began to be permanently settled in the 1960s."
    },
    {
      "cityName": "Logan Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Logan Lake is a district municipality in the Southern Interior of British Columbia, Canada."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lougheed Town Centre is an elevated station on the Expo and Millennium Lines of Metro Vancouver's SkyTrain rapid transit system."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The station is located at Lougheed Highway and Austin Road in Burnaby, British Columbia, Canada."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Initially a Millennium Line station, a reorganization of SkyTrain service patterns in 2016 brought a branch of the Expo Line over the existing tracks to serve the station."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is one of three stations where transfer between the Expo Line and the Millennium Line is possible, the other two such points of transfer being Commercial–Broadway and Production Way–University stations."
    },
    {
      "cityName": "Lower Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lower Lonsdale is a historic waterfront neighbourhood and the Southernmost neighbourhood of Lonsdale, British Columbia, in the City of North Vancouver."
    },
    {
      "cityName": "Lower Lonsdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Lower Lonsdale runs up Lonsdale Avenue from Lonsdale Quay to Keith Road, where it meets Central Lonsdale North of Victoria Park."
    },
    {
      "cityName": "Lumby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On August 28, 2024 during the campaign of the 2024 British Columbia general election, BC United leader and leader of the Opposition Kevin Falcon announced that the party was suspending their electoral campaign, and endorsed the Conservative Party of British Columbia led by John Rustad."
    },
    {
      "cityName": "Lumby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was the first time that BC United/BC Liberals had not contested a general election in British Columbia since the party's founding in 1903, and seemingly ended the Liberal–NDP era of British Columbian politics that had existed since the early 1990s."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lytton is a village of about 250 residents in southern British Columbia, Canada, on the east side of the Fraser River and primarily the south side of the Thompson River, where it flows southwesterly into the Fraser."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community includes the Village of Lytton and the surrounding community of the Lytton First Nation, whose name for the place is Camchin, also spelled Kumsheen."
    },
    {
      "cityName": "Mackenzie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Mackenzie River is a river in the Canadian boreal forest and tundra."
    },
    {
      "cityName": "Mackenzie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It forms, along with the Slave, Peace, and Finlay, the longest river system in Canada, the second largest drainage basin of any North American river after the Mississippi."
    },
    {
      "cityName": "Maple Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located in the northeastern section of Greater Vancouver between the Fraser River and the Golden Ears, a group of mountain summits which constitute the southernmost portion of the Garibaldi Ranges of the Coast Mountains."
    },
    {
      "cityName": "Maple Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its downtown core area was once known as Haney."
    },
    {
      "cityName": "Marlborough",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Marlborough ( MAWL-bər-ə, is a market town and civil parish in the English county of Wiltshire on the Old Bath Road, the old main road from London to Bath."
    },
    {
      "cityName": "Marlborough",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is on the River Kennet, 24 miles north of Salisbury and 10 miles southeast of Swindon."
    },
    {
      "cityName": "Marlborough",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In 2021 it had a population of 9129."
    },
    {
      "cityName": "Marpole",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has undergone many changes in the 20th century, with the influx of traffic and development associated with the construction of the Oak Street Bridge and the Arthur Laing Bridge."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Masset is a village in the Haida Gwaii archipelago in British Columbia, Canada."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located on Masset Sound on the northern coast of Graham Island, the largest island in the archipelago, and is approximately 50 km (31 mi) west of mainland British Columbia."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the primary western terminus of Trans-Canada Highway 16 and is served by Masset Airport, with flights to Vancouver and Prince Rupert."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "During the maritime fur trade of the early 19th century, Masset was a key trading site."
    },
    {
      "cityName": "Maywood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria is the capital city of the Canadian province of British Columbia, located on the southern tip of Vancouver Island off Canada's Pacific coast."
    },
    {
      "cityName": "Maywood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city has a population of 91,867, and the Greater Victoria area has a population of 397,237."
    },
    {
      "cityName": "Maywood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4,406 inhabitants per square kilometre (11,410/sq mi)."
    },
    {
      "cityName": "McBride",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mission is a city in the Lower Mainland of the province of British Columbia, Canada."
    },
    {
      "cityName": "McBride",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by the city of Abbotsford to the south and the city of Maple Ridge to the west."
    },
    {
      "cityName": "Metrotown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Metrotown is an elevated station on the Expo Line of Metro Vancouver's SkyTrain rapid transit system, and is located along Central Boulevard, directly across from the Metropolis at Metrotown shopping centre, in Burnaby, British Columbia, Canada."
    },
    {
      "cityName": "Midway",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Midway is in the West Kootenay region of south central British Columbia."
    },
    {
      "cityName": "Midway",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village lies 13 kilometres (8 mi) west of Greenwood and 51 kilometres (32 mi) east of Osoyoos along Highway 3."
    },
    {
      "cityName": "Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is bordered by the city of Abbotsford to the south and the city of Maple Ridge to the west."
    },
    {
      "cityName": "Montrose",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Montrose is in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Montrose",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village lies 7 kilometres (4 mi) east of the city of Trail along Highway 3B."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Joan Phillip is a Canadian politician who has served as a member of the Legislative Assembly of British Columbia since 2023, as a member of the NDP."
    },
    {
      "cityName": "Mt Pleasant",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This is a list of places of worship in the Lower Mainland in British Columbia, Canada."
    },
    {
      "cityName": "Nakusp",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Village of Nakusp is located south of the mouth of Kuskanax Creek, on the Upper Arrow Lake in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Nakusp",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Lying between the Selkirk and Monashee ranges, the village is known for its nearby hot springs and picturesque mountain lakeside setting."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "\"The Harbour City\" was previously known as the \"Hub City\", which was attributed to its original layout design with streets radiating from the shoreline like the spokes of a wagon wheel, and to its relatively central location on Vancouver Island."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nanaimo is the headquarters of the Regional District of Nanaimo."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is known for its collection of restored heritage buildings that date back to a regional silver rush in 1886."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Along with Castlegar and Trail, located approximately 44 and 69 kilometers from each other respectively, Nelson is one of the three cities forming the commercial and population core of the West Kootenay region."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is the seat of the Regional District of Central Kootenay."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is represented in the provincial legislature by the riding of Nelson-Creston, and in the Parliament of Canada by the riding of Kootenay, Columbia."
    },
    {
      "cityName": "New Denver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Denver is a village in the Central Kootenay region of British Columbia, Canada at the mouth of Carpenter Creek, on the east shore of Slocan Lake, in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "New Denver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village is 47 kilometres (29 mi) west of Kaslo on Highway 31A, and 47 kilometres (29 mi) southeast of Nakusp and 32 kilometres (20 mi) northeast of Slocan on Highway 6."
    },
    {
      "cityName": "New Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Hazelton is a district municipality on the south side of the Bulkley River in the Skeena region of west central British Columbia, Canada."
    },
    {
      "cityName": "New Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 16, the locality is by road about 68 kilometres (42 mi) northwest of Smithers and 137 kilometres (85 mi) northeast of Terrace."
    },
    {
      "cityName": "New Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "New Hazelton is one of the \"Three Hazeltons\", the other two being the original \"Old\" Hazelton to the northwest and South Hazelton to the west."
    },
    {
      "cityName": "New Westminster",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Westminster is a city in the Lower Mainland region of British Columbia, Canada, and a member municipality of the Metro Vancouver Regional District."
    },
    {
      "cityName": "Newton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the location for the previous Surrey City Hall and Courthouse, two local Surrey Public Library branches, and Kwantlen Polytechnic University's main campus."
    },
    {
      "cityName": "Newton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The studios of radio station Red FM are also located here."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Cowichan is a district municipality established in 1873 on Vancouver Island, in British Columbia, Canada."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The municipality is part of the Cowichan Valley Regional District."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "North Cowichan is noted for a landscape including forests, beaches, rivers, and lakes."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The municipality encompasses the communities of Chemainus; Westholme; Crofton; Maple Bay; and \"North Cowichan\"."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The latter is an adjacent to City of Duncan and extending North to the Chemainus River and to Crofton."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Delta is a largely middle-class commuter town situated in the Lower Mainland, of British Columbia, Canada."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is the most populous of the three communities that make up the City of Delta."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "North Delta is home to numerous parks and recreational opportunities."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Alongside North Delta is Burns Bog, the largest raised urban peat bog in North America."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As well, Watershed Park provides walking and biking trails, home to many artesian aquifers."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Besides this, North Delta is home to a large amount of green-space."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Kamloops is a neighbourhood and former town located in the City of Kamloops, British Columbia, Canada."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located immediately to the northwest of Downtown Kamloops across the confluence of the North and South Thompson Rivers."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "North Kamloops is one of four neighbourhoods the City of Kamloops considers part of its Core, the others being Downtown, Sagebrush, and the West End - all on the south shore of the city."
    },
    {
      "cityName": "North Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of North Vancouver is a municipality city on the North Shore of the Burrard Inlet, in British Columbia, Canada."
    },
    {
      "cityName": "North Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is served by the Royal Canadian Mounted Police, British Columbia Ambulance Service, and the North Vancouver City Fire Department."
    },
    {
      "cityName": "Northern Rockies",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Northern Rocky Mountains, usually referred to as the Northern Rockies, are a subdivision of the Canadian Rockies comprising the northern half of the Canadian segment of the Rocky Mountains."
    },
    {
      "cityName": "Oak Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is one of thirteen member municipalities of the Capital Regional District, and is bordered to the west by the city of Victoria and to the north by the district of Saanich."
    },
    {
      "cityName": "Oak Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a residential suburb of Victoria."
    },
    {
      "cityName": "Oakridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Oak Ridge is a city in Anderson and Roane counties in the eastern part of the U.S. state of Tennessee, about 25 miles (40 km) west of downtown Knoxville."
    },
    {
      "cityName": "Oakridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of the Knoxville Metropolitan Area."
    },
    {
      "cityName": "Oakridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Oak Ridge's nicknames include the Atomic City, the Secret City, and the City Behind a Fence."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Father Pandosy Mission, also known as the Okanagan Mission, was the original home for Father Pandosy in Kelowna, British Columbia."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "He moved to Kelowna in 1859 and started the first settlement of Europeans in that region."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "One of the first Europeans to join him at Kelowna was Eli Lequime."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Peachland is a district municipality in the Okanagan Valley on the west side of Okanagan Lake in British Columbia, Canada."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was founded in 1899 by John Moore Robinson, although the region had long been home to the Okanagan people."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Peachland is approximately half-an-hour's drive south of the city of Kelowna and about a 20-minute drive north of Summerland."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Okanagan Valley is very narrow in the area and there are few terraces that mark former lake levels and the former lake bottom."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As a result, the city is largely located on a steep sidehill."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Like many other areas in the Okanagan, Peachland is rapidly growing, with new residents coming from all across Canada."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Across the lake from Peachland is Rattlesnake Island, home of the legendary Ogopogo."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Peachland is approximately 370 km from Vancouver, British Columbia, on the British Columbia south coast."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pemberton Holmes Real Estate is a Canadian real-estate company located in Victoria, British Columbia, Canada."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is considered one of the oldest family-owned real estate companies in North America; in continuous operation since 1887."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The company was founded by Frederick B."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pemberton, a son of Joseph Despard Pemberton, who was responsible for the land surveying of the area."
    },
    {
      "cityName": "Penticton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Penticton is a city in the Okanagan Valley of British Columbia, Canada, situated between Okanagan and Skaha lakes."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city received its name from the Pitt River and Pitt Lake."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Pitt Meadows is one of the cities in British Columbia including Electoral Area A that comprises the Metro Vancouver Regional District."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city lies within the Alberni Valley at the head of the Alberni Inlet, Vancouver Island's longest inlet."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Port Alberni currently has a total population of 18,259."
    },
    {
      "cityName": "Port Alice",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Alice is a village of approximately 739 residents located on Neroutsos Inlet, southwest of Port McNeill, on Vancouver Island, originally built by Whalen Pulp and Paper Mills of Vancouver."
    },
    {
      "cityName": "Port Alice",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is known for its natural environment, pulp mill, and salt water fishing."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Known as Gamadiis in HlG̱aagilda X̱aayda kil, it is one of seven village sites that flourished in the rich waters at the mouth of Yakoun River, where an estuary shelters nine Pacific salmonid species and many kinds of birds."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded by Eli Tingley in 1907, it was once known under the name Queenstown, but renamed to Port Clements in 1914 after Herb S."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Clements, the local MP at the time, when the name \"Queenstown\" duplicated and therefore became unusable for the post office."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is one of 21 municipalities comprising Metro Vancouver."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located 27 km (17 mi) east of Vancouver, it is on the north bank of the confluence of the Fraser River and the Pitt River."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Coquitlam borders it to the north and west."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pitt Meadows lies across the Pitt River from it."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Port Coquitlam is bisected by Lougheed Highway and the Canadian Pacific Kansas City railway."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Port Coquitlam is often referred to as \"PoCo\"."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It is Canada's 93rd-largest municipality by population."
    },
    {
      "cityName": "Port Edward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Port Edward is a district municipality of 16,812 hectares, located in the Range 5 Coast Land District of British Columbia, Canada."
    },
    {
      "cityName": "Port Edward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is situated near the southern end of Chatham Sound, close to the mouth of the Skeena River, on the Tsimpsean Peninsula between Mount Stewart, Mount McDonald, and Porpoise Harbour."
    },
    {
      "cityName": "Port Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Haney, British Columbia is the name of the downtown core of the city of Maple Ridge, British Columbia."
    },
    {
      "cityName": "Port Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name derived originally from Thomas Haney, the namesake of Port Haney, the neighbourhood adjoining today's downtown along the Fraser River immediately south, which is today includes a station on the West Coast Express and was formerly a steamboat port."
    },
    {
      "cityName": "Port Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Port Haney is a designated heritage district in Maple Ridge and includes buildings moved to the neighbourhood from other parts of the municipality that otherwise might have been demolished."
    },
    {
      "cityName": "Port Hardy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Hardy is a district municipality in British Columbia, Canada located on the north-east tip of Vancouver Island."
    },
    {
      "cityName": "Port McNeill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port McNeill is a town in the North Island region of Vancouver Island, British Columbia, Canada on Vancouver Island's northeast shore, on Queen Charlotte Strait."
    },
    {
      "cityName": "Port McNeill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Originally a base camp for loggers, it became a settlement in 1936."
    },
    {
      "cityName": "Port McNeill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was named after Captain William Henry McNeill of the Hudson's Bay Company."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Moody is a city in British Columbia, Canada, and a member municipality of the Metro Vancouver Regional District."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It envelops the east end of Burrard Inlet and is the smallest of the Tri-Cities, bordered by Coquitlam on the east and south and by Burnaby on the west."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The villages of Belcarra and Anmore, along with the rugged Coast Mountains, lie to the northwest and north, respectively."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is named for Richard Clement Moody, who was the founder and the first Lieutenant-Governor of the Colony of British Columbia."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Village of Pouce Coupe is a small town in northeastern British Columbia, Canada, and a member municipality of the Peace River Regional District."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was originally named 'Pouskapie's Prairie', after the name of the local native band chief."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The 2.06-square-kilometre (0.80 sq mi) municipality is home to 792 residents."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Most of its population lives near the eastern shores of Malaspina Strait, which is part of the larger Georgia Strait between Vancouver Island and the Mainland."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With two intervening long, steep-sided fjords inhibiting the construction of a contiguous road connection with Vancouver to the south, geographical surroundings explain Powell River's remoteness as a community, despite relative proximity to Vancouver and other populous areas of the BC Coast."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is the location of the head office of the qathet Regional District."
    },
    {
      "cityName": "Prince George",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Prince George is a city in British Columbia, Canada, situated at the confluence of the Fraser and Nechako rivers."
    },
    {
      "cityName": "Prince George",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is often called the province's \"northern capital\" because it serves as a centre for higher education, health care, government services, arts and entertainment, sports, and support for major industries such as forest products and mining."
    },
    {
      "cityName": "Prince Rupert",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located on Kaien Island near the Alaskan panhandle."
    },
    {
      "cityName": "Princeton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Princeton is a town municipality in the Similkameen region of southern British Columbia, Canada."
    },
    {
      "cityName": "Princeton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The former mining and railway hub lies at the confluence of the Tulameen into the Similkameen River, just east of the Cascade Mountains."
    },
    {
      "cityName": "Princeton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "At the junction of BC Highway 3 and 5A, the locality is by road about 67 kilometres (42 mi) northwest of Keremeos, 133 kilometres (83 mi) east of Hope, and 90 kilometres (56 mi) south of Merritt."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located nearly evenly between the cities of Prince George and Williams Lake, it is on the main route to northern British Columbia and the Yukon."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Quesnel is located at the confluence of the Fraser River and Quesnel River."
    },
    {
      "cityName": "Quilchena",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On the former main route between Merritt and Kamloops, it is now largely bypassed since the construction of the Coquihalla Highway."
    },
    {
      "cityName": "Quilchena",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A heritage hotel is the main landmark, lately transformed into a small golf resort."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A hot spring, thermal spring, hydrothermal spring, or geothermal spring is a spring produced by the emergence of geothermally heated groundwater onto the surface of the Earth."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The groundwater is heated either by shallow bodies of magma or by circulation through faults to hot rock deep in the Earth's crust."
    },
    {
      "cityName": "Ranch Park",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cedar Park is a city and a suburb of Austin in the U.S. state of Texas, approximately 16 miles (26 km) northwest of the center of Austin."
    },
    {
      "cityName": "Renfrew Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Vancouver School Board (VSB), officially the Board of Education of School District No."
    },
    {
      "cityName": "Renfrew Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "39 (Vancouver), is a school district based in Vancouver, British Columbia, Canada."
    },
    {
      "cityName": "Renfrew Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "A board of nine elected trustees governs this school district that serves the city of Vancouver and the University Endowment Lands."
    },
    {
      "cityName": "Renfrew-Collingwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Renfrew–Collingwood is a large neighbourhood that lies on the eastern side of Vancouver, British Columbia, Canada, on its boundary with Burnaby and encompassing an area that was one of the earlier developed regions of the city."
    },
    {
      "cityName": "Renfrew-Collingwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a diverse area that includes a substantial business community in several areas, as well as some of the fastest-growing residential sectors of Vancouver."
    },
    {
      "cityName": "Renfrew-Collingwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In 2011, the neighbourhood had a population of 50,500, 38.4% of whom claim Chinese as their first language."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Revelstoke is located 641 kilometres (398 mi) east of Vancouver, and 415 kilometres (258 mi) west of Calgary, Alberta."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is situated on the banks of the Columbia River just south of the Revelstoke Dam and near its confluence with the Illecillewaet River."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "East of Revelstoke are the Selkirk Mountains and Glacier National Park, penetrated by Rogers Pass used by the Trans-Canada Highway and the Canadian Pacific Railway."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "South of the community down the Columbia River are the Arrow Lakes, Mount Begbie, and the Kootenays."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It occupies almost the entirety of Lulu Island, the adjacent Sea Island and several other smaller islands and uninhabited islets to its north and south."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Across the two estuarine distributaries of the Fraser River, it neighbours Vancouver and Burnaby on the Burrard Peninsula to the north, New Westminster and Annacis Island to the east, Delta to the south, and the Strait of Georgia to the west."
    },
    {
      "cityName": "Riley Park",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riley Park is an urban park in Calgary, Alberta, Canada."
    },
    {
      "cityName": "Riley Park",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located in the neighbourhood of Hillhurst, bounded by 8th Ave."
    },
    {
      "cityName": "Riley Park",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The park is host to Calgary's cricket leagues, and the Calgary Concert Band holds free concerts in the park during summer."
    },
    {
      "cityName": "Riley Park",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Amenities include a wading pool and playground."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rossland is in the West Kootenay region of south central British Columbia."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "High in the Monashee Mountains, the city lies immediately east of the intersections of BC highways 3B and 22."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The facilities provide a winter base for the nearby multi-peak ski hills of the Red Mountain Resort."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In the non-winter months Rossland is frequented by mountain bikers, with golf and fishing options nearby as well."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rutland is a ceremonial county in the East Midlands of England."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It borders Leicestershire to the north and west, Lincolnshire to the north-east, and Northamptonshire to the south-west."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Saanich is a district municipality on the southern end of Vancouver Island in British Columbia, Canada, within the Greater Victoria area."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With an area of 103.44 square kilometres (39.94 sq mi), Saanich is also the largest municipality in Greater Victoria."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The district adopted its name after the Saanich First Nation, meaning \"emerging land\" or \"emerging people\"."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sahali is a town in eastern Tunisia."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located at around 35°46′N 10°17′E."
    },
    {
      "cityName": "Salmo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Salmo is a genus of ray-finned fish from the subfamily Salmoninae of family Salmonidae, and is part of the tribe Salmonini along with the sister genera Salvelinus and Salvethymus."
    },
    {
      "cityName": "Salmo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Almost all Salmo species are native only in the Old World, the only exception being the Atlantic salmon, which is also naturally found across the North Atlantic in eastern North America."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Salmon Arm is a city in the Columbia Shuswap Regional District of the Southern Interior of the Canadian province of British Columbia that has a population of 19,432 (2021)."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city of Salmon Arm separated from the district in 1912, but was downgraded to a village in 1958."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Salmon Arm once again reunited with the District Municipality in 1970."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Salmon Arm once again became a city in 2005, and is now the location of the head offices of the Columbia-Shuswap Regional District."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is a tourist town in the summer, connected to all 4 arms of Shuswap Lake, with many beaches, numerous golf courses, camping facilities, and house boat rentals."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Salmon Arm is home to the longest wooden freshwater wharf in North America."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sayward is a village located in the Sayward Valley on the northeast coast of Vancouver Island in British Columbia, Canada."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is about 1.6 kilometres (1 mi) inland from Kelsey Bay on a spur from Highway 19."
    },
    {
      "cityName": "Seafair",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Seafair is an annual summer boating event, air show, and festival in Seattle, Washington, that encompasses a wide variety of small neighborhood events leading up to several major citywide celebrations."
    },
    {
      "cityName": "Seafair",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its main events include the Torchlight Parade, Seafair Cup hydroplane races, and an air show that often features the Blue Angels."
    },
    {
      "cityName": "Seafair",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Seafair also encompasses smaller block parties and local parades around the city and Seattle metropolitan area."
    },
    {
      "cityName": "Sechelt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sechelt is a district municipality located on the lower Sunshine Coast of British Columbia."
    },
    {
      "cityName": "Sechelt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Approximately 50 kilometres (31 mi) northwest of Vancouver, it is accessible from mainland British Columbia by a 40-minute ferry trip between Horseshoe Bay and Langdale, and a 25-minute drive from Langdale along Highway 101, also known as the Sunshine Coast Highway."
    },
    {
      "cityName": "Sechelt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The name Sechelt is derived from the she shashishalhem word shíshálh, the name of the First Nations people who first settled the area thousands of years ago."
    },
    {
      "cityName": "Second Street",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "Second Street",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "Second Street",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Second Street",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "Shelbourne",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hillside Shopping Centre, also referred to as Hillside Mall, is a commercial shopping mall in Victoria, British Columbia, Canada."
    },
    {
      "cityName": "Shelbourne",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was built in 1962 and has recently completed a major renovation."
    },
    {
      "cityName": "Shelbourne",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The centre is home to 100+ shops and services including a spacious food court with 14 vendors."
    },
    {
      "cityName": "Shelbourne",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Stores include Marshalls, Sport Chek / Atmosphere, Bolen Books, Thrifty Foods, Canadian Tire, and Walmart."
    },
    {
      "cityName": "Sicamous",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sicamous is a district municipality in the Shuswap Country region of south central British Columbia."
    },
    {
      "cityName": "Sicamous",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The place is adjacent to the narrows, which is the confluence of Mara Lake into Shuswap Lake."
    },
    {
      "cityName": "Sicamous",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "At the BC Highway 97A intersection on BC Highway 1, the locality is by road about 73 kilometres (45 mi) west of Revelstoke, 140 kilometres (87 mi) east of Kamloops, and 75 kilometres (47 mi) north of Vernon."
    },
    {
      "cityName": "Silverton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Silverton is a village about 5 kilometres (3 mi) south of New Denver in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Silverton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The former steamboat landing is at the mouth of Silverton Creek on the eastern shore of Slocan Lake."
    },
    {
      "cityName": "Silverton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The locality, on BC Highway 6 at the junction of BC Highway 31A, is about 95 kilometres (59 mi) by road north of Castlegar and 155 kilometres (96 mi) by road and ferry south of Revelstoke."
    },
    {
      "cityName": "Slocan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Slocan Lake is a lake in the Slocan Valley of the West Kootenay region of the Southeastern Interior of British Columbia, Canada."
    },
    {
      "cityName": "Slocan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is fed by Bonanza Creek and drained by the Slocan River."
    },
    {
      "cityName": "South Granville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "South Granville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "South Granville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "South Granville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "South Slope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Park Slope is a neighborhood in South Brooklyn, New York City, within the area once known as South Brooklyn."
    },
    {
      "cityName": "South Slope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Park Slope is roughly bounded by Prospect Park and Prospect Park West to the east, Fourth Avenue to the west, Flatbush Avenue to the north, and Prospect Expressway to the south."
    },
    {
      "cityName": "South Slope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Generally, the neighborhood is divided into three sections from north to south: North Slope, Center Slope, and South Slope."
    },
    {
      "cityName": "South Slope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood takes its name from its location on the western slope of neighboring Prospect Park."
    },
    {
      "cityName": "South Slope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Fifth Avenue and Seventh Avenue are its primary commercial streets, while its east–west side streets are lined with brownstones and apartment buildings."
    },
    {
      "cityName": "South Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "South Surrey is a community within the City of Surrey, British Columbia, located on the Semiahmoo peninsula in the southern portion of the City of Surrey, sharing a border with the City of White Rock."
    },
    {
      "cityName": "South Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Neighbourhoods of South Surrey include Crescent Beach, Crescent Heights, Elgin, Chantrell Creek, Morgan Creek, Grandview Heights, Hazelmere, Ocean Park, and Sunnyside."
    },
    {
      "cityName": "South Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Most of South Surrey lies in White Rock's population centre."
    },
    {
      "cityName": "Sparwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sparwood is a district municipality in the Canadian province of British Columbia."
    },
    {
      "cityName": "Sparwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the second-largest community on the Elk River."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Squamish is a community and a district municipality in the Canadian province of British Columbia, located at the north end of Howe Sound on the Sea to Sky Highway."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The settlement of Steveston, founded in the 1880s, is a neighbourhood of Richmond in Metro Vancouver."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On the southwest tip of Lulu Island, the village is a historic port and salmon canning centre at the mouth of the South Arm of the Fraser River."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The early 1900s style architecture attracts both the film and tourism industries."
    },
    {
      "cityName": "Stewart",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Stewart is a district municipality at the head of the Portland Canal in northwestern British Columbia, Canada, near the Alaskan panhandle."
    },
    {
      "cityName": "Stewart",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In 2021, it had a population of 517."
    },
    {
      "cityName": "Strathcona",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Strathcona Provincial Park is the oldest provincial park in British Columbia, Canada, and the largest on Vancouver Island."
    },
    {
      "cityName": "Strathcona",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded in 1911, the park was named for Donald Alexander Smith, 1st Baron Strathcona and Mount Royal, a wealthy philanthropist and railway pioneer."
    },
    {
      "cityName": "Strathcona",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It lies within the Strathcona Regional District."
    },
    {
      "cityName": "Strathcona",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Clayoquot Sound Biosphere Reserve, established in 2000, includes three watersheds in the western area of the park."
    },
    {
      "cityName": "Strawberry Hill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mission is a city in the Lower Mainland of the province of British Columbia, Canada."
    },
    {
      "cityName": "Strawberry Hill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by the city of Abbotsford to the south and the city of Maple Ridge to the west."
    },
    {
      "cityName": "Sun Peaks Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sun Peaks Resort is an ski resort located in Sun Peaks, British Columbia, Canada, 56.6 km (35.2 mi) northeast of Kamloops."
    },
    {
      "cityName": "Sunset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sunset is the disappearance of the Sun at the end of the Sun path, below the horizon of the Earth due to its rotation."
    },
    {
      "cityName": "Sunset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As viewed from everywhere on Earth, it is a phenomenon that happens approximately once every 24 hours, except in areas close to the poles."
    },
    {
      "cityName": "Sunset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The equinox Sun sets due west at the moment of both the spring and autumn equinoxes."
    },
    {
      "cityName": "Sunset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As viewed from the Northern Hemisphere, the Sun sets to the northwest in the spring and summer, and to the southwest in the autumn and winter; these seasons are reversed for the Southern Hemisphere."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located south of the Fraser River on the Canada–United States border."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is a member municipality of the Metro Vancouver regional district and metropolitan area."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Mainly a suburban city, Surrey is the province's second-largest by population after Vancouver and the third-largest by area after Abbotsford and Prince George."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Seven neighbourhoods in Surrey are designated town centres: Cloverdale, Fleetwood, Guildford, Newton, South Surrey, and City Centre encompassed by Whalley."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Whalley is the most densely populated and urban of the six town centres in Surrey, British Columbia, Canada."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It encompasses City Centre, the city's central business district, and is home to the Surrey City Hall, the main branch of Surrey Libraries, Central City, SFU Surrey and the site of Kwantlen Polytechnic University's (KPU) Civic Plaza campus."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the only town centre in Surrey served by Metro Vancouver's SkyTrain rapid transit system."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Expo Line stations serving Whalley include Scott Road, Gateway, Surrey Central and King George."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tahsis is a village municipality on the west coast of Vancouver Island, British Columbia, Canada, about 300 km (186 mi) northwest of the provincial capital Victoria at 49°55′33″N 126°37′16″W."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Village of Tahsis economy used to be dependent on forestry, but after the closure of the local sawmill in 2001, the economy became heavily dependent on sport fishing for salmon and halibut, outdoor recreation and tourism."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "Telkwa",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Telkwa is a village located along British Columbia Highway 16, nearly 15 kilometres (9 mi) southeast of the town of Smithers and 350 kilometres (220 mi) west of the city of Prince George, in northwest British Columbia, Canada."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This regional hub lies east of the confluence of the Kitsumkalum River into the Skeena River."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 16, junctions branch northward for the Nisga'a Highway to the west and southward for the Stewart–Cassiar Highway to the east."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The locality is by road about 204 km (127 mi) southwest of Smithers and 144 km (89 mi) east of Prince Rupert."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Transportation links are the Northwest Regional Airport Terrace-Kitimat, a passenger train, and bus services."
    },
    {
      "cityName": "Thompson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kamloops is a city in south-central British Columbia, Canada, at the confluence of the North and South Thompson Rivers, which join to become the Thompson River in Kamloops, and east of Kamloops Lake."
    },
    {
      "cityName": "Thompson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is the administrative centre for, and largest city in, the Thompson-Nicola Regional District, a region of the British Columbia Interior."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tofino is a town of approximately 2,516 residents on the west coast of Vancouver Island in the Canadian province of British Columbia."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The District of Tofino is located at the western terminus of Highway 4 on the tip of the Esowista Peninsula at the southern edge of Clayoquot Sound."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is situated in the traditional territory of the Tla-o-qui-aht First Nations."
    },
    {
      "cityName": "Townline",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Townline is a Canadian rock group from Welland, Ontario."
    },
    {
      "cityName": "Townline",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Members of the band include Serena Pryne (vocals), Nick Lesyk (guitar), Greg Zack, and Allan Colavecchia (drums)."
    },
    {
      "cityName": "Townline",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Musically, the band performs heavy rock and roll music, with music that appears to be influenced by older artists such as AC/DC, Led Zeppelin, Janis Joplin, and The Ramones, but performed in such a manner that allows their music to stay fresh and non-derivative."
    },
    {
      "cityName": "Townline",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The band has been described as \"If Tina Turner sang lead for The Cult.\""
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A trail, also known as a path or track, is an unpaved lane or a small paved road generally not intended for usage by motorized vehicles, usually passing through a natural area."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "However, it is sometimes applied to highways in North America."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In the United Kingdom and Ireland, a path or footpath is the preferred term for a pedestrian or hiking trail."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In the US, the term was historically used for a route into or through wild territory used by explorers and migrants."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In the United States, \"trace\" is a synonym for trail, as in Natchez Trace."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tsawwassen is a suburban, mostly residential community on a peninsula in the southwestern corner of the City of Delta in British Columbia, Canada."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It provides the only road access to the American territory on the southern tip of the peninsula of the same name, the community of Point Roberts, Washington, via 56th Street."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is also the location of Tsawwassen Ferry Terminal, part of the BC Ferries, built in 1959 to provide foot-passenger and motor vehicle access from the Lower Mainland to the southern part of Vancouver Island and the southern Gulf Islands."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Because Tsawwassen touches a shallow bank, the ferry terminal is built at the southwestern end of a 3 km (1.9 mi) causeway that juts into the Strait of Georgia."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Boundary Bay Airport, a major training hub for local and international pilots which also provides local airplane and helicopter service, is ten minutes away."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Roberts Bank Superport is also nearby."
    },
    {
      "cityName": "Tumbler Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tumbler Ridge is a district municipality in the foothills of the B.C."
    },
    {
      "cityName": "Tumbler Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Rockies in northeastern British Columbia, Canada, and a member municipality of the Peace River Regional District."
    },
    {
      "cityName": "Tumbler Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The townsite is located near the confluence of the Murray River and Flatbed Creek and the intersection of Highway 52 and Highway 29 and includes the site of the Tumbler Ridge Secondary School and Tumbler Ridge Airport."
    },
    {
      "cityName": "Tumbler Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The municipality is part of the Peace River South provincial electoral district and the Prince George—Peace River—Northern Rockies federal riding."
    },
    {
      "cityName": "Ucluelet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ucluelet is a district municipality on the Ucluelet Peninsula, on the west coast of Vancouver Island in British Columbia, Canada."
    },
    {
      "cityName": "Ucluelet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Ucluelet comes from Yuułuʔił which means \"people of the safe harbour\" in the indigenous Nuu-chah-nulth language and is the homeland of the Yuułuʔiłʔatḥ."
    },
    {
      "cityName": "University Endowment Lands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies west of Vancouver and east of the University of British Columbia's Point Grey campus lands."
    },
    {
      "cityName": "University Endowment Lands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Most of the University Endowment Lands' land area is occupied by Pacific Spirit Regional Park, a large nature park operated by Metro Vancouver, with the remainder consisting of residential and commercial developments."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Valemount is a village municipality of 1,018 people in east central British Columbia, Canada, 320 kilometres (200 mi) from Kamloops, British Columbia."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is between the Rocky, Monashee, and Cariboo Mountains."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the nearest community to the west of Jasper National Park, and is also the nearest community to Mount Robson Provincial Park, which features Mount Robson, the tallest mountain in the Canadian Rockies."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Outdoor recreation is popular in summer and winter—hiking, skiing, snowmobiling, cross-country skiing, mountain biking and horseback riding are common activities."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Valemount is one of 14 designated resort municipalities in British Columbia."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vanderhoof is a district municipality near the geographical centre of British Columbia, Canada."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its main industries are forestry, agriculture, and related businesses."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Tourism is also growing, and mining operations are being developed in the area."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It has many elementary schools, and one major secondary school, Nechako Valley Secondary School (NVSS), comprising School District 91 Nechako Lakes."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The College of New Caledonia has a regional campus there."
    },
    {
      "cityName": "Vedder Crossing",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Vedder River, called the Chilliwack River above Vedder Crossing, is a river in the Canadian province of British Columbia and the U.S. state of Washington."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is 440 km (270 mi) northeast of Vancouver."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With this population, Vernon is the largest city in the North Okanagan Regional District."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "A resident of Vernon is called a \"Vernonite.\""
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria is the capital city of the Canadian province of British Columbia, located on the southern tip of Vancouver Island off Canada's Pacific coast."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city has a population of 91,867, and the Greater Victoria area has a population of 397,237."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4,406 inhabitants per square kilometre (11,410/sq mi)."
    },
    {
      "cityName": "Victoria West",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria is the capital city of the Canadian province of British Columbia, located on the southern tip of Vancouver Island off Canada's Pacific coast."
    },
    {
      "cityName": "Victoria West",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city has a population of 91,867, and the Greater Victoria area has a population of 397,237."
    },
    {
      "cityName": "Victoria West",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4,406 inhabitants per square kilometre (11,410/sq mi)."
    },
    {
      "cityName": "Victoria-Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria is the capital city of the Canadian province of British Columbia, located on the southern tip of Vancouver Island off Canada's Pacific coast."
    },
    {
      "cityName": "Victoria-Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city has a population of 91,867, and the Greater Victoria area has a population of 397,237."
    },
    {
      "cityName": "Victoria-Downtown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4,406 inhabitants per square kilometre (11,410/sq mi)."
    },
    {
      "cityName": "Victoria-Fraserview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Victoria–Fraserview is a neighbourhood in the City of Vancouver, set on the south slope of the rise that runs north from the Fraser River and encompassing a large area of residential and commercial development."
    },
    {
      "cityName": "Victoria-Fraserview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Surrounding the culturally eclectic Victoria Drive corridor, Victoria–Fraserview is an ethnically diverse area that was one of the earliest areas of settlement in the region."
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Walnut Grove is a town centre located within the Township of Langley, British Columbia."
    },
    {
      "cityName": "Warfield",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Warfield is a village and civil parish in the Bracknell Forest district, in the ceremonial county of Berkshire, England."
    },
    {
      "cityName": "Warfield",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In 2021 it had a population of 11,260."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "West Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The pharaohs were the rulers of Ancient Egypt from the unification of Upper and Lower Egypt c."
    },
    {
      "cityName": "West Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "3100 BC, with several times of fragmentation and foreign rule."
    },
    {
      "cityName": "West Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The specific title of \"pharaoh\" was not used until the New Kingdom, c."
    },
    {
      "cityName": "West Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "1400 BC, but it is retroactively applied to all Egyptian kings; the generic term for monarchs was \"nesut\"."
    },
    {
      "cityName": "West Clayton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In addition to these titles, pharaohs had a complex royal titulary that remained relatively constant during its 3000-year history, having up to five royal names."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "West Kelowna, formerly known as Westside and colloquially known as Westbank, is a city in British Columbia's Okanagan Valley on the west shore of Okanagan Lake."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city encompasses several neighbourhoods, including Casa Loma, Gellatly, Glenrosa, Lakeview Heights, Shannon Lake, Smith Creek, Rose Valley, Westbank, and West Kelowna Estates."
    },
    {
      "cityName": "West Point Grey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "West Point Grey is a neighbourhood in the northwest of the city of Vancouver, British Columbia, Canada."
    },
    {
      "cityName": "West Point Grey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is on Point Grey and bordered by 16th Avenue to the south, Alma Street to the east, English Bay to the north, and Blanca Street to the west."
    },
    {
      "cityName": "West Point Grey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Notable beaches within West Point Grey include Spanish Banks, Locarno and Jericho."
    },
    {
      "cityName": "West Point Grey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Immediately to the south is Pacific Spirit Regional Park and to the east is Kitsilano."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "West Vancouver is a district municipality in the province of British Columbia, Canada."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A member municipality of the Metro Vancouver Regional District, West Vancouver is situated on the north shore of Burrard Inlet to the northwest of the city of Vancouver."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "With the District of North Vancouver and the City of North Vancouver, West Vancouver is part of a regional grouping known as the North Shore municipalities."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is among the wealthiest municipalities in Canada by average household net worth."
    },
    {
      "cityName": "Westwood Plateau",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Westwood Plateau is a neighbourhood in the northern region of Coquitlam, British Columbia."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Surrey is a city in British Columbia, Canada."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located south of the Fraser River on the Canada–United States border."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is a member municipality of the Metro Vancouver regional district and metropolitan area."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Mainly a suburban city, Surrey is the province's second-largest by population after Vancouver and the third-largest by area after Abbotsford and Prince George."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Seven neighbourhoods in Surrey are designated town centres: Cloverdale, Fleetwood, Guildford, Newton, South Surrey, and City Centre encompassed by Whalley."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "White Rock is a city in British Columbia, Canada, and a member municipality of the Metro Vancouver Regional District."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by Semiahmoo Bay to the south and is surrounded on three sides by Surrey."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "To the southeast across a footbridge lies the Semiahmoo First Nation, which is within the borders of Surrey."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Semiahmoo Bay and the Southern Gulf Islands in the Strait of Georgia are also to the south."
    },
    {
      "cityName": "Williams Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Affectionately referred to as \"Billy's Puddle\" by locals, Williams Lake is one of the largest cities, by population of metropolitan area, in the Cariboo after neighbouring Quesnel."
    },
    {
      "cityName": "Williams Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is famous for the Williams Lake Stampede, which is the second largest professional rodeo in Canada, after only the Calgary Stampede."
    },
    {
      "cityName": "Willingdon Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Willingdon Heights is a neighbourhood in Burnaby, British Columbia, Canada."
    },
    {
      "cityName": "Willingdon Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is named after a major Burnaby thoroughfare, Willingdon, Avenue connecting North Burnaby with Kingsway and the Metrotown area in the south."
    },
    {
      "cityName": "Willingdon Heights",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Willingdon Heights was developed significantly during construction spurred by the National Housing Act in 1944 that made mortgage money more widely available and provided joint loans for housing for veterans under the Integrated Housing Plan (IHP)."
    },
    {
      "cityName": "Willoughby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The DeKalb Avenue Line is a public transit line in Brooklyn and Queens, New York City, running mostly along DeKalb Avenue, as well as eastbound on Lafayette Avenue, between Downtown Brooklyn and Ridgewood, Queens."
    },
    {
      "cityName": "Willoughby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Originally a streetcar line, it is now the B38 DeKalb/Lafayette Avenues bus route, operated by the New York City Transit Authority."
    },
    {
      "cityName": "Woodwards",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vancouver is a major city in Western Canada, located in the Lower Mainland region of British Columbia."
    },
    {
      "cityName": "Woodwards",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Metro Vancouver area had a population of 2.6 million in 2021, making it the third-largest metropolitan area in Canada."
    },
    {
      "cityName": "Woodwards",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Woodwards",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Vancouver has the highest population density in Canada, with over 5,700 inhabitants per square kilometre (15,000/sq mi), and the fourth highest in North America."
    },
    {
      "cityName": "Yaletown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Yaletown is an area of Downtown Vancouver, Canada, bordered by False Creek and Robson and Homer Streets."
    },
    {
      "cityName": "Yaletown",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Formerly a heavy industrial area dominated by warehouses and rail yards, since the 1986 World's Fair it has been transformed into one of the most densely populated neighbourhoods in the city."
    },
    {
      "cityName": "Zeballos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A village is a classification of municipalities used in the Canadian province of British Columbia."
    },
    {
      "cityName": "shíshálh Nation",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "shíshálh Nation is a First Nation located on the Sunshine Coast of British Columbia, Canada."
    },
    {
      "cityName": "shíshálh Nation",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Their swiya comprises 515,000 hectares that stretches from xwesam in the southeast, to x̱enichen in the north, to kwekwenis in the southwest."
    }
  ]
}