{
  "facts": [
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is home to Tradex, the University of the Fraser Valley, and Abbotsford International Airport."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community of 375.55 square kilometres (145.00 sq mi) is the largest city by area in British Columbia."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Much of Abbotsford has views of Mount Baker (to the southeast, in Washington) and the Coast Mountains (to the north)."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "With a census population of 153569 people (2021), it is the most populous municipality in the province outside metropolitan Vancouver."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It has also been named by Statistics Canada as Canada's most generous city in terms of charitable donations for nine consecutive years."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The municipality's southern boundary is the Canada–United States border."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "In Canada, it is bordered by the Township of Langley to the west, the City of Mission to the north, and the City of Chilliwack to the east."
    },
    {
      "cityName": "Abbotsford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Abbotsford borders the town of Sumas, Washington, to the south."
    },
    {
      "cityName": "Aberdeen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Aberdeen, British Columbia may refer to: Aberdeen, Abbotsford, a neighbourhood in Abbotsford, British Columbia Aberdeen, Kamloops, a neighbourhood in Kamloops, British Columbia"
    },
    {
      "cityName": "Agassiz",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The majority of Kent's population resides in the Agassiz area."
    },
    {
      "cityName": "Albion",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the oldest non-indigenous community of the district's settlements, and is only slightly younger than Fort Langley, adjacent across the Fraser River, and Kanaka Creek, which is just to the west and lies along the creek of the same name."
    },
    {
      "cityName": "Albion",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Albion, British Columbia is a neighbourhood in Maple Ridge, British Columbia and is one of several small towns incorporated within the municipality at its creation."
    },
    {
      "cityName": "Albion",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Burgeoning newer home construction east of 240th Street near the Lougheed Highway is also often referred to as part of Albion."
    },
    {
      "cityName": "Ambleside",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ambleside covers the area from 19th Street to 13th Street, and from Fulton Avenue down to the waterfront."
    },
    {
      "cityName": "Ambleside",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Marine Drive forms the centre of the community's commercial core, with two streets leading off from it."
    },
    {
      "cityName": "Anmore",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is north of the city of Port Moody and along the shores of the Indian Arm."
    },
    {
      "cityName": "Anmore",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Anmore is one of three politically independent village municipalities in the Greater Vancouver area, the others being its neighbour Belcarra, and Lions Bay."
    },
    {
      "cityName": "Arbutus Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Arbutus Ridge Seaside Community for Active Adults is an age-qualified, gated community located on the southeastern coast of Vancouver Island in the Cobble Hill Electoral Area of British Columbia's Cowichan Valley Regional District."
    },
    {
      "cityName": "Armstrong",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It overlooks the Spallumcheen Valley, which forms a broad pass between the Okanagan Valley to the south and the Shuswap Country to the north, and is about 480 km (300 mi) from each of Vancouver, B C and Spokane, Washington."
    },
    {
      "cityName": "Armstrong",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The City of Armstrong celebrated its centennial in 2013."
    },
    {
      "cityName": "Ashcroft",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "East of BC Highway 1 and on BC Highway 97C, the locality is by road about 45 kilometres (28 mi) north of Spences Bridge and 11 kilometres (7 mi) south of Cache Creek."
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in Howe Sound, it is approximately 6 kilometres (3.7 mi) wide by 12 kilometres (7.5 mi) long, and at its closest point is about 3 kilometres (1.9 mi) west of the mainland."
    },
    {
      "cityName": "Bowen Island",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "There is regular ferry service from Horseshoe Bay provided by BC Ferries, and semi-regular water taxi services."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brocklehurst, which briefly existed as a district municipality in its own right from 1971 until amalgamation with Kamloops in 1973, is the largest of the city's neighbourhoods, accounting for 16% of the city's population."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is named after Ernest Brocklehurst, from Liverpool, England who lived in the area between 1896 and 1907."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Brocklehurst is bordered by the Thompson River to the south, North Shore to the east, Tranquille to the west, and the Batchelor hills and Batchelor Heights aka Batchelor Hills to the north."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Brocklehurst is a neighbourhood in the western area of Kamloops, British Columbia, Canada."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The Brocklehurst area (or Brock, as referred to by its residents), is the warmest and most hospitable of the micro-climates in the city of Kamloops."
    },
    {
      "cityName": "Brocklehurst",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "There can be as much as a 4 degree Celsius increase from Brock to Aberdeen, all within the city of Kamloops."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Brookswood disc golf course at Langley Passive Park is popular with disc golf enthusiasts."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "13200) in the Township of Langley, British Columbia, Canada, located on the west side of that municipality to the south of the Nicomekl River."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is largely a residential area with several commercial areas, a Recreation Centre with a hockey area and curling rink."
    },
    {
      "cityName": "Brookswood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Next to the Recreation Centre is a BMX track originally built in 1977 and a skate park in 2001."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Burke, 1270 m (4167 ft), is a mountain located in northeast Coquitlam, British Columbia, north of Port Coquitlam on the ridge system leading to Coquitlam Mountain."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Most of the mountain is part of Pinecone Burke Provincial Park."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The mountain can be accessed via Coast Meridian Road and Quarry Road, although a significant amount of hiking is necessary to reach the peak."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Although people who own cabins on the mountain may use snowmobiles instead of hiking."
    },
    {
      "cityName": "Burke Mountain",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Mount Burke is found in Coquitlam near Minnekhada Regional Park."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The village is known for its rich First Nations heritage, and for its network of mountain biking trails, which have received acclaim by becoming Canada's first IMBA Ride Centre."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town serves as a hub for the local logging, saw-milling, mining and tourist industries."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Burns Lake is located in the midst of a large networks of lakes called the Lakes District, with fishing and hunting year round, and water activities in the summer months."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Burns Lake is a rural village in the north-western-central interior of British Columbia, Canada, incorporated in 1923."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Local nations include Wetʼsuwetʼen First Nation, Lake Babine Nation, Cheslatta Carrier Nation, Ts'il Kaz Koh First Nation, Skin Tyee First Nation and Nee-Tahi-Buhn Band."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It also serves as the main commercial centre for the surrounding area including François Lake, Colleymount, Grassy Plains, Rose Lake, Topley, and Granisle."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The village had a population of 1659 as of the 2021 Census."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "In winter, cross country skiing trails and snowmobile wilderness trails are created."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "There are two First Nations reserves that are part of the town, and another four nearby, making it one of the few communities in the province that have almost equal populations of persons of native or European descent."
    },
    {
      "cityName": "Burns Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "There are three pubs, several cafes and restaurants a selection of stores, hotels and motels, and services including a library and a hospital."
    },
    {
      "cityName": "Burquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Burquitlam is a neighbourhood and commercial district of the City of Coquitlam, British Columbia, Canada."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cache Creek is a historic transportation junction and incorporated village 354 kilometres (220 mi) northeast of Vancouver in British Columbia, Canada."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The same intersection and the town that grew around it was at the point on the Cariboo Wagon Road where a branch road, and previously only a trail, led east to Savona's Ferry on Kamloops Lake."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "This community is also the point at which a small stream, once known as Riviere de la Cache, joins the Bonaparte River."
    },
    {
      "cityName": "Cache Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is on the Trans-Canada Highway in the province of British Columbia at a junction with Highway 97."
    },
    {
      "cityName": "Campbell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Campbell River has a population (2021 census) of 35138 and has long been touted as the \"salmon capital of the world.\" Campbell River and Region are near the communities of Quadra and the Discovery Islands, Sayward, Oyster River, Gold River, Tahsis and Zeballos."
    },
    {
      "cityName": "Campbell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Campbell River is served by the coast-spanning Island Highway, the nearby but now defunct Island Rail Corridor, and Campbell River Airport."
    },
    {
      "cityName": "Canal Flats",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This Columbia Valley community lies between the southern end of Columbia Lake and the northwest shore of the Kootenay River."
    },
    {
      "cityName": "Canal Flats",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The locality, on Highway 93/95, is by road about 83 kilometres (52 mi) north of Cranbrook and 165 kilometres (103 mi) southeast of Golden."
    },
    {
      "cityName": "Capitol Hill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Standing on the north side of Hastings Street and bounded by Willingdon Avenue to the west and Fell Avenue in the east, this neighbourhood is known for its Italian, Portuguese, and Croatian expat communities, as well as being a student area associated with the nearby Simon Fraser University."
    },
    {
      "cityName": "Capitol Hill",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Capitol Hill is a 203-meter-tall hill in the city of Burnaby, British Columbia, Canada, and also is the name of the neighbourhood spanning the summit of the hill."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the Selkirk Mountains, at the confluence of the Kootenay and Columbia Rivers, it is a regional trade and transportation centre, with a local economy based on forestry, mining and tourism."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Castlegar is home to Selkirk College, a regional airport, a pulp mill, and several sawmills."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The area which became Castlegar was an important centre for the Sinixt (Lakes) Peoples."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Outside the city limits are the small surrounding communities of Ootischenia, Brilliant, Robson, Robson West, Raspberry, Tarrys, Thrums, Glade, Shoreacres, Fairview, Genelle, Pass Creek and Krestova, and the much smaller communities of Deer Park, Renata, and Syringa on Lower Arrow Lake."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Its population of 8338 includes many Doukhobors, who were largely responsible for much of the town's early development and growth."
    },
    {
      "cityName": "Castlegar",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "These outlying areas have a further population of about 8000 people."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The area's best-known tourist attractions are the Butchart Gardens, located in the Brentwood Bay area, Gowlland Tod Provincial Park, and Island View Beach."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the traditional territory of the W̱SÁNEĆ people."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The district began as a farming community, and many hobby farms, along working farms and vineyards, still exist."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In recent decades, the area has seen increasing residential, commercial, and industrial development, especially around the neighbourhoods of Brentwood Bay and Saanichton, which are occasionally referred to as separate communities."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The mayor of Central Saanich is former district councillor Ryan Windsor."
    },
    {
      "cityName": "Central Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Municipal councillors last elected in 2022 include Niall Paltiel, Sarah Riddell, Zeb King, Bob Thompson, Gord Newton, and Christopher Graham."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chase Creek, which drops over three small waterfalls before flowing through the town, enters the South Thompson just below the lake's outlet."
    },
    {
      "cityName": "Chase",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has a population of 2399, and its main industries are forestry and tourism."
    },
    {
      "cityName": "Chilliwack",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is bounded on the north side by the Fraser River, and on the south side by the Vedder River and Canada–United States border, and is surrounded by tall mountain peaks, such as Mount Cheam and Slesse Mountain."
    },
    {
      "cityName": "Chilliwack",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "About two-thirds of city land is protected as part of the Agricultural Land Reserve, and agriculture accounts for about 30 percent of the local economy."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is near Wells Gray Provincial Park and is surrounded by the Trophy Mountains, Raft Mountain and Dunn Peak."
    },
    {
      "cityName": "Clearwater",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The District of Clearwater was established on December 3, 2007, making it one of the newest municipalities in British Columbia."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Clinton Museum, built in 1892, has a number of historical artifacts on display that date back to the gold rush and founding of the area."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Clinton Annual Ball is one of British Columbia's oldest continual events having first been held in 1867 and was a highlight of the social calendar in the British Columbia Interior for many decades."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Clinton has a number of attractions including horse-back riding, big game viewing, hiking, fishing and other outdoor activities."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is considered by some to straddle the southern edge of the Cariboo country of British Columbia, although others consider Ashcroft-Cache Creek, Lillooet, Savona, Kamloops and even Lytton and Spences Bridge to be in the Cariboo."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Clinton, however, does sit immediately below the southern edge of the Cariboo Plateau."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Every May, Clinton is home to the Annual Ball held on the Victoria Day weekend, where many people dress as the first settlers did."
    },
    {
      "cityName": "Clinton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The Annual Ball kicks off the Village's Heritage week with the parade and the May rodeo and dance ending Heritage week."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cloverdale is known as a historic centre of Surrey, and is home to many heritage sites, including Christ Church, one of Surrey's oldest buildings (built in 1882)."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also the location of the City of Surrey's official museum."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town centre was initially founded as a small farm community in 1870 for its fertile land and temperate climate."
    },
    {
      "cityName": "Cloverdale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Cloverdale eventually amalgamated into Surrey as one of its six town centres."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named after a small and unsuccessful local coal mine that was founded in 1883."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village's most successful industry, however, was whaling."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was the last whaling station in British Columbia when it closed in 1967."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The station utilized the original buildings of the RCAF."
    },
    {
      "cityName": "Coal Harbour",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In the early 1980's the main place of work was the shake and shingle mill, the pier was a small wooden wharf you had to drive onto to get fuel, there was no gas station, and the marina sold milk, bread, eggs, butter, pop, and cigarettes."
    },
    {
      "cityName": "Coldstream",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Incorporated on December 21, 1906, Coldstream celebrated its centennial in 2006."
    },
    {
      "cityName": "Coldstream",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The municipality is directly southeast of Vernon and is considered part of Greater Vernon."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Colwood lies within the boundaries of the Greater Victoria area or Capital Regional District, in a region called the Western Communities, or the West Shore."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Colwood was incorporated in 1985 and has a population of approximately 19000 people."
    },
    {
      "cityName": "Colwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Set along more than 5 kilometres (3.1 mi) of oceanfront, this fast-growing seaside community is one of the 13 component municipalities of Greater Victoria."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "For over fifty years, the village remained isolated from the outside world other than by ship until roads and a railway were built into the area during the First World War."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Thousands of years ago, the warm dry summers, mild winters, fertile soil, and abundant sea life attracted First Nations, who called the area kw'umuxws (Kwakʼwala, the adopted language of the Kʼómoks, for plentiful)."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "When the area was opened for settlement in the mid-19th century, it quickly attracted farmers, a lumber industry and a fishing industry."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The nearby Comox Glacier is visible from many parts of the town and is the area's signature landmark."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The town of Comox is in the Comox Valley."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The town is also home to a Royal Canadian Air Force base CFB Comox, an airport for military and commercial airline use and the Sea Cadet training facility HMCS Quadra."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The mild climate has attracted many retirees to the area in the 21st century, which has resulted in a high rate of growth and a sharp increase in the median age of residents."
    },
    {
      "cityName": "Comox",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "It is close (17 km ) to Denman Island in the Strait of Georgia."
    },
    {
      "cityName": "Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The mayor is Richard Stewart."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after the nearby river, Courtenay River, which in turn had been named for Rear-Admiral Courtenay."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Courtenay is the seat of the Comox Valley Regional District; this district replaced the Comox-Strathcona Regional District."
    },
    {
      "cityName": "Courtenay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Courtenay and nearby Comox are served by the coast-spanning Island Highway, the Island Rail Corridor, and a local airport in Comox."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the largest urban centre in the region known as the East Kootenay."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Cranbrook is home to the Canadian Museum of Rail Travel which presents static exhibits of passenger rail cars built in the 1920s for the CPR and in the 1900s for the Spokane International Railway."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is the location of the headquarters of the Regional District of East Kootenay and also the location of the regional headquarters of various provincial ministries and agencies, notably the Rocky Mountain Forest District."
    },
    {
      "cityName": "Cranbrook",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As of 2021, Cranbrook's population is 20499 with a census agglomeration population of 27040."
    },
    {
      "cityName": "Cumberland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Comox Valley community is west of BC Highway 19 and is by road about 105 kilometres (65 mi) northwest of Nanaimo and 10 kilometres (6 mi) southwest of Courtenay."
    },
    {
      "cityName": "Cumberland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Cumberland is an incorporated village municipality east of Perseverance Creek, near the east coast of central Vancouver Island, British Columbia."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With its small harbour, Daajing Giids is often the starting-point for chartered tours into Gwaii Haanas National Park Reserve and Haida Heritage Site on southern Moresby Island."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In the wake of World War I, additional work force was needed to supply allied warplanes with lumber."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "On May 16, 2022, the village had its ancestral name of Daajing Giids restored with a unanimous council vote — the first in B C to do so, according to the provincial government."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Daajing Giids (DAW-jing GEEDS), known as Queen Charlotte City from 1891–2022, is a village municipality in the Haida Gwaii archipelago (formerly known as the Queen Charlotte Islands) in the province of British Columbia, Canada."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The village was founded in 1891 and in 1908 was the first townsite registered in the islands, although it wasn't incorporated as a municipality until 2005."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Today, few inhabitants are working in these resource-based jobs and a recent shift towards tourism-oriented employment has been observed, although the main economic driver is government jobs, including: hospital workers, school district, BC Ferries, local Forestry and Parks offices etc."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It is also the location of the Daajing Giids Visitor Centre, which is open year-round."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The name \"Queen Charlotte\" dates back to 1787 when Captain George Dixon was on a trading cruise along the coast."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "He named the island for his two hundred-ton vessel, the Queen Charlotte."
    },
    {
      "cityName": "Daajing Giids",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "It was previously represented as part of Electoral Area F of that regional district, which was coterminous with the Haida Gwaii archipelago (which now comprises Electoral Areas D and E)."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The creek was named after George Mercer Dawson by a member of his land survey team when they passed through the area in August 1879."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In the 1950s, the city was connected to the interior of British Columbia via a highway and a railway through the Rocky Mountains."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As the seat of the Peace River Regional District and a service centre for the rural areas south of the Peace River, the city has been called the \"Capital of the Peace\"."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Once a small farming community, Dawson Creek became a regional centre after the western terminus of the Northern Alberta Railways was extended there in 1932."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is also known as the \"Mile 0 City\", referring to its location at the southern end of the Alaska Highway."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It also has a heritage interpretation village, an art gallery, and a museum."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Dawson Creek is located in the dry and windy prairie land of the Peace River Country."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The municipality of 24.37 square kilometres (9.41 sq mi) had a population of 12978 in 2016."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "Dawson Creek derives its name from the creek of the same name that runs through the community."
    },
    {
      "cityName": "Dawson Creek",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "The community grew rapidly in 1942 as the US Army used the rail terminus as a transshipment point during construction of the Alaska Highway."
    },
    {
      "cityName": "Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Encompassing the nearby Annacis Island, Deas Island and Westham Island, Delta is mostly rural and officially composed of three distinct communities: North Delta, Ladner and Tsawwassen."
    },
    {
      "cityName": "Departure Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Departure Bay is a bay in central Nanaimo, British Columbia, on the east coast of Vancouver Island."
    },
    {
      "cityName": "Departure Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The surrounding neighbourhood is also referred to as \"Departure Bay\" —once a settlement of its own, it was amalgamated into the City of Nanaimo in the 1970s."
    },
    {
      "cityName": "Douglas",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community is named for Benjamin Douglas, an early pioneer and railroad surveyor."
    },
    {
      "cityName": "Douglas",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Douglas is the location of the Peace Arch Provincial Park portion of the International Peace Arch Park, which it shares with Peace Arch State Park in Blaine, Washington."
    },
    {
      "cityName": "Douglas",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Douglas, formerly known as \"Doug,\" is a locality in Surrey, British Columbia, Canada."
    },
    {
      "cityName": "Douglas",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Just southeast and outside of the boundary of White Rock, it is on the Canadian side of the Peace Arch Border Crossing between British Columbia and Whatcom County, Washington, in the United States."
    },
    {
      "cityName": "Duncan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was incorporated as a city in 1912."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Fording River Operations (FRO) mine is located on the Continental Divide of the Americas, known as the Great Divide."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Elkford hosts an annual festival called Wildcat Days during the last weekend of June."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "There are five open-pit coal mines within an hour's drive of Elkford: Fording River Operations (FRO), Greenhills Operations (GHO), Line Creek Operations (LCO), Elkview Operations (EVO) and Coal Mountain Operations (CMO)."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Elkford was created due to mining activity, in the early 1970s."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "There are two public schools Rocky Mountain Elementary School and Elkford Secondary School with a combined student population of 400 in January 2006."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "All mines belong to Elk Valley Resources."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It is 32 km (20 mi) north of the junction at Sparwood, on provincial Highway 43."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Outdoor recreational activities take place in Elkford throughout the year."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The town and area have many kilometres of horse riding, hiking, snowmobiling and cross country ski trails, and a ski hill, Wapiti, run by Elkford resident volunteers."
    },
    {
      "cityName": "Elkford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "The Elkford Aquatic Centre has a competition-size pool, hot tub and sauna."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The rural area surrounding Enderby is made up of the communities of Ashton Creek, Grandview Bench, Grindrod, Kingfisher, Mara, Splatsin Reserve, Springbend and Trinity Valley."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Highway 97A passes through Enderby and the Shuswap River marks the eastern and northeastern limits of the City."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Several smaller lakes, including Gardom Lake and Hidden Lake, are also located in the area."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The City of Enderby is in the North Okanagan region of the Canadian province of British Columbia, between Armstrong and Salmon Arm."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is approximately 80 km north of Kelowna and 130 km east of Kamloops."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "There are two major schools in Enderby: M V Beattie Elementary School and A L Fortune Secondary School."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "M V Beattie Elementary School was rebuilt in 2012."
    },
    {
      "cityName": "Enderby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The rural area is 2108.46 square kilometres."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is almost tangential to Esquimalt 1 Indian Reserve near Admirals Road."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is one of the 13 municipalities of Greater Victoria and part of the Capital Regional District."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Esquimalt had a population of 17533 in 2021."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It covers 7.08 km2 (2.73 sq mi)."
    },
    {
      "cityName": "Esquimalt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is home to the Pacific fleet of the Royal Canadian Navy."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Many historic sites can still be visited at Fairview, such as the Fairview Cemetery just off Fairview Road, the stampmill above Tinhorn Creek Road, and many mines along the side of a mountain."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The area was first discovered in 1887 by a prospector known as \"One-Armed Reed\"."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Many other interests were staked, and by 1893, Fairview (as the place became known) boasted of being \"The largest city North of San Francisco.\" Buildings, such as saloons, were erected to serve the needs of the rising population."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Visitors can still visit the Fairview Jail that was relocated beside the Oliver and District Museum."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In 1897, the Fairview Hotel (nicknamed the \"Big Teepee\") was built."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "In 1888, two others, Gwatkin and Shehan, were Crown-granted the Stemwinder Claim."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It burned down in 1902."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "By 1906, Fairview's gold began to play out, and most miners turned to other prospects."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "By 1919, Fairview had become a ghost town."
    },
    {
      "cityName": "Fairview",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Two children died from sickness and are buried at the cemetery."
    },
    {
      "cityName": "Fernie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "As the largest and longest-established community between Cranbrook and Lethbridge, Fernie serves as a minor regional centre, particularly for its fellow Elk Valley communities."
    },
    {
      "cityName": "Fernie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded in 1898 and incorporated as the City of Fernie in July 1904, the municipality has a population of over 5000 with an additional 2000 outside city limits in communities under the jurisdiction of the Regional District of East Kootenay."
    },
    {
      "cityName": "Fernie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Fernie lies on the Elk River, along Canada's southernmost east-west transportation corridor through the Rockies that crosses the range via the Crowsnest Pass, 40 kilometres (25 miles) to the east."
    },
    {
      "cityName": "Fernie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "A substantial seasonal population swells the city during the winter months."
    },
    {
      "cityName": "Fort Saint John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Established in 1794 as a trading post, Fort St. John is the oldest European-established settlement in present-day British Columbia."
    },
    {
      "cityName": "Fort Saint John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located at Mile 47 of the Alaska Highway, it is one of the largest cities between Dawson Creek, British Columbia and Delta Junction, Alaska."
    },
    {
      "cityName": "Fort Saint John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The most populous municipality in the Peace River Regional District, the city encompasses a total area of about 22 km2 (8.5 sq mi) with 21465 residents recorded in the 2021 Census."
    },
    {
      "cityName": "Fort Saint John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city is served by the Fort St. John Airport."
    },
    {
      "cityName": "Fort Saint John",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The municipal slogan is Fort St. John: The Energetic City."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The modern day town was established in 1914, during the construction of the Grand Trunk Pacific Railway, and was incorporated as a village in 1966."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The small community's population is primarily employed by either the forest industry."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It's located on the southwest side of Fraser Lake between Burns Lake and Vanderhoof alongside the Yellowhead Highway."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "(Fraser Lake Sawmills, or various logging contractors) The Endako Mines, a large molybdenum mine was a former large employer."
    },
    {
      "cityName": "Fraser Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The pioneer roots of the area's history date back to the fur trade, with the establishment in 1806 of a fur-trading post by Simon Fraser, at Fort Fraser near the east end of Fraser Lake."
    },
    {
      "cityName": "Fruitvale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is 16 km (9.9 mi) east of the city of Trail along Highway 3B."
    },
    {
      "cityName": "Gold River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In terms of the Island's human geography it is considered to be part of the \"North Island\", even though it technically is on the Island's west coast."
    },
    {
      "cityName": "Grand Forks",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is just north of the Canada–United States border, approximately 500 km (310 mi) from Vancouver and 200 km (120 mi) from Kelowna and 23 km (14 mi) west of the resort area of Christina Lake by road."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Among those interned at Greenwood were Isamu and Fumiko Kariya and their son Yasi, the grandparents and uncle of NHL star and Hockey Hall of Fame member Paul Kariya; his father Tetsuhiko (T.K.) was born in internment."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was incorporated in 1897 and was formerly one of the principal cities of the Boundary Country smelting and mining district."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was incorporated as a city originally and has retained that title despite the population decline following the closure of the area's industries."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The town is served by Greenwood Elementary School which covers grades from K-7."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Following grade 7 local students attend Boundary Central Secondary School in nearby Midway."
    },
    {
      "cityName": "Greenwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "In 1942, 1200 Japanese Canadians were sent to Greenwood as part of the Japanese Canadian internment."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known for its retail corridors along 104 Avenue and 152 Street."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is named after Guildford in Surrey, England."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "A notable landmark in Guildford is the 86-metre (282 ft) tall flagpole, which had been located at the Expo 86 fairgrounds and was then the record holder for world's tallest flagpole."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "At the intersection of these two streets sits the 200-store Guildford Town Centre shopping mall."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Although Guildford is geographically large, the Guildford neighbourhood is locally considered to centre around the Guildford Town Centre mall and its surrounding blocks."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It is also home to the Guildford Recreation Centre, which is owned and operated by the City of Surrey to serve the recreational needs of local residents."
    },
    {
      "cityName": "Guildford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "As of the 2016 census, the population of Guildford is 60745."
    },
    {
      "cityName": "Hanceville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hanceville is about 90 km west of Williams Lake in the Chilcotin District of the Central Interior of British Columbia, Canada."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name derived originally from Thomas Haney, the namesake of Port Haney, the neighbourhood adjoining today's downtown along the Fraser River immediately south, which is today includes a station on the West Coast Express and was formerly a steamboat port."
    },
    {
      "cityName": "Haney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Port Haney is a designated heritage district in Maple Ridge and includes buildings moved to the neighbourhood from other parts of the municipality that otherwise might have been demolished."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The place is on the southeast side of the Skeena River immediately north of the Bulkley River mouth, where the confluence forms a peninsula."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 62, the locality is by road about 75 kilometres (47 mi) northwest of Smithers and 144 kilometres (89 mi) northeast of Terrace."
    },
    {
      "cityName": "Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Hazelton is the original of the \"Three Hazeltons\", the other two being New Hazelton to the southeast and South Hazelton to the south."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Highlands (locally known as the Highlands and also known as Highlands) is a district municipality near Victoria, British Columbia, Canada."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Although the area is seen as a target for residential expansion of the Greater Victoria region, it is known mainly for its lakes, hills, and wilderness."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As one of the Western Communities, or West Shore municipalities, outside Victoria, Highlands has a population of 2225 as of 2016."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The region stretches along the Saanich Inlet shoreline from north of Goldstream to Mackenzie Bight."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Highlands is one of the more undeveloped areas of the Greater Victoria region; it is one of the newest Greater Victoria municipalities created within the Capital Regional District."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It is home to many parks, notably large portions of Gowlland Tod Provincial Park, Mount Work Regional Park, and Lone Tree Hill Regional Park."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The nearest commercial shopping areas are in the adjacent municipality of Langford."
    },
    {
      "cityName": "Highlands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Public education is provided by the Sooke School District's elementary, middle, and secondary schools in Langford."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located 154 kilometres (96 mi) east of Vancouver, Hope is at the southern terminus of the Coquihalla Highway and the western terminus of the Crowsnest Highway, locally known as the Hope-Princeton (Highways 5 and 3, respectively), where they merge with the Trans-Canada Highway (Highway 1)."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hope is at the eastern end of both the Fraser Valley and the Lower Mainland region, and is at the southern end of the Fraser Canyon."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "To the east, over the Cascade Mountains, is the Interior region, beginning with the Similkameen Country on the farther side of the Allison Pass in Manning Park."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As it lies at the eastern end of the Fraser Valley in the windward Cascade foothills, the town gets very high amounts of rain and cloud cover – particularly throughout the autumn and winter."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The District of Hope includes Hope (the previous Town of Hope) and surrounding areas, including the communities of Kawkawa Lake, Silver Creek, Flood, and Lake of the Woods."
    },
    {
      "cityName": "Hope",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Hope is at the eastern terminus of Highway 7."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known as the \"steelhead capital\" and it has the world's largest fly fishing rod."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Houston ( HEW-stən) is a forestry, mining and tourism town in the Bulkley Valley of the Northern Interior of British Columbia, Canada."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Houston's tourism industry is largely based on ecotourism and Steelhead Park, situated along Highway 16."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Its population as of 2021 was 3052, with approximately 2000 in the surrounding rural area."
    },
    {
      "cityName": "Houston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Houston is named in honour of the pioneer newspaperman John Houston."
    },
    {
      "cityName": "Invermere",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Invermere sits on the northwest shore of Windermere Lake and is a popular summer destination for visitors and second home owners from Edmonton and Calgary."
    },
    {
      "cityName": "Invermere",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the hub of the Columbia Valley between Golden to the north and Cranbrook to the south."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It retains much of the historic atmosphere from its earlier mining days."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A member municipality of the Central Kootenay Regional District, the name derives from the adjacent Kaslo River."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Before the arrival of Europeans, the area was home to the semi-nomadic Kutenai (Ktunaxa) and Lakes (Sinixt) tribes."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Settlers came and used it as a sawmill site in 1889, but Kaslo soon expanded as a result of the silver boom of the late 19th century."
    },
    {
      "cityName": "Kaslo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The economy of Kaslo is now based mainly on the forestry and tourism industries."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Nearby communities include the City of West Kelowna (also referred to as Westbank and Westside) to the west, across Okanagan Lake; Lake Country and Vernon to the north; Peachland to the southwest; and Summerland and Penticton to the south."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It serves as the head office of the Regional District of Central Okanagan."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The name Kelowna derives from the Okanagan word kiʔláwnaʔ, referring to a grizzly bear."
    },
    {
      "cityName": "Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Kelowna's population in 2025 is 165907 in the city proper and 254605 in the metro area."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Part of the Fraser Valley Regional District, Kent consists of several communities, the largest and most well-known being Agassiz—the only town in the municipality—Harrison Mills, Kilby, Mount Woodside, Kent Prairie, Sea Bird Island and Ruby Creek."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Kent's only incorporated municipal neighbours are Chilliwack, to the south across the Fraser, and Harrison Hot Springs which is an enclave on the north side of the municipality at the south end of Harrison Lake."
    },
    {
      "cityName": "Kent",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Included within the municipality's boundaries are several separately-governed Indian reserves, including the Seabird Island First Nation's reserves on and around the island of the same name."
    },
    {
      "cityName": "Keremeos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name originated from the Similkameen dialect of the Okanagan language word \"Keremeyeus\" meaning \"creek which cuts its way through the flats\" referring to Keremeos Creek which flows down from the Upper Benchlands to the Similkameen River that flows past the village."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Today, Kimberley is primarily a tourist destination and home to the Kimberley Alpine Resort, a ski area and Kimberley's Underground Mining Railway that features a 750-foot-long (230 m) underground mining interpretive centre complete with operational 3 ft (914 mm) narrow-gauge railway equipment."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Recreational pursuits include world-class skiing, snowboarding, snowmobiling, fishing, whitewater rafting, kayaking, biking, hiking and golfing on championship golf courses."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "From 1917 to 2001, it was the home to the world's largest lead-zinc mine, the Sullivan Mine."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city has the largest urban park in Canada."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "At 1977 acres (800 ha), the Kimberley Nature Park is the largest incorporated park in Canada."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "SunMine was the largest solar PV plant in Western Canada when built in 2015 on contaminated brownfield, formerly the site of the Sullivan Mine concentrator."
    },
    {
      "cityName": "Kimberley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Kimberley was named in 1896 after the Kimberley mine in South Africa."
    },
    {
      "cityName": "Kitsilano",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The area is mostly residential with two main commercial areas, West 4th Avenue and West Broadway, known for their retail stores, restaurants and organic food markets."
    },
    {
      "cityName": "Kitsilano",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Named after Squamish chief August Jack Khatsahlano, Kitsilano is located along the southern shore of English Bay between Fairview and West Point Grey, with Burrard Street as the neighbourhood's eastern boundary, Alma Street its western boundary, and 16th Avenue its southern boundary."
    },
    {
      "cityName": "Kitsilano",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Kitsilano ( kit-sə-LAN-oh) is a neighbourhood in the city of Vancouver, British Columbia, Canada."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Named for Thomas and William Ladner, who came to the area in 1868 and began large farming and fishing operations, it developed as a centre for these operations."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was created as a fishing village on the banks of the Fraser River."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "A series of ferries, culminating in the Ladner Ferry, allowed for access across the river to Richmond."
    },
    {
      "cityName": "Ladner",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The George Massey Tunnel provided a permanent connection in 1959."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The local economy is based on forestry, tourism, and agriculture."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A hillside location adjacent to a sheltered harbour forms the natural geography of the community."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As of 2021, the population was 8990."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The area of the town was 12.04 square kilometres."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Total private dwellings were 4079."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Population density was 746.5 people per square kilometre."
    },
    {
      "cityName": "Ladysmith",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Ladysmith is served by the coast-spanning Island Highway, the Island Rail Corridor, nearby Nanaimo Airport and BC Ferries."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "As its name suggests, there are a number of lakes in the vicinity of Lake Country, and outside the municipal boundaries in the hills to the east."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Okanagan Lake defines the western boundary of the municipality, while the entirety of Wood Lake and the southernmost portion of Kalamalka Lake are encompassed by it."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Lake Country was incorporated in 1995."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city of Kelowna lies to the south, while the city of Vernon lies to the north."
    },
    {
      "cityName": "Lake Country",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In the municipal government, one councillor is drawn from each of these wards, while the mayor and two additional councillors are elected by the people at large."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town is also known for its rich cultural history, with Japanese, Punjabi and Scandinavian loggers pioneering the area's vibrant forestry sector."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Lake Cowichan (Nitinaht: ʕaʔk̓ʷaq c̓uubaʕsaʔtx̣) (pop."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town of Lake Cowichan was incorporated in 1944 and serves as the focal point of the Cowichan Lake Area, home to the indigenous c̓uubaʕsaʔtx̣ people."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Cowichan River flows through the middle of the town."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The Cowichan River is designated as a Heritage River, and is also a popular location for tubing."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Lake Cowichan is at the western end of the Trans Canada Trail, which is the longest trail network in the world, at over 28 000 kilometres."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Youbou, with a population of about 1 400 people; Honeymoon Bay, with a population of about 450 people, and Mesachie Lake, with a population of about 200 people, are nearby communities."
    },
    {
      "cityName": "Lake Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Lake Cowichan is also the location of the first community twinning program between Canada and Japan, with the district of Ohtaki, part of Date City, Hokkaido, being its sister city."
    },
    {
      "cityName": "Langford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Langford was incorporated in 1992 and has a population of over 40000 people, the largest municipality in the Western Communities, and third-largest in the Capital Regional District after Saanich and Victoria."
    },
    {
      "cityName": "Langford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Langford is one of the 13 component municipalities of Greater Victoria and is within the Capital Regional District."
    },
    {
      "cityName": "Langford",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its motto is \"Golden in setting, determined in Spirit,\" containing a reference to the natural beauty of the City of Langford, specifically Goldstream Provincial Park, and a comment on the community's drive to enhance Langford's special character and future."
    },
    {
      "cityName": "Langley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of Langley, commonly referred to as Langley City, or just Langley, is a municipality in the Metro Vancouver Regional District in British Columbia, Canada."
    },
    {
      "cityName": "Langley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It lies directly east of Surrey, adjacent to the Cloverdale area, and is surrounded elsewhere by the Township of Langley, bordered by its neighbourhoods of Willowbrook to the north, Murrayville to the east, and Brookswood and Fern Ridge to the south."
    },
    {
      "cityName": "Lantzville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Lantzville was incorporated on June 25, 2003."
    },
    {
      "cityName": "Lantzville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It covers an area of 27.08 square kilometres (10.46 sq mi) and has a population of 3807."
    },
    {
      "cityName": "Lantzville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The district is almost completely residential, with some commercial buildings on Lantzville Road (formerly part of the Island Highway)."
    },
    {
      "cityName": "Lantzville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The area is served by the coast-spanning Island Highway and the Island Rail Corridor."
    },
    {
      "cityName": "Lillooet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town is on the west shore of the Fraser River immediately north of the Seton River mouth."
    },
    {
      "cityName": "Lillooet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 99, the locality is by road about 100 kilometres (62 mi) northeast of Pemberton, 64 kilometres (40 mi) northwest of Lytton, and 172 kilometres (107 mi) west of Kamloops."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lions Bay (Squamish: Ch'ích'iyúy Elx̱wíḵn, ) is a small residential community in British Columbia, Canada, located between Vancouver and Squamish on the steep eastern shore of Howe Sound."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In the 2021 census the community had a population of 1390, BC's 36th smallest municipality by population."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Originally a boat-access summer camping destination for Vancouverites, Lions Bay began to be permanently settled in the 1960s."
    },
    {
      "cityName": "Lions Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The community incorporated as a village municipality in January 1971."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of Lougheed is the second-largest shopping centre in Burnaby, British Columbia, Canada, with 57100 square metres (615000 sq ft) and over 160 shops and services."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It opened in 1969 and is located in the northeast corner of Burnaby near the Coquitlam border."
    },
    {
      "cityName": "Lougheed",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The centre is located adjacent to Lougheed Town Centre station, an interchange station that connects the Expo Line and Millennium Line of Metro Vancouver's SkyTrain rapid transit system."
    },
    {
      "cityName": "Lumby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The area is home to approximately 2000 people, and its economy revolves around the agriculture and manufacturing sectors."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town was founded during the Fraser Canyon Gold Rush of 1858–59, when it was known as \"The Forks.\""
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community includes the Village of Lytton and the surrounding community of the Lytton First Nation, whose name for the place is Camchin, also spelled Kumsheen (\"river meeting\")."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The next day (June 30), a wildfire swept through the valley, destroying the majority of the town."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In three consecutive days of June 2021, it broke the all-time record for Canada's highest temperature, ending at 49.6 °C (121.3 °F) on June 29."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "This is the highest temperature ever recorded north of 45°N and higher than the all-time records for Europe and South America."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Lytton area has been inhabited by the First Nations people for over 10000 years."
    },
    {
      "cityName": "Lytton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It was one of the earliest locations settled by immigrants in the Southern Interior of British Columbia."
    },
    {
      "cityName": "Mackenzie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The townsite, established by Alexandra Forest Industries (acquired by BC Forest Products in 1967) and Cattermole Timber (partnered with Jujo Paper in 1970 to create Finlay Forest Industries), was named for Sir Alexander MacKenzie (1764–1820)."
    },
    {
      "cityName": "Mackenzie",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is located at the south end of Williston Lake."
    },
    {
      "cityName": "Maple Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Maple Ridge's population in 2021 was 90990."
    },
    {
      "cityName": "Maple Ridge",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its downtown core area was once known as Haney."
    },
    {
      "cityName": "Marpole",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has undergone many changes in the 20th century, with the influx of traffic and development associated with the construction of the Oak Street Bridge (which leads to Highway 99 leading to the southern suburbs) and the Arthur Laing Bridge (which leads to Vancouver International Airport)."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the primary western terminus of Trans-Canada Highway 16 (the Yellowhead Highway) and is served by Masset Airport, with flights to Vancouver and Prince Rupert."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "During the maritime fur trade of the early 19th century, Masset was a key trading site."
    },
    {
      "cityName": "Masset",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was incorporated as a village municipality on May 11, 1961."
    },
    {
      "cityName": "McBride",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Incorporated in 1932, McBride is located in the Robson Valley surrounded by the Rocky Mountains and Cariboo Ranges."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Merritt has dozens of bronzed hand prints of country music stars who have been in the city for the former annual Merritt Mountain Music Festival displayed throughout town."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Once known as Forksdale, the community adopted its current name in 1906 in honour of mining engineer and railway promoter William Hamilton Merritt III."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The 24-square-kilometre (9.3 sq mi) city limits consist of the community, a number of civic parks, historical sites, an aquatic centre, a local arena, a public library (which is a branch of the Thompson-Nicola Regional District Library System) and a civic centre."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Merritt is also home to a local radio station, a weekly newspaper and the Nicola Valley Institute of Technology campus."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As the gateway between BC's Lower Mainland and Okanagan regions, Merritt is known as a key destination for festivals, events, and bountiful outdoor recreation."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Situated at the confluence of the Nicola and Coldwater rivers, it is the first major community encountered after travelling along Phase One of the Coquihalla Highway and acts as the gateway to all other major highways to the B C Interior."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Nearby, there are four provincial parks, numerous lakes, and several recreational trails."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "It is 270 km (170 mi) northeast of Vancouver."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The city developed in 1893 when part of the ranches owned by William Voght, Jesus Garcia, and John Charters were surveyed for a town site."
    },
    {
      "cityName": "Merritt",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Merritt's economy is dominated by the primary industries of forestry, tourism, and service."
    },
    {
      "cityName": "Metchosin",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Metchosin is part of the Western Communities and one of the 13 regional municipalities."
    },
    {
      "cityName": "Metchosin",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The origin of its name is a Straits Salish word, smets-shosin, meaning \"place of stinking fish\" or \"place smelling of fish oil.\""
    },
    {
      "cityName": "Midway",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Midway is in the West Kootenay region of south central British Columbia."
    },
    {
      "cityName": "Midway",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village lies 13 kilometres (8 mi) west of Greenwood and 51 kilometres (32 mi) east of Osoyoos along Highway 3."
    },
    {
      "cityName": "Mill Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known for its ferry to Brentwood Bay on the Saanich Peninsula and the historic Malahat Drive, which is also a source of criticism due to frequent closures from either automobile accidents or weather conditions."
    },
    {
      "cityName": "Mill Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was named for the sawmill built in the area in 1861 by Henry S. Shepherd soon purchased by William Sayward."
    },
    {
      "cityName": "Mill Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The MV Mill Bay that has served the ferry route since 1956 is named for the town but was taken out of service in 2011 and is now served by the MV Klitsa."
    },
    {
      "cityName": "Mill Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Mill Bay was founded in the 1860s with lumber and milling as its primary industries, done at the mill on the bay."
    },
    {
      "cityName": "Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was originally incorporated as a district municipality in 1892, growing to include additional villages and rural areas over the years, adding the original Town of Mission City, along an independent core of the region, in 1969."
    },
    {
      "cityName": "Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by the city of Abbotsford to the south and the city of Maple Ridge to the west."
    },
    {
      "cityName": "Montrose",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Montrose is in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Montrose",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village lies 7 kilometres (4 mi) east of the city of Trail along Highway 3B."
    },
    {
      "cityName": "Nakusp",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lying between the Selkirk and Monashee ranges, the village is known for its nearby hot springs and picturesque mountain lakeside setting."
    },
    {
      "cityName": "Nakusp",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Village of Nakusp () is located south of the mouth of Kuskanax Creek, on the Upper Arrow Lake in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "\"The Harbour City\" was previously known as the \"Hub City\", which was attributed to its original layout design with streets radiating from the shoreline like the spokes of a wagon wheel, and to its relatively central location on Vancouver Island."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nanaimo is the headquarters of the Regional District of Nanaimo."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Nanaimo is served by the Island Highway along the east coast, the BC Ferries system, and its regional airport."
    },
    {
      "cityName": "Nanaimo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is also on the dormant Island Rail Corridor."
    },
    {
      "cityName": "Nanoose Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The location off BC Highway 19 is by road about 26 kilometres (16 mi) north of Nanaimo, and 16 kilometres (10 mi) south of Parksville."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is known for its collection of restored heritage buildings that date back to a regional silver rush in 1886."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Along with Castlegar and Trail, located approximately 44 and 69 kilometers from each other respectively, Nelson is one of the three cities forming the commercial and population core of the West Kootenay region."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is the seat of the Regional District of Central Kootenay."
    },
    {
      "cityName": "Nelson",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is represented in the provincial legislature by the riding of Nelson-Creston, and in the Parliament of Canada by the riding of Kootenay, Columbia."
    },
    {
      "cityName": "New Denver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The village is 47 kilometres (29 mi) west of Kaslo on Highway 31A, and 47 kilometres (29 mi) southeast of Nakusp and 32 kilometres (20 mi) northeast of Slocan on Highway 6."
    },
    {
      "cityName": "New Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On BC Highway 16, the locality is by road about 68 kilometres (42 mi) northwest of Smithers and 137 kilometres (85 mi) northeast of Terrace."
    },
    {
      "cityName": "New Hazelton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "New Hazelton is one of the \"Three Hazeltons\", the other two being the original \"Old\" Hazelton to the northwest and South Hazelton to the west."
    },
    {
      "cityName": "New Westminster",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was the British Columbia mainland's largest city from its foundation until the first decade of the 20th century, when it was surpassed in population by Vancouver."
    },
    {
      "cityName": "New Westminster",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was founded in 1858 by Richard Clement Moody as the capital of the Colony of British Columbia, and served as such until the mainland and Vancouver Island colonies were merged to form the new Colony of British Columbia in 1866."
    },
    {
      "cityName": "Newton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the location for the previous Surrey City Hall and Courthouse, two local Surrey Public Library branches, and Kwantlen Polytechnic University's main campus."
    },
    {
      "cityName": "Newton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The studios of radio station Red FM are also located here."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Cowichan is noted for a landscape including forests, beaches, rivers, and lakes."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "North Cowichan (Canada 2021 Census population 31990) is a district municipality established in 1873 on Vancouver Island, in British Columbia, Canada."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The municipality is part of the Cowichan Valley Regional District."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The latter is an adjacent to City of Duncan and extending North to the Chemainus River and to Crofton."
    },
    {
      "cityName": "North Cowichan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The municipality encompasses the communities of Chemainus; Westholme; Crofton; Maple Bay; and \"North Cowichan\"."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Alongside North Delta is Burns Bog, the largest raised urban peat bog in North America."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "North Delta (founded as Annieville) is a largely middle-class commuter town situated in the Lower Mainland, of British Columbia, Canada."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community is the most populous of the three communities (North Delta, Ladner, and Tsawwassen) that make up the City of Delta."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "North Delta is home to numerous parks and recreational opportunities."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As well, Watershed Park provides walking and biking trails, home to many artesian aquifers."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Besides this, North Delta is home to a large amount of green-space."
    },
    {
      "cityName": "North Delta",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "As of the 2021 census, North Delta has a population of 60769."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Kamloops is a neighbourhood and former town located in the City of Kamloops, British Columbia, Canada."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In 2016, North Kamloops had a population of 10995, or 12.2% of Kamloops' total population of 90280, and had the highest population density of any neighbourhood in the city at 2750 people per km2."
    },
    {
      "cityName": "North Kamloops",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "North Kamloops is one of four neighbourhoods the City of Kamloops considers part of its Core, the others being Downtown, Sagebrush, and the West End - all on the south shore of the city."
    },
    {
      "cityName": "North Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of North Saanich is located on the Saanich Peninsula of British Columbia, approximately 25 kilometres (16 mi) north of Victoria on southern Vancouver Island."
    },
    {
      "cityName": "North Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is one of the 13 Greater Victoria municipalities."
    },
    {
      "cityName": "North Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The district is surrounded on three sides by 20 km (12 mi) of ocean shoreline, and consists of rural/residential areas and a large agricultural base."
    },
    {
      "cityName": "North Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is home to the Victoria International Airport and the Swartz Bay Ferry Terminal."
    },
    {
      "cityName": "Oak Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Oak Bay is a municipality incorporated in 1906 that is located on the southern tip of Vancouver Island, in the Canadian province of British Columbia."
    },
    {
      "cityName": "Oak Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is one of thirteen member municipalities of the Capital Regional District, and is bordered to the west by the city of Victoria and to the north by the district of Saanich."
    },
    {
      "cityName": "Oak Bay",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is a residential suburb of Victoria."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It derives its name from the Okanagan Mission founded by Father Pandosy, historically known as the Okanagan Mission, which was located here and was the first non-native settlement in the Okanagan Valley."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Gyro Beach and Rotary Beach, two of Kelowna's most popular beaches, are also located in the Lower Mission."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Upper Mission begins to extend into the foothills and higher terrain, and many parts of this area boast magnificent views of the city, mountains and Okanagan Lake."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Okanagan Mission, also known colloquially as the Mission is a neighbourhood of the City of Kelowna in the Okanagan region of the Southern Interior of British Columbia, Canada, located on the south side of the city at the foot of Okanagan Mountain."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "This has caused a fairly vibrant secondary commercial centre to emerge which is entirely separate from Downtown, with low to moderate density residential areas in between."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The northern border of Mission is K.L O Rd."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It is often differentiated as the Lower Mission and Upper Mission."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The Lower Mission contains most of the aforementioned commercial areas such as shopping malls, grocery stores, coffee shops, and boutiques."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "As a result, this part of town is widely regarded as luxurious and is indeed one of the most expensive neighbourhoods of Kelowna."
    },
    {
      "cityName": "Okanagan Mission",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "It is not unusual to see homes worth two million dollars or more, the most expensive of which can reach five million or even slightly above."
    },
    {
      "cityName": "Oliver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Some of the largest employers include Osoyoos Indian Band, School District #53, Interior Health and Okanagan Tree Fruit Cooperative."
    },
    {
      "cityName": "Oliver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Local industries include grape and fruit production, agritourism, wine production, ranching, golfing and recreation, retail and service trades."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town's population of 5556 (2021) swells in the summer months with seasonal visitors."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is 3.6 km (2.2 mi) north of the United States border in the Washington State and is adjacent to the Osoyoos Indian reserve."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The origin of the name Osoyoos was the word sw̓iw̓s (pronounced \"soo-yoos\") meaning \"narrowing of the waters\" in the local Okanagan language (Syilx'tsn)."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The \"O-\" prefix is not indigenous in origin and was attached by settler-promoters wanting to harmonize the name with other place names beginning with O in the Okanagan region (Oliver, Omak, Oroville, Okanogan)."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "There was a local newspaper, the Osoyoos Times, but merged with the Oliver Chronicle and became the Times Chronicle in May 2020."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Seniors (age 65 and over) comprise 43% of the town population."
    },
    {
      "cityName": "Osoyoos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Another 2139 people live around the town within Electoral Area A of the Regional District of Okanagan-Similkameen, and 1426 more in the Osoyoos 1 Indian Reserve."
    },
    {
      "cityName": "Parksville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Parksville is well known for its large, sandy beaches at Parksville Bay and Craig Bay."
    },
    {
      "cityName": "Parksville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Beachfest is the only World Championship Sand Sculpting official qualification event in Canada."
    },
    {
      "cityName": "Parksville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city's best-known annual event since 1982 is a sandcastle-building competition held from mid-July to mid-August, dubbed \"Parksville Beachfest\"."
    },
    {
      "cityName": "Parksville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As of the 2021 Census, Parksville's population was 13642, representing a 9.5% increase over the 2016 Census."
    },
    {
      "cityName": "Parksville",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Parksville is served by the coast-spanning Island Highway, the Island Rail Corridor, and a nearby airport."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Across the lake from Peachland is Rattlesnake Island, home of the legendary Ogopogo."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was founded in 1899 by John Moore Robinson, although the region had long been home to the Okanagan people."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Okanagan Valley is very narrow in the area and there are few terraces that mark former lake levels and the former lake bottom."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Peachland is approximately half-an-hour's drive south of the city of Kelowna and about a 20-minute drive north of Summerland."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As a result, the city is largely located on a steep sidehill."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Like many other areas in the Okanagan, Peachland is rapidly growing, with new residents coming from all across Canada."
    },
    {
      "cityName": "Peachland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Peachland is approximately 370 km from Vancouver, British Columbia, on the British Columbia south coast."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This Pemberton Valley community is on the southwest shore of the Lillooet River and northeast shore of Pemberton Creek."
    },
    {
      "cityName": "Pemberton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 99, the locality is by road about 153 kilometres (95 mi) north of Vancouver, 33 kilometres (21 mi) northeast of Whistler, and 100 kilometres (62 mi) southwest of Lillooet."
    },
    {
      "cityName": "Penticton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the 2021 Canadian Census, its population was 36885, while its census agglomeration population was 47380."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city received its name from the Pitt River and Pitt Lake."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In 1893, the first dyking district was organized; however, the Fraser River Flood of 1894 flooded many acres of land in Pitt Meadows."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Incorporated in 1914, it currently has a land area of 86.34 square kilometres (33.34 sq mi) with an estimate population of 19498 as of 2024."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pitt Meadows is one of the cities in British Columbia including Electoral Area A that comprises the Metro Vancouver Regional District."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Pitt Meadows Is 110 Years old."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Indigenous Peoples have resided in Pitt Meadows for approximately 1000 years."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "James McMillan explored the area in 1874."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The Municipality of Maple Ridge, which included the Pitt Meadows area, was incorporated in 1874."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "In 1892, residents of the Pitt Meadows area petitioned for their removal from the District of Maple Ridge."
    },
    {
      "cityName": "Pitt Meadows",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "In 1914, Pitt Meadows was a small, agricultural community of less than 250 individuals which supplied Vancouver and New Westminster with produce and dairy products."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The principal industry is forestry products."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city lies within the Alberni Valley at the head of the Alberni Inlet, Vancouver Island's longest inlet."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Port Alberni currently has a total population of 18259."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is the location of the head offices of the Alberni-Clayoquot Regional District."
    },
    {
      "cityName": "Port Alberni",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Port Alberni is served by the coast-spanning Island Highway system, and a local airport."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Past tourist attractions were Kiidk'yaas (The Golden Spruce) which was illegally felled by Grant Hadwin in 1997, and the White Raven, which has died."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The road to Tlell is called the straight stretch, as it is straight."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In this community 29.2% of the labour force works in the forest industry."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Today, Port Clements and the nearby mouth of the Yakoun River attract visitors intending to fish for steelheads, chinook and other salmon or to go kayaking."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "There are a few camp and picnic sites as well as hiking trails in and around Port Clements, which also has one gas station, one grocery store, a public library, a Canada Post office, a bar, a museum, a hostel, a grade school, a church and a wharf."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Known as Gamadiis in HlG̱aagilda X̱aayda kil, it is one of seven village sites that flourished in the rich waters at the mouth of Yakoun River, where an estuary shelters nine Pacific salmonid species and many kinds of birds."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Port Clements is an incorporated village situated at the east end of Masset Inlet in Haida Gwaii (formerly the Queen Charlotte Islands) off the coast of the Province of British Columbia in Canada."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The highway leading to Port Clements from Tlell and from Port Clements to Masset was paved in 1969 and soon after completion the village became incorporated in 1975."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The other main road that heads west to Juskatla Camp and back south to Queen Charlotte City is still gravel and mainly a logging road only open to public traffic after working hours."
    },
    {
      "cityName": "Port Clements",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Port Clements was and still is to a lesser extent the centre of the remaining logging on northern Graham Island."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is Canada's 93rd-largest municipality by population."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Port Coquitlam is bisected by Lougheed Highway and the Canadian Pacific Kansas City railway."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Located 27 km (17 mi) east of Vancouver, it is on the north bank of the confluence of the Fraser River and the Pitt River."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pitt Meadows lies across the Pitt River from it."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is one of 21 municipalities comprising Metro Vancouver."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Coquitlam borders it to the north and west."
    },
    {
      "cityName": "Port Coquitlam",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Port Coquitlam is often referred to as \"PoCo\"."
    },
    {
      "cityName": "Port Hardy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Hardy has a population of 3902 as of the 2021 census."
    },
    {
      "cityName": "Port Hardy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the gateway to Cape Scott Provincial Park, the North Coast Trail and the BC Marine Trail, located on the northernmost tip of Vancouver Island."
    },
    {
      "cityName": "Port Hardy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community has access to various outdoor activities, such as kayaking, caving, scuba diving, nature viewing, surfing, saltwater rapids, fishing and camping."
    },
    {
      "cityName": "Port Hardy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Port Hardy's twin city is Numata, Japan."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named for Richard Clement Moody, who was the founder and the first Lieutenant-Governor of the Colony of British Columbia."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The villages of Belcarra and Anmore, along with the rugged Coast Mountains, lie to the northwest and north, respectively."
    },
    {
      "cityName": "Port Moody",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It envelops the east end of Burrard Inlet and is the smallest of the Tri-Cities, bordered by Coquitlam on the east and south and by Burnaby on the west."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Village of Pouce Coupe (; French for \"cut thumb\") is a small town in northeastern British Columbia, Canada, and a member municipality of the Peace River Regional District."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was originally named 'Pouskapie's Prairie', after the name of the local native band chief."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The 2.06-square-kilometre (0.80 sq mi) municipality is home to 792 residents."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The community was settled by European immigrant Hector Tremblay in 1898."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Tremblay, a French speaker, rendered 'Pouskapie's Prairie' into the nearest French words of similar sound."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Pouce Coupe is approximately 10 km (6.2 mi) southeast of Dawson Creek along Highway 2."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "It is approximately 29 km (18 mi) northwest of the Alberta border along Highway 2."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Pouce Coupe's main industries today are petroleum, agriculture, and tourism."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "Popular recreational activities in the area include cross-country skiing, snowmobiling, fishing, hiking, and hunting."
    },
    {
      "cityName": "Pouce Coupe",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "The village claims to be \"the pioneer capital of the Peace Region\"."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With two intervening long, steep-sided fjords inhibiting the construction of a contiguous road connection with Vancouver to the south, geographical surroundings explain Powell River's remoteness as a community, despite relative proximity to Vancouver and other populous areas of the BC Coast."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Most of its population lives near the eastern shores of Malaspina Strait, which is part of the larger Georgia Strait between Vancouver Island and the Mainland."
    },
    {
      "cityName": "Powell River",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city is the location of the head office of the qathet Regional District."
    },
    {
      "cityName": "Prince George",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is often called the province's \"northern capital\" because it serves as a centre for higher education, health care, government services, arts and entertainment, sports, and support for major industries such as forest products and mining."
    },
    {
      "cityName": "Prince George",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city itself has a population of 76708; the metro census agglomeration has a population of 89490."
    },
    {
      "cityName": "Prince Rupert",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the land, air, and water transportation hub of British Columbia's North Coast, and has a population of 12300 people as of 2021."
    },
    {
      "cityName": "Princeton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The former mining and railway hub lies at the confluence of the Tulameen into the Similkameen River, just east of the Cascade Mountains."
    },
    {
      "cityName": "Princeton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "At the junction of BC Highway 3 and 5A, the locality is by road about 67 kilometres (42 mi) northwest of Keremeos, 133 kilometres (83 mi) east of Hope, and 90 kilometres (56 mi) south of Merritt."
    },
    {
      "cityName": "Qualicum Beach",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Qualicum Beach's natural environment and proximity to Victoria and Vancouver have made it a tourist destination, with cottages along the coast."
    },
    {
      "cityName": "Qualicum Beach",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is mostly of retirement age, with the oldest average population in Canada with a median age of 65.9 in 2016."
    },
    {
      "cityName": "Qualicum Beach",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Qualicum Beach is served by the coast-spanning Island Highway, the Island Rail Corridor, a local airport, and a nearby ferry to Lasqueti Island."
    },
    {
      "cityName": "Qualicum Beach",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In the 2021 census, it had a population of 9303."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "To the east of Quesnel is Wells, Barkerville, and Bowron Lake Provincial Park, a popular canoeing destination in the Cariboo Mountains."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located nearly evenly between the cities of Prince George and Williams Lake, it is on the main route to northern British Columbia and the Yukon."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Quesnel is located at the confluence of the Fraser River and Quesnel River."
    },
    {
      "cityName": "Quesnel",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Quesnel hosted the 2000 BC Winter Games, a biennial provincial amateur sports competition."
    },
    {
      "cityName": "Quilchena",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A heritage hotel is the main landmark, lately transformed into a small golf resort."
    },
    {
      "cityName": "Quilchena",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On the former main route between Merritt and Kamloops, it is now largely bypassed since the construction of the Coquihalla Highway."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The village is named for the hot springs in the nearby Kootenay National Park."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The hot springs were named after the radioactive element when an analysis of the water showed that it contained small traces of radon which is a decay product of radium."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Radium Hot Springs, informally and commonly called Radium is a village of 1339 residents in the East Kootenay region of British Columbia."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "From Banff, Alberta, it is accessible via Highway 93."
    },
    {
      "cityName": "Radium Hot Springs",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The radiation dosage from bathing in the pools is inconsequential: approximately 0.13 millirems (1.3 μSv) from the water for a half-hour bathing, around ten times average background levels."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "East of Revelstoke are the Selkirk Mountains and Glacier National Park, penetrated by Rogers Pass used by the Trans-Canada Highway and the Canadian Pacific Railway."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "South of the community down the Columbia River are the Arrow Lakes, Mount Begbie, and the Kootenays."
    },
    {
      "cityName": "Revelstoke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Revelstoke is located 641 kilometres (398 mi) east of Vancouver, and 415 kilometres (258 mi) west of Calgary, Alberta."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Across the two estuarine distributaries of the Fraser River, it neighbours Vancouver and Burnaby on the Burrard Peninsula to the north, New Westminster and Annacis Island to the east, Delta to the south, and the Strait of Georgia to the west."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It occupies almost the entirety of Lulu Island (excluding Queensborough), the adjacent Sea Island (where the Vancouver International Airport is located) and several other smaller islands and uninhabited islets to its north and south."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The indigenous Coast Salish peoples were the first people to inhabit the area of modern-day Richmond, with the Musqueam Band naming the site near Terra Nova \"spələkʷəqs\" or \"boiling point\"."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Today, East Asian Canadians make up a majority of Richmond's population, along with the Continental Asian Canadian population numbering almost three-fourths of the city's population."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is composed of fifteen areas: City Centre, Steveston, Broadmoor, Seafair, Thompson, West Cambie, Shellmont, East Cambie, Blundell, Hamilton, Bridgeport, Sea Island, East Richmond, Fraser Lands, and the South Arm Islands."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "As of 2023, the city has an estimated population of 229781 people."
    },
    {
      "cityName": "Richmond",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "During the 2010 Winter Olympics, the Richmond Olympic Oval was a venue for long track speed skating events."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The hills and valleys of British Columbia are popular for tourists who enjoy outdoor activities such as skiing, snowboarding and dogsledding locations."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It serves as a base for many tourists, both in summer and winter."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "This small community is based alongside the Fraser River."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In summer, rockclimbing and whitewater rafting are the primary activities in the Fraser Valley."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "During the 2006-2007 BC school year, a middle school located in Rosedale, Rosedale Middle School, was transformed into the Chilliwack School District's first traditional school."
    },
    {
      "cityName": "Rosedale",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Rosedale now boasts a combined elementary and middle school, which first opened its doors in 2012."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The facilities provide a winter base for the nearby multi-peak ski hills of the Red Mountain Resort."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In the non-winter months Rossland is frequented by mountain bikers, with golf and fishing options nearby as well."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "High in the Monashee Mountains, the city lies immediately east of the intersections of BC highways 3B and 22."
    },
    {
      "cityName": "Rossland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Rossland is in the West Kootenay region of south central British Columbia."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rutland is Kelowna's largest neighbourhood by far."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nearby neighbourhoods include Dilworth, Belgo, Black Mountain, Toovey Heights, Hall Road, Ellison, Central City, and Southeast Kelowna."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Rutland is a neighbourhood of the City of Kelowna in the Okanagan region of the Southern Interior of British Columbia, Canada, located on the northeast edge of the city's core."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is a member of the Osoyoos Division Yale Land District."
    },
    {
      "cityName": "Rutland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Rutland has a population of 34800 and the median age is 39.2."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Saanich is also home to the northeastern half of the University of Victoria, both campuses of Camosun College, and the Vancouver Island Technology Park."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With an area of 103.44 square kilometres (39.94 sq mi), Saanich is also the largest municipality in Greater Victoria."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Saanich contains a mix of urban, suburban, and rural areas stretching north to the Saanich Peninsula with a wide variety of features including ocean coastlines, freshwater lakes, small rivers, small mountains, rainforests, and agriculture ranging from hay to vineyards."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "There are 8.1749 square kilometres (3.1563 sq mi) of freshwater lakes and 29.61 kilometres (18.40 mi) of marine shoreline."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The district adopted its name after the Saanich First Nation, meaning \"emerging land\" or \"emerging people\"."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The municipality's topography is undulating with many glacially scoured rock outcroppings."
    },
    {
      "cityName": "Saanich",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Elevations range from sea level to 229 metres (751 ft)."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is also site of one of British Columbia's newest universities: Thompson Rivers University."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighbourhood is the largest in Kamloops and consists of an Upper and Lower Sahali, with an estimated total population of about 12000 in 2003."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Sahali (or Sa-hali) is a neighbourhood in South Kamloops, British Columbia, Canada, bordered by the Aberdeen and Downtown districts."
    },
    {
      "cityName": "Sahali",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is home to most of Kamloops' major grocery and big box stores."
    },
    {
      "cityName": "Salmo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is mostly on the north side of Erie Creek at the confluence with the Salmo River."
    },
    {
      "cityName": "Salmo",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The place lies largely east of the junction of BC Highway 3 (about 42 kilometres (26 mi) southeast of Castlegar), and BC Highway 6 (about 41 kilometres (25 mi) south of Nelson, and 25 kilometres (16 mi) north of the US border)."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Salmon Arm was incorporated as a municipal district on May 15, 2005."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city of Salmon Arm separated from the district in 1912, but was downgraded to a village in 1958."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Salmon Arm once again reunited with the District Municipality in 1970."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Salmon Arm once again became a city in 2005, and is now the location of the head offices of the Columbia-Shuswap Regional District."
    },
    {
      "cityName": "Salmon Arm",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Salmon Arm is home to the longest wooden freshwater wharf in North America."
    },
    {
      "cityName": "Sapperton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The neighbourhood of Sapperton consists of Sapperton and Hume Park, that has a forested area leading to the Brunette River."
    },
    {
      "cityName": "Sapperton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Sapperton is a neighbourhood within the City of New Westminster, British Columbia, Canada, located in the northeastern part of the city, which borders the areas of Coquitlam and Burnaby."
    },
    {
      "cityName": "Sapperton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighbourhood was the location of the barracks and other housing for the Royal Engineers, Columbia Detachment, otherwise known as “sappers”."
    },
    {
      "cityName": "Sapperton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Royal Columbian Hospital is located in Sapperton."
    },
    {
      "cityName": "Sapperton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Sapperton is also located close to two SkyTrain stations, Sapperton station and Braid station."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The village (like its West Kootenays namesake) was called after William Parsons Sayward, a successful Victoria lumber merchant who was born in Maine in 1818 and came to Victoria from California in 1858."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is about 1.6 kilometres (1 mi) inland from Kelsey Bay on a spur from Highway 19."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The 2016 population of the village was 311, down from 341 in 2006 and 379 in 2001."
    },
    {
      "cityName": "Sayward",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The village lies off the coast of Hardwicke Island."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after Thomas Shaughnessy, 1st Baron Shaughnessy, former president of the Canadian Pacific Railway."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also the site of many historical homes, especially in First Shaughnessy."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Of the neighbourhood's homes 50.9% were built before or during World War II, compared with 23.3% for the city at large."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Shaughnessy is an almost-entirely residential neighbourhood in Vancouver, British Columbia, Canada, spanning about 447 hectares in a relatively central locale."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is bordered by 16th Avenue to the north, 41st Avenue to the south, Oak Street to the east, and East Boulevard to the west."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The older section of the neighbourhood, called \"First Shaughnessy,\" is considered more prestigious and is bordered by 16th Avenue to the north, King Edward Avenue to the south, Oak Street to the east, and East Boulevard to the west."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "In 2016, the population was approximately 8430."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The neighbourhood's residents have an average annual household income of $111566 ($777184 in Shaughnessy Heights) and the average house price is $2.89 million, the highest in Vancouver."
    },
    {
      "cityName": "Shaughnessy",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "This is largely due to the 1981 First Shaughnessy Official Development Plan by-law, which promotes private property ownership and single-family dwelling, while limiting property subdivision and population density."
    },
    {
      "cityName": "Sicamous",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The place is adjacent to the narrows, which is the confluence of Mara Lake into Shuswap Lake."
    },
    {
      "cityName": "Sicamous",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "At the BC Highway 97A intersection on BC Highway 1, the locality is by road about 73 kilometres (45 mi) west of Revelstoke, 140 kilometres (87 mi) east of Kamloops, and 75 kilometres (47 mi) north of Vernon."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town west of Highway 17 (also called Patricia Bay Highway, locally abbreviated as the Pat Bay Highway) has a mixture of single-family residences and light industry."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "There is a large boating and marine industry in the area, ranging from marinas to boatbuilders and marine suppliers."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is one of the thirteen Greater Victoria municipalities."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It has a population of approximately 11583."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Sidney is located just east of Victoria International Airport, and about 6 km (4 mi) south of BC Ferries' Swartz Bay Terminal."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The town is also the only Canadian port-of-call in the Washington State Ferries system, with ferries running from Sidney to the San Juan Islands and Anacortes."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Sidney is located along Highway 17, which bisects the town from north to south."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The majority of the town is located east of Highway 17."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "Single-family units are also present east of the highway, but the eastern sector also has many condominium-type buildings, plus most of the service and retail outlets."
    },
    {
      "cityName": "Sidney",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "The island-studded Haro Strait, part of the Salish Sea, forms Sidney's eastern boundary."
    },
    {
      "cityName": "Silverton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The former steamboat landing is at the mouth of Silverton Creek on the eastern shore of Slocan Lake."
    },
    {
      "cityName": "Silverton",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The locality, on BC Highway 6 at the junction of BC Highway 31A, is about 95 kilometres (59 mi) by road north of Castlegar and 155 kilometres (96 mi) by road and ferry south of Revelstoke."
    },
    {
      "cityName": "Slocan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The former steamboat landing and ferry terminal is at the mouth of Springer Creek, at the foot of Slocan Lake."
    },
    {
      "cityName": "Slocan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Village of Slocan is in the West Kootenay region of southeastern British Columbia."
    },
    {
      "cityName": "Slocan",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The locality, on BC Highway 6 is about 69 kilometres (43 mi) by road north of Castlegar and 183 kilometres (114 mi) by road and ferry south of Revelstoke."
    },
    {
      "cityName": "Smithers",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With a population of 5378 in 2021, Smithers provides service coverage for most of the Bulkley Valley."
    },
    {
      "cityName": "Sooke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a regional centre for residents in neighbouring communities, including Otter Point, Shirley and Jordan River."
    },
    {
      "cityName": "Sooke",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Sooke, the westernmost of Greater Victoria's Western Communities, is to the north and west of the Sooke Basin."
    },
    {
      "cityName": "South Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Neighbourhoods of South Surrey include Crescent Beach, Crescent Heights, Elgin, Chantrell Creek, Morgan Creek, Grandview Heights, Hazelmere, Ocean Park, and Sunnyside."
    },
    {
      "cityName": "South Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Most of South Surrey lies in White Rock's population centre."
    },
    {
      "cityName": "Spallumcheen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The district, whose official name is the Township of Spallumcheen and which is the oldest rural municipality in the British Columbia Interior (incorporated in 1892), consists primarily of agricultural land surrounding the separately incorporated City of Armstrong."
    },
    {
      "cityName": "Spallumcheen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Both Spallumcheen and Armstrong are member municipalities of the Regional District of North Okanagan."
    },
    {
      "cityName": "Sparwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the late 1800s, there was a railroad stop known as Sparwood, which was so named because of the trees from this area being shipped to the coast for manufacturing spars for ocean vessels."
    },
    {
      "cityName": "Sparwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located approximately 30 kilometres from Fernie, the District Municipality of Sparwood has approximately 4200 residents."
    },
    {
      "cityName": "Sparwood",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Sparwood is quite large for its population, taking up an area of 191.01 square kilometres and incorporating the local coal mines."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Before the pulp mill, the town's largest employer had been International Forest Products (Interfor) with its sawmill and logging operation, but it closed a few years prior to the pulp mill's closing."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Forestry has traditionally been the main industry in the area, and the town's largest employer was the pulp mill operated by Western Forest Products."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town of Squamish had its beginning during the construction of the Pacific Great Eastern Railway in the 1910s."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It was the first southern terminus of that railway (now a part of CN)."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Squamish (; Squamish: Sḵwx̱wú7mesh, ; 2021 census population 23819) is a community and a district municipality in the Canadian province of British Columbia, located at the north end of Howe Sound on the Sea to Sky Highway."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Indigenous Squamish people have lived in the area for thousands of years."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The town remains important in the operations of the line and also the port."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "However, Western's operations in Squamish permanently ceased on January 26, 2006."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "In recent years, Squamish has become popular with Vancouver and Whistler residents escaping the increased cost of living in those places, both less than one hour away by highway."
    },
    {
      "cityName": "Squamish",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Tourism is increasingly important in the town's economy, with an emphasis on outdoor recreation."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On the southwest tip of Lulu Island, the village is a historic port and salmon canning centre at the mouth of the South Arm of the Fraser River."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The early 1900s style architecture attracts both the film and tourism industries."
    },
    {
      "cityName": "Steveston",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The settlement of Steveston, founded in the 1880s, is a neighbourhood of Richmond in Metro Vancouver."
    },
    {
      "cityName": "Stewart",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In 2021, it had a population of 517."
    },
    {
      "cityName": "Summerland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The largest centre in the region is Kelowna, approximately 50 km (31 mi) to the north (via Highway 97), and Vancouver is approximately 425 km (264 mi) away to the west."
    },
    {
      "cityName": "Summerland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The district is famous for \"Bottleneck drive\", a system of roads connecting various wineries."
    },
    {
      "cityName": "Summerland",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The district is between Peachland to the north and Penticton to the south."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mainly a suburban city, Surrey is the province's second-largest by population after Vancouver and the third-largest by area after Abbotsford and Prince George."
    },
    {
      "cityName": "Surrey",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Seven neighbourhoods in Surrey are designated town centres: Cloverdale, Fleetwood, Guildford, Newton, South Surrey, and City Centre encompassed by Whalley."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It encompasses City Centre, the city's central business district, and is home to the Surrey City Hall, the main branch of Surrey Libraries, Central City, SFU Surrey and the site of Kwantlen Polytechnic University's (KPU) Civic Plaza campus."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Whalley is the most densely populated and urban of the six town centres in Surrey, British Columbia, Canada."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Expo Line stations serving Whalley include Scott Road, Gateway, Surrey Central and King George."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Based on the city of Surrey statistics, Whalley is the second-most populous community in Surrey after Newton."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As of 2018, the population of Whalley is 75610, while the population of City Centre, the central subarea in the Whalley core, is 26945."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The total population of the area is 102555."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Whalley is represented in the Legislative Assembly of British Columbia by the Surrey North and Surrey City Centre electoral districts, and in the House of Commons of Canada by the Surrey Centre electoral district."
    },
    {
      "cityName": "Surrey City Centre",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Randeep Sarai is Whalley's member of Parliament, and Mandeep Dhaliwal and Amna Shah are its members of the Legislative Assembly."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Village of Tahsis economy used to be dependent on forestry, but after the closure of the local sawmill in 2001, the economy became heavily dependent on sport fishing for salmon and halibut, outdoor recreation and tourism."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The inlet is protected from Pacific storms by its geography, making the docking facilities a valuable asset."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In Tahsis' heyday the population was roughly 2500."
    },
    {
      "cityName": "Tahsis",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "With the closure and dismantling of the mill the population declined to 892, according to the 2001 census."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has become home to the annual World's Invitational Class 'A' Gold Panning Championships and was featured on the CBC Television program Village on a Diet."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Taylor, a member municipality of the Peace River Regional District, covers an area of about 17 km2 with 1317 residents as of 2021."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town sits on a terrace 60 m above the north bank of the Peace River."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The first settler on the flat was a trapper named Herbert Taylor in 1911."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The town incorporated in 1958 with industrial business beginning to locate there."
    },
    {
      "cityName": "Taylor",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Since then, Taylor has remained a small town, even though it has developed a large industrial base."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This regional hub lies east of the confluence of the Kitsumkalum River into the Skeena River."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On BC Highway 16, junctions branch northward for the Nisga'a Highway (BC Highway 113) to the west and southward for the Stewart–Cassiar Highway (BC Highway 37) to the east."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The locality is by road about 204 km (127 mi) southwest of Smithers and 144 km (89 mi) east of Prince Rupert."
    },
    {
      "cityName": "Terrace",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Transportation links are the Northwest Regional Airport Terrace-Kitimat, a passenger train, and bus services."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Close to Tofino is Long Beach, a scenic and popular year-round destination, in Pacific Rim National Park Reserve."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With its natural hot springs, Maquinna Marine Provincial Park is a popular day-trip destination for tourists."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The District of Tofino is located at the western terminus of Highway 4 on the tip of the Esowista Peninsula at the southern edge of Clayoquot Sound."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "A popular year-round tourism destination, Tofino's summer population swells to many times its winter size."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It attracts surfers, hikers, nature lovers, bird watchers, campers, whale watchers and fishermen."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Despite its small population, the town attracts a number of chefs and culinary professionals, which has resulted in a burgeoning choice of restaurants and specialty shops."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "In the winter, it is not as bustling, although many people visit Tofino and the West Coast to watch storms on the water."
    },
    {
      "cityName": "Tofino",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Reachable by boat or floatplane, the park is located about 45 km (28 mi) north of Tofino."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after the Dewdney Trail, which passed through the area."
    },
    {
      "cityName": "Trail",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town was first called Trail Creek or Trail Creek Landing, and the name was shortened to Trail in 1897."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tsawwassen (English: tə-WAH-sən) is a suburban, mostly residential community on a peninsula in the southwestern corner of the City of Delta in British Columbia, Canada."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It provides the only road access to the American territory on the southern tip of the peninsula of the same name, the community of Point Roberts, Washington, via 56th Street."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is also the location of Tsawwassen Ferry Terminal, part of the BC Ferries, built in 1959 to provide foot-passenger and motor vehicle access from the Lower Mainland to the southern part of Vancouver Island and the southern Gulf Islands."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Because Tsawwassen touches a shallow bank (Roberts Bank), the ferry terminal is built at the southwestern end of a 3 km (1.9 mi) causeway (part of Highway 17) that juts into the Strait of Georgia."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Boundary Bay Airport, a major training hub for local and international pilots which also provides local airplane and helicopter service, is ten minutes away."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Roberts Bank Superport is also nearby."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "While also part of TFN lands, the 92-lot residential subdivision of Stahaken was leased for use by the (then) Tsawwassen Indian Reserve to Staheken Developments Ltd."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "in 1989 for a 99-year term."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "It was then developed in a partnership between Stahaken Development Ltd."
    },
    {
      "cityName": "Tsawwassen",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "and the Municipality of Delta."
    },
    {
      "cityName": "Ucluelet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ucluelet comes from Yuułuʔił which means \"people of the safe harbour\" in the indigenous Nuu-chah-nulth language and is the homeland of the Yuułuʔiłʔatḥ."
    },
    {
      "cityName": "Ucluelet",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As of 2021, its population was 2066, a 20.3% increase from 1717 in 2016."
    },
    {
      "cityName": "University Endowment Lands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies west of Vancouver and east of the University of British Columbia's Point Grey campus lands."
    },
    {
      "cityName": "University Endowment Lands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Instead, it is directly administered by the provincial government in the name of the Minister of Municipal Affairs under the terms of the University Endowment Land Act."
    },
    {
      "cityName": "University Endowment Lands",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "For the purposes of representation on the Metro Vancouver Board of Directors, the UEL is part of Electoral Area A. In a 1995 referendum, UEL residents voted against establishing a municipal governing body."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Valemount is one of 14 designated resort municipalities in British Columbia."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name Valemount was coined for the Canadian National Railway station there in 1927 from the words vale and mount."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is between the Rocky, Monashee, and Cariboo Mountains."
    },
    {
      "cityName": "Valemount",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Outdoor recreation is popular in summer and winter—hiking, skiing, snowmobiling, cross-country skiing, mountain biking and horseback riding are common activities."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "While forestry remains its largest industry, Vancouver is well known as an urban centre surrounded by nature, making tourism its second-largest industry."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Major film production studios in Vancouver and nearby Burnaby have turned Greater Vancouver and nearby areas into one of the largest film production centres in North America, earning it the nickname \"Hollywood North\"."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city became the permanent home of TED conferences in 2014."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As of 2016, the Port of Vancouver is the fourth-largest port by tonnage in the Americas, the busiest and largest port in Canada, and the most diversified port in North America."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The Gastown steam clock marks the original site."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The city was renamed \"Vancouver\" in 1886 through a deal with the Canadian Pacific Railway."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The Canadian Pacific transcontinental railway was extended to the city by 1887."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Greater Vancouver, along with the Fraser Valley, comprises the Lower Mainland with a regional population of over 3 million."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "As the most populous city in the province, the 2021 Canadian census recorded 662248 people in the city, up from 631486 in 2016."
    },
    {
      "cityName": "Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Vancouver has the highest population density in Canada, with over 5700 inhabitants per square kilometre (15000/sq mi), and the fourth highest in North America (after New York City, San Francisco, and Mexico City)."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The College of New Caledonia has a regional campus there."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Tourism is also growing, and mining operations are being developed in the area."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It has many elementary schools, and one major secondary school, Nechako Valley Secondary School (NVSS), comprising School District 91 Nechako Lakes."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Via Rail's Jasper–Prince Rupert train serves the Vanderhoof railway station."
    },
    {
      "cityName": "Vanderhoof",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Its main industries are forestry, agriculture, and related businesses."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Named after Forbes George Vernon, a former MLA of British Columbia who helped establish the Coldstream Ranch in nearby Coldstream, Vernon was incorporated in 1892."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is 440 km (270 mi) northeast of Vancouver."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Vernon has a population of 44519 (2021), while its metropolitan region, Greater Vernon, has a population of 67086 as of the 2021 Canadian census."
    },
    {
      "cityName": "Vernon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "A resident of Vernon is called a \"Vernonite.\""
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city has retained a large number of its historic buildings, in particular its two most famous landmarks, the Parliament Buildings (finished in 1897 and home of the Legislative Assembly of British Columbia) and the Empress Hotel (opened in 1908)."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Named for Queen Victoria, the city is one of the oldest in the Pacific Northwest, with British settlement beginning in 1843."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Known as \"the Garden City\", Victoria is an attractive city and a popular tourism destination and has a regional technology sector that has risen to be its largest revenue-generating private industry."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city's Chinatown is the second oldest in North America, after San Francisco."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The city has a population of 91867, and the Greater Victoria area has a population of 397237."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The city of Victoria is the seventh most densely populated city in Canada with 4406 inhabitants per square kilometre (11410/sq mi)."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The city is about 100 km (62 mi) from Seattle, Washington by airplane, seaplane, ferry, or the Victoria Clipper passenger-only ferry, and 40 km (25 mi) from Port Angeles, Washington, by the ferry Coho across the Strait of Juan de Fuca."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The region's Coast Salish First Nations peoples established communities in the area long before European settlement, which had large populations at the time of European exploration."
    },
    {
      "cityName": "Victoria",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "In 2019, Victoria was in the top 20 world cities for quality of life, according to Numbeo."
    },
    {
      "cityName": "View Royal",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With over 700 hectares (1700 acres) of parkland, View Royal includes Thetis, McKenzie, Pike, and Prior Lakes and portions of Esquimalt Harbour and Portage Inlet."
    },
    {
      "cityName": "View Royal",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "View Royal has a population of 11575 residents."
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "East of Walnut Grove lies the historic community of Fort Langley and other cities such as Abbotsford"
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "23295) located within the Township of Langley, British Columbia."
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "\"Walnut Grove\" is located at cross roads north of Highway 1."
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "To the north lie the cities of Maple Ridge and Pitt Meadows, connected by the Golden Ears Bridge."
    },
    {
      "cityName": "Walnut Grove",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "To the south is Langley City and Surrey is on the west."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It gains much of its revenue and jobs from tourists who pass through on their way to the Bowron Lake Provincial Park and to the historic museum town of Barkerville."
    },
    {
      "cityName": "Wells",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Wells is a small mining and tourist town in the Cariboo District of central British Columbia, located on BC Highway 26, 74 km (46 mi) from Quesnel and 8 km (5 mi) before the highway's terminus at Barkerville."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "West Kelowna, formerly known as Westside and colloquially known as Westbank, is a city in British Columbia's Okanagan Valley on the west shore of Okanagan Lake."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city encompasses several neighbourhoods, including Casa Loma, Gellatly, Glenrosa, Lakeview Heights, Shannon Lake, Smith Creek, Rose Valley, Westbank, and West Kelowna Estates."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As of 2021, West Kelowna had an estimated population of 36078."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "West Kelowna incorporated in 2007 as Westside District Municipality, reflecting the name of the former Central Okanagan Regional District rural electoral area."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "On January 30, 2009, the municipality was officially renamed West Kelowna."
    },
    {
      "cityName": "West Kelowna",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The municipality was re-classified as the City of West Kelowna on June 26, 2015."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With the District of North Vancouver and the City of North Vancouver, West Vancouver is part of a regional grouping known as the North Shore municipalities."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A member municipality of the Metro Vancouver Regional District, West Vancouver is situated on the north shore of Burrard Inlet to the northwest of the city of Vancouver."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is among the wealthiest municipalities in Canada by average household net worth."
    },
    {
      "cityName": "West Vancouver",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "West Vancouver is home to the Horseshoe Bay ferry terminal, one of the main transportation hubs connecting the British Columbia mainland and Vancouver Island, and to much of Cypress Provincial Park."
    },
    {
      "cityName": "Westsyde",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Westsyde is a residential neighbourhood in the city of Kamloops, British Columbia, Canada."
    },
    {
      "cityName": "Westsyde",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The 2001 Canadian Census put the population of Westsyde at 7797."
    },
    {
      "cityName": "Westwood Plateau",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named for Westwood Motorsport Park which existed on the plateau before the community was built, and was closed in 1990 to make way for real estate development."
    },
    {
      "cityName": "Westwood Plateau",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Westwood Plateau is a neighbourhood in the northern region of Coquitlam, British Columbia."
    },
    {
      "cityName": "Westwood Plateau",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Hampton Park Elementary School was built on top of the actual raceway."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It encompasses City Centre, the city's central business district, and is home to the Surrey City Hall, the main branch of Surrey Libraries, Central City, SFU Surrey and the site of Kwantlen Polytechnic University's (KPU) Civic Plaza campus."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Whalley is the most densely populated and urban of the six town centres in Surrey, British Columbia, Canada."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Expo Line stations serving Whalley include Scott Road, Gateway, Surrey Central and King George."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Based on the city of Surrey statistics, Whalley is the second-most populous community in Surrey after Newton."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "As of 2018, the population of Whalley is 75610, while the population of City Centre, the central subarea in the Whalley core, is 26945."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The total population of the area is 102555."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Whalley is represented in the Legislative Assembly of British Columbia by the Surrey North and Surrey City Centre electoral districts, and in the House of Commons of Canada by the Surrey Centre electoral district."
    },
    {
      "cityName": "Whalley",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Randeep Sarai is Whalley's member of Parliament, and Mandeep Dhaliwal and Amna Shah are its members of the Legislative Assembly."
    },
    {
      "cityName": "Whistler",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Over two million people visit Whistler annually, primarily for alpine skiing and snowboarding and, in the summer, mountain biking at Whistler Blackcomb."
    },
    {
      "cityName": "Whistler",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has a permanent population of approximately 13982 (2021), and 3241 seasonal residents (estimated)."
    },
    {
      "cityName": "Whistler",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its pedestrian village has won numerous design awards, and Whistler has been voted among the top destinations in North America by major ski magazines since the mid-1990s."
    },
    {
      "cityName": "Whistler",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "During the 2010 Winter Olympics, Whistler hosted most of the alpine, Nordic, luge, skeleton, and bobsled events."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "White Rock is named for a large white boulder on its beach near the promenade, a glacial erratic that migrated south during the last glaciation."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by Semiahmoo Bay to the south and is surrounded on three sides by Surrey."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "To the southeast across a footbridge lies the Semiahmoo First Nation, which is within the borders of Surrey."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Semiahmoo Bay and the Southern Gulf Islands in the Strait of Georgia are also to the south."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The 486-ton granite boulder was kept white by shellfish-eating seabirds whose guano covered the rock so much that 19th-century sailors used it as a beacon."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It is now kept white through monthly applications of white paint by the city parks department and has been a graffiti target."
    },
    {
      "cityName": "White Rock",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The White Rock Pier is located nearby."
    },
    {
      "cityName": "Williams Lake",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is famous for the Williams Lake Stampede, which is the second largest professional rodeo in Canada, after only the Calgary Stampede."
    },
    {
      "cityName": "Willoughby",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is also home to the Township of Langley's municipal hall."
    },
    {
      "cityName": "Yennadon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Maple Ridge's population in 2021 was 90990."
    },
    {
      "cityName": "Yennadon",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its downtown core area was once known as Haney."
    },
    {
      "cityName": "Zeballos",
      "state": "BC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Zeballos is now known for its ecotourism and sport fishing."
    }
  ]
}