{
  "facts": [
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Adams Morgan is noted as a historic hub for counterculture and as an arts district."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also known for its popular entertainment district and culinary scene, centered on both 18th Street and Columbia Road."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Notable local businesses include the famed live music club Madam's Organ Blues Bar and the Michelin-starred restaurant Tail Up Goat, among others."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Adams Morgan (sometimes abbreviated as AdMo) is a neighborhood in Washington, D.C., located in the city's Northwest quadrant."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In the 21st century, Adams Morgan has been a focus of urban redevelopment and become one of Washington's most gentrifying neighborhoods."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Adams Morgan has also become one of the hubs of LGBTQ culture in Washington, D.C."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Frederick Douglass National Historic Site preserves the famous 19th century civil rights leader's home."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Anacostia is a historic neighborhood in Southeast Washington, D C in the United States."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bounded by the Southeast Freeway to the north and northwest, the Suitland Parkway to the south and southwest as well as Fort Stanton and Ricketts Park to the east, Anacostia includes all of the Anacostia Historic District, which was listed on the National Register of Historic Places in 1978."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Anacostia Community Museum is part of the Smithsonian."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Anacostia is located directly east of and along the Anacostia River, after which the neighborhood is named."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Often the name \"Anacostia\" is used to refer to the entire portion of the city that is southeast of the Anacostia River."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Its downtown is located at the intersection of Marion Barry Avenue (formerly Good Hope Road) SE and Martin Luther King Jr Avenue SE."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The community's population is more than 90 percent African American."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The Anacostia Business Improvement District is responsible for the development of the area."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bellevue is a residential neighborhood in far Southeast and Southwest in Washington, D.C., United States."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by South Capitol Street, one block of Atlantic Street SE, and 1st Streets SE and SW to the north and east; Joliet Street SW and Oxon Run Parkway to the south; Martin Luther King Junior Avenue SE, Shepherd Parkway, 2nd Street SW, and Xenia Street SW to the west."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bellevue was created from some of the earliest land patents in Maryland, and draws its name from a 1795 mansion built in the area."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Subdivisions began in the 1870s, but extensive residential building did not occur until the early 1940s."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Bellevue is adjacent to a number of federal and city agency buildings."
    },
    {
      "cityName": "Benning",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Benning is a residential neighborhood located in Ward 7 of Northeast Washington, D C It is bounded by East Capitol Street to the south, Minnesota Avenue to the west, and Benning Road (for which the neighborhood is named) on the north and east."
    },
    {
      "cityName": "Benning",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is served by the Benning Road station on the Blue and Silver Lines of the Washington Metro."
    },
    {
      "cityName": "Brightwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brightwood is a neighborhood in the northwestern quadrant of Washington, D C Brightwood is part of Ward 4."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is best known for its numerous Catholic institutions, including schools, religious communities, shrines, institutes, and other organizations built and based around the Catholic University of America."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Historically centered along 12th Street NE, Brookland is bounded by Taylor Street NE and Michigan Avenue NE to the northwest; by Rhode Island Avenue NE to the southeast; by South Dakota Avenue NE to the northeast; and by subway (Washington Metro's Red Line) and train (CSX) tracks to the west."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The western boundary of the railroad tracks originated with the completion of the former Metropolitan Branch of the Baltimore and Ohio Railroad in 1873, which now incorporates the Washington Metro's Red Line."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Brookland’s boundaries stretches to the National Shrine and includes Catholic University."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Brookland, also known as Little Rome or Little Vatican, is a neighborhood located in the Northeast (NE) quadrant of Washington, D C Bounded by Fort Totten Metro Train tracks NE, and Brookland CUA Metro train tracks, Taylor Street NE, Rhode Island Avenue NE, South Dakota Avenue NE."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "A small portion of the Brookland neighborhood located on Rhode Island Avenue NE is served by the Red Line Rhode Island Avenue Metro Station."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Dominated by the United States Capitol, which sits on the highest point of Capitol Hill, it is one of the oldest historic districts in Washington."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Capitol Hill is a neighborhood in Washington, D.C., located in both the Northeast and Southeast quadrants."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is bounded by 15th Street SE & NE, F Street NE, Southeast Boulevard SE, and South Capitol Street SE."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood has a high concentration of rowhouses, largely dating from the 19th century."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The name Capitol Hill is frequently used as a metonym for the U S Congress."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Capitol Hill is famed as a center of the United States government, home to numerous important institutions including the U S Congress, the Supreme Court, the Library of Congress, and more."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Apart from government, the neighborhood is largely residential, but maintains notable commercial hubs along Pennsylvania Avenue, such as Eastern Market and Barracks Row."
    },
    {
      "cityName": "Chevy Chase",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chevy Chase () is a neighborhood in northwest Washington, D C It borders Chevy Chase, Maryland."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The neighborhood is known for its many late 19th century homes and the historic Art Deco Uptown Theater."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is named after Grover Cleveland, who owned property in the area."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Cleveland Park is a residential neighborhood in the Northwest quadrant of Washington, D C It is located at and bounded approximately by Rock Creek Park to the east, Wisconsin and Idaho Avenues to the west, Klingle and Woodley Roads to the south, and Rodman and Tilden Streets to the north."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Its main commercial corridor lies along Connecticut Avenue NW, where the eponymous Cleveland Park station of the Washington Metro's Red Line can be found; another commercial corridor lies along Wisconsin Avenue."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is also home to the William L. Slayton House and the Park and Shop, built in 1930 and one of the earliest strip malls."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Columbia Heights is home to numerous historical landmarks, including Meridian Hill (Malcolm X) Park, National Baptist Memorial Church, All Souls Church, along with a number of embassy buildings."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Developed as a suburb after the U S Civil War, the area's growth accelerated in the early 1900s."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Columbia Heights is a neighborhood in Washington, D.C., located in the city’s Northwest quadrant."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The extension of the DC streetcar system in 1914 made the neighborhood a popular place to live among federal workers."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In the 1940s, the designation of Cardozo High School as a \"colored\" school resulted in a demographic shift and the neighborhood became predominantly African-American."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The 1968 Washington, D.C., riots devastated the area and turmoil in the 1970-80s followed."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "In light of this, Washington Metro edited the course of the Green Line in order to service riot-torn neighborhoods."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "In the late 1990s, the opening of the Columbia Heights station led to the redevelopment of the neighborhood."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "Today the neighborhood has diverse demographics."
    },
    {
      "cityName": "Congress Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Congress Heights is a residential neighborhood in Southeast Washington, D.C., in the United States."
    },
    {
      "cityName": "Congress Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Commercial development is heavy along Martin Luther King, Junior Avenue and Malcolm X Avenue (formerly Portland Street, SE)."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "One of Northeast's oldest neighborhoods, Deanwood's relatively low-density, small wood-frame and brick homes, and dense tree cover give it a small-town character that is unique in the District of Columbia."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood was once home to Nannie Helen Burroughs, an early civil rights leader and the founder of the National Training School for Women and Girls, an independent boarding school for African-American girls founded in 1909 and located on 50th Street, NE."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Deanwood is a neighborhood in Northeast Washington, D.C., bounded by Eastern Avenue to the northeast, Kenilworth Avenue to the northwest, Division Avenue to the southeast, and Nannie Helen Burroughs Avenue to the south."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Much of its housing stock dates from the early 20th century."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Several well-known African-American architects, including William Sidney Pittman and Howard D. Woodson, and many skilled local craftsmen designed and built many of its homes."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Marvin Gaye (1939–1984) was also born and raised in this neighborhood."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "From 1921 to 1940, Deanwood was also home to Suburban Gardens (50th and Hayes NE), a black-owned amusement park that served thousands of African-American residents during a time of racial segregation."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "It is served by the Deanwood Metro station on the Orange Line."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The neighborhood is featured prominently in crime author Jim Beane's short story \"Jeanette.\""
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Dupont Circle is a historic roundabout park and neighborhood of Washington, D.C., located in Northwest D C The Dupont Circle neighborhood is bounded approximately by 16th Street NW to the east, 22nd Street NW to the west, M Street NW to the south, and Florida Avenue NW to the north."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Much of the neighborhood is listed on the National Register of Historic Places."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "However, the local government Advisory Neighborhood Commission (ANC 2B) and the Dupont Circle Historic District have slightly different boundaries."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood is known for its high concentration of embassies, many located on Embassy Row, and think tanks, many located on Think Tank Row."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The circle is named for Rear Admiral Samuel Francis Du Pont."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The traffic circle is located at the intersection of Massachusetts Avenue NW, Connecticut Avenue NW, New Hampshire Avenue NW, P Street NW, and 19th Street NW."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The traffic circle contains the Dupont Circle Fountain in its center."
    },
    {
      "cityName": "Foggy Bottom",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Within greater Foggy Bottom, there is a four block Historic District with modest row houses and alleys dating from as early as the 1870s and which housed working class Irish, German and African Americans during the historic period of 1860-1915."
    },
    {
      "cityName": "Foggy Bottom",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also home to federal agencies and international institutions, including the Federal Reserve, the World Bank, and the International Monetary Fund; the core of the neighborhood is occupied by George Washington University."
    },
    {
      "cityName": "Foggy Bottom",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Foggy Bottom is a neighborhood of Washington, D.C., United States, located in the city's northwest quadrant."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name Fort Lincoln was originally used for a Civil War Fort in adjacent Prince George's County, Maryland, across the D C line from the Washington neighborhood bearing its name."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Fort Lincoln is a neighborhood located in northeastern Washington, D C It is bounded by Bladensburg Road to the northwest, Eastern Avenue to the northeast, New York Avenue NE to the south, and South Dakota Avenue NE to the southwest."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town of Colmar Manor, Maryland, is across Eastern Avenue from the Fort Lincoln neighborhood, as is the Fort Lincoln Cemetery."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Georgetown is a historic neighborhood and commercial district in Northwest Washington, D.C., situated along the Potomac River."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded in 1751 as part of the colonial-era Province of Maryland, Georgetown predated the establishment of Washington, D C by 40 years."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Georgetown was an independent municipality until 1871 when the United States Congress created a new consolidated government for the entire District of Columbia."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Washington Harbour, which includes waterfront restaurants, is located to the south on K Street between 30th and 31st Streets."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The embassies of Cameroon, France, Iceland, Liechtenstein, Mongolia, Sweden, Thailand, Ukraine, and Venezuela are located in Georgetown."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Glover Park is a neighborhood in northwest Washington, D.C., about a half mile north of Georgetown and just west of the United States Naval Observatory and Number One Observatory Circle (the Vice President's mansion)."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is named after Charles Carroll Glover."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Every morning and evening, Glover Park residents can hear the Naval Observatory play the sounding of colors synchronized to the nation's Master Clock."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The commercial neighborhood is home to more than 3000 organizations, 200 restaurants, 300 shops and retailers, 7 hotels, and 6 national parks."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Golden Triangle BID is supported by a special assessment collected by the District of Columbia from owners of property within the BID's boundaries."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Businesses that are located within the Golden Triangle BID's boundaries are automatically members of the BID."
    },
    {
      "cityName": "Hillcrest",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hillcrest is located on the District-Maryland line in Ward 7, east of the Anacostia River."
    },
    {
      "cityName": "Hillcrest",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hillcrest is a residential neighborhood in the southeast quadrant of Washington, D.C., United States."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Ivy City Yard, a railroad coach yard and maintenance facility for the passenger railroad Amtrak, is situated northwest across New York Avenue NE."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Construction on the rail yard began in 1907 and was complete within a year; many of its facilities were demolished in 1953 and 1954 as railroads switched from coal-fired locomotives to diesel-fueled or electric engines."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Ivy City is a small neighborhood in Northeast Washington, D.C., in the United States."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "About half the neighborhood is industrial or formerly industrial, dominated by warehouses."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Ivy City was laid out as a suburban development for African Americans in 1873."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Development was slow."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "From 1879 to 1901, the neighborhood hosted the Ivy City Racetrack, a horse racing facility."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The Alexander Crummell School, a community focal point, opened in 1911."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "After some years of enrollment decline, it closed in 1972 but has not been demolished."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "In the 21st century, the area has undergone some gentrification, although people living in the residential core of Ivy City remain very poor and unemployment is high."
    },
    {
      "cityName": "Lincoln Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lincoln Heights is a residential neighborhood in Northeast Washington, D C It is bounded by Nannie Helen Burroughs Avenue NE, Division Avenue NE, East Capitol Street NE, and 58th Street NE."
    },
    {
      "cityName": "Lincoln Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is almost entirely composed of the Lincoln Heights Housing Project, a 325-unit public housing complex with low-rise apartment buildings and townhouses ranging from one bedroom to four bedrooms."
    },
    {
      "cityName": "Lincoln Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The complex is run by the District of Columbia Housing Authority."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Pleasant is known for its unique identity and multicultural landscape, home to diverse groups such as the punk rock, the Peace Corps and Hispanic Washingtonian communities."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood was initially developed around the Mount Pleasant Hospital, which was built and operated during the American Civil War."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Mount Pleasant is a neighborhood in Washington, D.C., located in Northwest D C The neighborhood is primarily residential, with restaurants and stores centered along a commercial corridor on Mt."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Following the war, the largely rural was subdivided for real estate development."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Following the advent of the D C streetcar system, Mt."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Pleasant became Washington's first streetcar suburb and burgeoned as an affluent residential area until the mid-1940s."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The neighborhood entered a period of decay following white flight and the 1968 riots in Washington, D C Since the 2000s, Mount Pleasant has seen urban redevelopment and gentrification."
    },
    {
      "cityName": "NoMa",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "NoMa (short for \"north of Massachusetts Avenue\") is a neighborhood of Washington, D.C., located in Ward 6 of the city."
    },
    {
      "cityName": "NoMa",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood encompasses the region north of Massachusetts Avenue located north and east of Union Station."
    },
    {
      "cityName": "NoMa",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It includes the Sursum Corda, Eckington, and Near Northeast areas, as well as a section known as Swampoodle."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Park View is a neighborhood in Washington, D.C., located in Northwest D C The neighborhood is primarily residential with its main commercial corridor of shops and restauarants located along Georgia Avenue."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered to the west by Columbia Heights, the north by Petworth, and the south by McMillan Reservoir and Pleasant Plains."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Park View was developed at the turn of the 19th and 20th centuries, along the western boundary of the U S Soldiers' Home."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The name of the neighborhood is derived from its relation to the park-like setting of the Soldier's Home, which was formerly open to the public as a park into the 1960s."
    },
    {
      "cityName": "Petworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Petworth is a neighborhood of Washington, D.C., located in Northwest D C While largely residential, Petworth is home to a notable commercial corridor of shops and restaurants, primarily along Georgia Avenue and Upshur Street, as well as a portion of 14th Street."
    },
    {
      "cityName": "Petworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is accessible via the Georgia Ave–Petworth station on the Green Line of the Washington Metro."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pleasant Plains is a neighborhood in central Washington, D C largely occupied by Howard University."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Pleasant Plains, Howard University notwithstanding, is a residential neighborhood."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "For this reason it is also sometimes referred to as Howard Town or, less frequently, Howard Village."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is flanked on the eastern side by the Washington Veteran Affairs Medical Center and Washington Hospital Center, and by the Columbia Heights and Park View neighborhoods on the west and north sides."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "A large portion of its residents are Howard affiliates, either students or employees."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "One of its major community anchors is the Banneker Recreation Center on Georgia Avenue, which reopened in July 2007 after a year of renovations."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The adjacent Benjamin Banneker Academic High School has ranked among the 100 best public schools in the United States."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Pleasant Plains is in Ward 1."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riggs Park is a residential neighborhood in Ward 4 of Northeast Washington, D C It is part of the greater Lamond-Riggs community (comprising the Lamond neighborhood to the north, and Riggs Park to the south)."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Riggs Park is bounded by South Dakota Ave NE to the west, Eastern Ave NE to the east, Galloway St NE to the south, and New Hampshire Ave NE to the north."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Riggs Park is adjacent to the neighborhoods of Michigan Park, and Fort Totten, located in Ward 5 of Northeast Washington D C In addition to these neighborhoods, Riggs Park also borders the city/neighborhood Chillum, which is located in Prince George's County, Maryland."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The WMATA Red Line train tracks pass through the Riggs Park neighborhood when traveling between the Takoma and Fort Totten Metro stations, alongside the adjacent CSX, MARC, and Amtrak train tracks."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Shaw is a major entertainment and retail hub, and much of the neighborhood is designated as a historic district, including the smaller Blagden Alley-Naylor Court Historic District."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Shaw and the U Street Corridor have historically been the city's hub for African-American social, cultural, and economic life."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Shaw is a neighborhood of Washington, D.C., located in the Northwest quadrant."
    },
    {
      "cityName": "Southwest Waterfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Southwest Waterfront is bounded by Interstate 395 to the north, Washington Channel to the west, the Anacostia River to the south, and South Capitol Street to the east."
    },
    {
      "cityName": "Southwest Waterfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Politically, Southwest Waterfront lies in Ward 6."
    },
    {
      "cityName": "Southwest Waterfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It contains The Wharf mixed-use district."
    },
    {
      "cityName": "Tenleytown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tenleytown is a historic neighborhood in the Northwest quadrant of Washington, D.C."
    },
    {
      "cityName": "Van Ness",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The neighborhood is frequently referred to as Van Ness because it is served by the Van Ness–UDC station on the Washington Metro's Red Line and is near the Van Ness campus of the University of the District of Columbia (UDC)."
    },
    {
      "cityName": "Van Ness",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Forest Hills is a residential neighborhood in the northwest quadrant of Washington, D.C., United States, bounded by Connecticut Avenue NW to the west, Rock Creek Park to the east, Chevy Chase to the north, and Tilden Street NW to the south."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Columbia had relatively few residents until the Civil War."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its role as the capital leads people to forget that approximately one-third of the District of Columbia's population was born in the city."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Government growth during World War II provided economic opportunities for African Americans, too."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Between 2010 and the 2020 census, the Black population experienced a notable decline, with Blacks comprising fewer than half of the population for the first time since the late-1950s, though still the largest racial group in the city."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The District of Columbia is a federal district with an ethnically diverse population."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The presence of the U S federal government in Washington has been instrumental in the city's later growth and development."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "In 2011, the District of Columbia's Black population slipped below 50 percent for the first time in over 50 years."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The District was a majority-Black district from the late 1950s through 2011."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The District of Columbia has had a significant African-American population since the District's creation; several neighborhoods are noted for their contributions to Black history and culture."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Like numerous other border and northern cities in the first half of the 20th century, the District of Columbia received many black migrants from the South in the Great Migration."
    },
    {
      "cityName": "Woodley Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The neighborhood is noted as the home of the National Zoological Park, part of the Smithsonian Institution."
    },
    {
      "cityName": "Woodley Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Woodley Park is a neighborhood in Washington, D.C., located in Northwest D C Primarily residential, Woodley Park hosts a commercial corridor of restaurants and shops located along Connecticut Avenue."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Woodridge is a residential neighborhood located in Ward 5 of Northeast Washington, D C Woodridge is contained between Eastern Avenue N E to the east, Taylor Street N E to the north, South Dakota Avenue N E to the west, and Bladensburg Road N E to the south."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In terms of public transportation, residents of Woodridge have access to the Brookland-CUA and Rhode Island Avenue Metro stations."
    }
  ]
}