{
  "facts": [
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Adams Morgan is noted as a historic hub for counterculture and as an arts district."
    },
    {
      "cityName": "Adams Morgan",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also known for its popular entertainment district and culinary scene, centered on both 18th Street and Columbia Road."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Anacostia is a historic neighborhood in Southeast Washington, D.C."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its downtown is located at the intersection of Marion Barry Avenue SE and Martin Luther King Jr Avenue SE."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Anacostia is located directly east of and along the Anacostia River, after which the neighborhood is named."
    },
    {
      "cityName": "Anacostia",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The community's population is more than 90 percent African American."
    },
    {
      "cityName": "Arlington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Washington metropolitan area is the metropolitan area comprising Washington, D.C., the federal capital of the United States, and its surroundings."
    },
    {
      "cityName": "Arlington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The metropolitan area includes all of Washington, D.C., and parts of Maryland, Virginia and even West Virginia."
    },
    {
      "cityName": "Barracks Row",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Barracks Row is a commercial strip along 8th Street SE that connects the Navy Yard and Capitol Hill neighborhoods in the Southeast of Washington, D.C., south of Eastern Market, between M Street SE and Pennsylvania Avenue SE."
    },
    {
      "cityName": "Barracks Row",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The area takes its name from the Marine Barracks, also known as 8th & I, which it faces along 8th Street SE."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bellevue is a residential neighborhood in far Southeast and Southwest in Washington, D.C., United States."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by South Capitol Street, one block of Atlantic Street SE, and 1st Streets SE and SW to the north and east; Joliet Street SW and Oxon Run Parkway to the south; Martin Luther King Jr. Avenue SE, Shepherd Parkway, 2nd Street SW, and Xenia Street SW to the west."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bellevue was created from some of the earliest land patents in Maryland, and draws its name from a 1795 mansion built in the area."
    },
    {
      "cityName": "Bellevue",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Subdivisions began in the 1870s, but extensive residential building did not occur until the early 1940s."
    },
    {
      "cityName": "Benning",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Benning is a residential neighborhood located in Ward 7 of Northeast Washington, D.C."
    },
    {
      "cityName": "Benning",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by East Capitol Street to the south, Minnesota Avenue to the west, and Benning Road on the north and east."
    },
    {
      "cityName": "Benning",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is served by the Benning Road station on the Blue and Silver Lines of the Washington Metro."
    },
    {
      "cityName": "Benning Road",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Benning Road is a major traveled street in Washington, D.C., and Prince George's County, Maryland."
    },
    {
      "cityName": "Brentwood Village",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brentwood is a primarily residential neighborhood in the City of Los Angeles, part of the Westside area of the Los Angeles Basin."
    },
    {
      "cityName": "Brightwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brightwood is a neighborhood in the northwestern quadrant of Washington, D.C."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brookland, also known as Little Rome or Little Vatican, is a neighborhood located in the Northeast (NE) quadrant of Washington, D.C."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Bounded by Fort Totten Metro Train tracks NE, and Brookland CUA Metro train tracks, Taylor Street NE, Rhode Island Avenue NE, South Dakota Avenue NE."
    },
    {
      "cityName": "Brookland",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is best known for its numerous Catholic institutions, including schools, religious communities, shrines, institutes, and other organizations built and based around the Catholic University of America."
    },
    {
      "cityName": "Capitol Gateway",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In 1996, The Atlanta Housing Authority (AHA) created the financial and legal model for mixed-income communities or MICs, that is, communities with both owners and renters of differing income levels, that include public-assisted housing as a component."
    },
    {
      "cityName": "Capitol Gateway",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "This model is used by the U.S. Department of Housing and Urban Development's HOPE VI revitalization program."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Capitol Hill is a neighborhood in Washington, D.C., located in both the Northeast and Southeast quadrants."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by 15th Street SE & NE, F Street NE, Southeast Boulevard SE, and South Capitol Street SE."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Dominated by the United States Capitol, which sits on the highest point of Capitol Hill, it is one of the oldest historic districts in Washington."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood has a high concentration of rowhouses, largely dating from the 19th century."
    },
    {
      "cityName": "Capitol Hill",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The name Capitol Hill is frequently used as a metonym for the U.S. Congress."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Capitol Riverfront is a business improvement district (BID) located just south of the United States Capitol between Capitol Hill and the Anacostia River in Washington, D.C."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was created by the District of Columbia City Council and approved by Mayor Fenty in August 2007."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The BID is a mixed-use neighborhood."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It was a former industrial area transformed into a business center, urban neighborhood, entertainment district, and waterfront destination."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The project involves adding over 9,000 new apartments, condominiums, lofts, modern office towers, 1,200 hotel rooms, one million square feet of retail amenities, two grocery stores, new restaurants, shops, and cafes."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Over 33,900,000 square feet of office, residential, hotel, and retail space, as well as four new parks, were planned over 10–15 years."
    },
    {
      "cityName": "Capitol Riverfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The new 5-acre (20,000 m2) riverfront Yards Park opened in fall 2010."
    },
    {
      "cityName": "Chevy Chase",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chevy Chase is a neighborhood in northwest Washington, D.C."
    },
    {
      "cityName": "Chevy Chase",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It borders Chevy Chase, Maryland."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cleveland Park is a residential neighborhood in the Northwest quadrant of Washington, D.C."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located at and bounded approximately by Rock Creek Park to the east, Wisconsin and Idaho Avenues to the west, Klingle and Woodley Roads to the south, and Rodman and Tilden Streets to the north."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its main commercial corridor lies along Connecticut Avenue NW, where the eponymous Cleveland Park station of the Washington Metro's Red Line can be found; another commercial corridor lies along Wisconsin Avenue."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood is known for its many late 19th century homes and the historic Art Deco Uptown Theater."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is also home to the William L."
    },
    {
      "cityName": "Cleveland Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Slayton House and the Park and Shop, built in 1930 and one of the earliest strip malls."
    },
    {
      "cityName": "Colorado Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Washington, D.C., officially the District of Columbia and commonly known as simply Washington or D.C., is the capital city and federal district of the United States."
    },
    {
      "cityName": "Colorado Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is on the Potomac River across from Virginia and shares land borders with Maryland to its north and east."
    },
    {
      "cityName": "Colorado Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was named after George Washington, a Founding Father and the first president of the United States."
    },
    {
      "cityName": "Colorado Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The district is named for Columbia, the female personification of the nation."
    },
    {
      "cityName": "Columbia Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Columbia Heights is home to numerous historical landmarks, including Meridian Hill Park, National Baptist Memorial Church, All Souls Church, along with a number of embassy buildings."
    },
    {
      "cityName": "Congress Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Congress Heights is a residential neighborhood in Southeast Washington, D.C., in the United States."
    },
    {
      "cityName": "Congress Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Commercial development is heavy along Martin Luther King, Jr. Avenue and Malcolm X Avenue."
    },
    {
      "cityName": "Deanwood",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Deanwood is a neighborhood in Northeast Washington, D.C., bounded by Eastern Avenue to the northeast, Kenilworth Avenue to the northwest, Division Avenue to the southeast, and Nannie Helen Burroughs Avenue to the south."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Dupont Circle is a historic roundabout park and neighborhood of Washington, D.C., located in Northwest D.C."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Dupont Circle neighborhood is bounded approximately by 16th Street NW to the east, 22nd Street NW to the west, M Street NW to the south, and Florida Avenue NW to the north."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Much of the neighborhood is listed on the National Register of Historic Places."
    },
    {
      "cityName": "Dupont Circle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "However, the local government Advisory Neighborhood Commission and the Dupont Circle Historic District have slightly different boundaries."
    },
    {
      "cityName": "Foggy Bottom",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Foggy Bottom is a neighborhood of Washington, D.C., United States, located in the city's northwest quadrant."
    },
    {
      "cityName": "Foggy Bottom",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It stretches west of the White House towards the Potomac River, north of the National Mall, east of Georgetown, south of the West End neighborhood and west of Downtown D.C."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fort Lincoln is a neighborhood located in northeastern Washington, D.C."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by Bladensburg Road to the northwest, Eastern Avenue to the northeast, New York Avenue NE to the south, and South Dakota Avenue NE to the southwest."
    },
    {
      "cityName": "Fort Lincoln",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town of Colmar Manor, Maryland, is across Eastern Avenue from the Fort Lincoln neighborhood, as is the Fort Lincoln Cemetery."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Georgetown is a historic neighborhood and commercial district in Northwest Washington, D.C., situated along the Potomac River."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded in 1751 as part of the colonial-era Province of Maryland, Georgetown predated the establishment of Washington, D.C."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Georgetown was an independent municipality until 1871 when the United States Congress created a new consolidated government for the entire District of Columbia."
    },
    {
      "cityName": "Georgetown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "A separate act, passed in 1895, repealed Georgetown's remaining local ordinances and renamed Georgetown's streets to conform with those in Washington, D.C."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Glover Park is a neighborhood in northwest Washington, D.C., about a half mile north of Georgetown and just west of the United States Naval Observatory and Number One Observatory Circle."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Every morning and evening, Glover Park residents can hear the Naval Observatory play the sounding of colors synchronized to the nation's Master Clock."
    },
    {
      "cityName": "Glover Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is named after Charles Carroll Glover."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Golden Triangle is a neighborhood and business improvement district (BID) in Washington, D.C."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Covering 43 blocks, it encompasses the western part of Washington's central business district, running from the front yard of the White House's north side to Dupont Circle and from 16th Street NW to 21st Street NW and including sections of K Street and Connecticut Avenue."
    },
    {
      "cityName": "Golden Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The commercial neighborhood is home to more than 3,000 organizations, 200 restaurants, 300 shops and retailers, 7 hotels, and 6 national parks."
    },
    {
      "cityName": "H Street NE",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "H Street is a set of east–west streets in several of the quadrants of Washington, D.C."
    },
    {
      "cityName": "H Street NE",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also used as an alternate name for the Near Northeast neighborhood, as H Street NW/NE is the neighborhood's main commercial strip."
    },
    {
      "cityName": "Hillcrest",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hillcrest is a residential neighborhood in the southeast quadrant of Washington, D.C., United States."
    },
    {
      "cityName": "Hillcrest",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hillcrest is located on the District-Maryland line in Ward 7, east of the Anacostia River."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "About half the neighborhood is industrial or formerly industrial, dominated by warehouses."
    },
    {
      "cityName": "Ivy City",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Ivy City Yard, a railroad coach yard and maintenance facility for the passenger railroad Amtrak, is situated northwest across New York Avenue NE."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kenilworth is a residential neighborhood in Northeast Washington, D.C., located on the eastern bank of the Anacostia River and just inside the D.C.–Maryland border."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A large public housing complex, Kenilworth Courts, dominates the area."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighborhood is famous for the Kenilworth Park and Aquatic Gardens, a national park whose centerpiece is a series of ponds carved out of Anacostia River marshland."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Visitors come especially during June and July to see the beautiful blooming water lilies and lotus flowers."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In 1895, the name \"Kenilworth\" was first applied to the area by real estate developer Allen Mallery, who named this neighborhood after Kenilworth Castle in England, the ruins of which can still be seen today in Warwickshire."
    },
    {
      "cityName": "Kenilworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Kenilworth Park, which includes the Kenilworth-Parkside Recreation Center, also carries the neighborhood name, though most of the park's area is actually located adjacent to the modern neighborhoods of Parkside and Eastland Gardens."
    },
    {
      "cityName": "Kennedy Street",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kennedy Center for the Performing Arts, commonly known as the Kennedy Center, is the national cultural center of the United States, serving as a \"living memorial\" to John F."
    },
    {
      "cityName": "Kennedy Street",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located on the eastern bank of the Potomac River in Washington, D.C., the center opened September 8, 1971, and hosts many genres of performance art, spanning theater, ballet, modern dance, classical music, jazz, pop, psychedelic, and folk music."
    },
    {
      "cityName": "Kennedy Street",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Kennedy Center is the official residence of the National Symphony Orchestra."
    },
    {
      "cityName": "Kennedy Street",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It was also the official residence of the Washington National Opera until January 2026."
    },
    {
      "cityName": "Lincoln Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lincoln Heights is a residential neighborhood in Northeast Washington, D.C."
    },
    {
      "cityName": "Lincoln Heights",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by Nannie Helen Burroughs Avenue NE, Division Avenue NE, East Capitol Street NE, and 58th Street NE."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Pleasant is a neighborhood in Washington, D.C., located in Northwest D.C."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is primarily residential, with restaurants and stores centered along a commercial corridor on Mt."
    },
    {
      "cityName": "Mount Pleasant",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Mount Pleasant is known for its unique identity and multicultural landscape, home to diverse groups such as the punk rock, the Peace Corps and Hispanic Washingtonian communities."
    },
    {
      "cityName": "Mount Vernon Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Vernon Triangle is a neighborhood and community improvement district in the northwest quadrant of Washington, D.C."
    },
    {
      "cityName": "Mount Vernon Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is located adjacent to Mount Vernon Square."
    },
    {
      "cityName": "Mount Vernon Triangle",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Originally a working-class neighborhood established in the 19th century, present-day Mount Vernon Triangle experienced a decline in the mid-20th century as it transitioned from residential to commercial and industrial use."
    },
    {
      "cityName": "NoMa",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The neighborhood encompasses the region north of Massachusetts Avenue located north and east of Union Station."
    },
    {
      "cityName": "NoMa",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It includes the Sursum Corda, Eckington, and Near Northeast areas, as well as a section known as Swampoodle."
    },
    {
      "cityName": "Northwest One",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Northwest is the northwestern quadrant of Washington, D.C., the capital of the United States, and is located north of the National Mall and west of North Capitol Street."
    },
    {
      "cityName": "Northwest One",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the largest of the four quadrants of the city, and it includes the central business district, the Federal Triangle, and the museums along the northern side of the National Mall, as well as many of the District's historic neighborhoods."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Park View is a neighborhood in Washington, D.C., located in Northwest D.C."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is primarily residential with its main commercial corridor of shops and restauarants located along Georgia Avenue."
    },
    {
      "cityName": "Park View",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is bordered to the west by Columbia Heights, the north by Petworth, and the south by McMillan Reservoir and Pleasant Plains."
    },
    {
      "cityName": "Pennsylvania Avenue SE",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pennsylvania Avenue is a primarily diagonal street in Washington, D.C., that connects the United States Capitol with the White House and then crosses northwest Washington, D.C., to Georgetown."
    },
    {
      "cityName": "Pennsylvania Avenue SE",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Traveling through southeast Washington from the Capitol, it enters Prince George's County, Maryland, and becomes MD Route 4 and then MD 717 in Upper Marlboro, and finally Stephanie Roper Highway."
    },
    {
      "cityName": "Petworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Petworth is a neighborhood of Washington, D.C., located in Northwest D.C."
    },
    {
      "cityName": "Petworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "While largely residential, Petworth is home to a notable commercial corridor of shops and restaurants, primarily along Georgia Avenue and Upshur Street, as well as a portion of 14th Street."
    },
    {
      "cityName": "Petworth",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighborhood is accessible via the Georgia Ave–Petworth station on the Green Line of the Washington Metro."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pleasant Plains is a neighborhood in central Washington, D.C."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "largely occupied by Howard University."
    },
    {
      "cityName": "Pleasant Plains",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "For this reason it is also sometimes referred to as Howard Town or, less frequently, Howard Village."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riggs Park is a residential neighborhood in Ward 4 of Northeast Washington, D.C."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of the greater Lamond-Riggs community."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Riggs Park is bounded by South Dakota Ave NE to the west, Eastern Ave NE to the east, Galloway St NE to the south, and New Hampshire Ave NE to the north."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Riggs Park is adjacent to the neighborhoods of Michigan Park, and Fort Totten, located in Ward 5 of Northeast Washington D.C."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "In addition to these neighborhoods, Riggs Park also borders the city/neighborhood Chillum, which is located in Prince George's County, Maryland."
    },
    {
      "cityName": "Riggs Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The WMATA Red Line train tracks pass through the Riggs Park neighborhood when traveling between the Takoma and Fort Totten Metro stations, alongside the adjacent CSX, MARC, and Amtrak train tracks."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Shaw is a neighborhood of Washington, D.C., located in the Northwest quadrant."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Shaw is a major entertainment and retail hub, and much of the neighborhood is designated as a historic district, including the smaller Blagden Alley-Naylor Court Historic District."
    },
    {
      "cityName": "Shaw",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Shaw and the U Street Corridor have historically been the city's hub for African-American social, cultural, and economic life."
    },
    {
      "cityName": "Southwest Waterfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Southwest Waterfront is a neighborhood in Southwest Washington, D.C."
    },
    {
      "cityName": "Southwest Waterfront",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Southwest quadrant is the smallest of Washington's four quadrants, and the Southwest Waterfront is one of only two residential neighborhoods in the quadrant; the other is Bellevue, which, being east of the Anacostia River, is frequently, if mistakenly, regarded as being in Southeast."
    },
    {
      "cityName": "Tenleytown",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Tenleytown is a historic neighborhood in the Northwest quadrant of Washington, D.C."
    },
    {
      "cityName": "The Parks At Walter Reed",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Walter Reed was a U.S. Army physician who in 1901 led the team that confirmed the theory of Cuban doctor Carlos Finlay that yellow fever is transmitted by a particular mosquito species rather than by direct contact."
    },
    {
      "cityName": "The Parks At Walter Reed",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "This insight gave impetus to the new fields of epidemiology and biomedicine, and most immediately allowed the resumption and completion of work on the Panama Canal (1904–1914) by the United States."
    },
    {
      "cityName": "The Parks At Walter Reed",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Reed followed work started by Finlay and directed by George Miller Sternberg, who has been called the \"first U.S. bacteriologist\"."
    },
    {
      "cityName": "The Wharf",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District Wharf, commonly known simply as The Wharf, is a multi-billion dollar mixed-use development on the Southwest Waterfront in Washington, D.C."
    },
    {
      "cityName": "The Wharf",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It contains the city's historic Maine Avenue Fish Market, hotels, residential buildings, restaurants, shops, parks, piers, docks and marinas, and live music venues."
    },
    {
      "cityName": "The Wharf",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The first phase of The Wharf opened in October 2017 and the second and final phase was completed in October 2022."
    },
    {
      "cityName": "The Wharf",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The neighborhood encompasses 24 acres of land, 50 acres of water, and contain 3.2 million square feet (300,000 m2) of retail, residential, and entertainment space along 1 mile (1.6 km) of the Potomac River shoreline from the Francis Case Memorial Bridge to Fort McNair."
    },
    {
      "cityName": "Union Market",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Union Market is a food hall located in Washington, D.C."
    },
    {
      "cityName": "Union Market",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It anchors the Union Market District, a neighborhood encompassing high-rise apartments, office buildings, retail, and entertainment options."
    },
    {
      "cityName": "Van Ness",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Forest Hills is a residential neighborhood in the northwest quadrant of Washington, D.C., United States, bounded by Connecticut Avenue NW to the west, Rock Creek Park to the east, Chevy Chase to the north, and Tilden Street NW to the south."
    },
    {
      "cityName": "Van Ness",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is frequently referred to as Van Ness because it is served by the Van Ness–UDC station on the Washington Metro's Red Line and is near the Van Ness campus of the University of the District of Columbia (UDC)."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The District of Columbia is a federal district with an ethnically diverse population."
    },
    {
      "cityName": "Washington",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "On July 2024, the District had a population of 702,250 people, with a resident density of 11,515 people per square mile."
    },
    {
      "cityName": "Williamsport",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The history of Washington, D.C., is tied to its role as the capital of the United States."
    },
    {
      "cityName": "Williamsport",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The site of the District of Columbia along the Potomac River was first selected by President George Washington."
    },
    {
      "cityName": "Williamsport",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city came under attack during the War of 1812."
    },
    {
      "cityName": "Williamsport",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Upon the government's return to the capital, it had to manage the reconstruction of numerous public buildings, including the White House and the United States Capitol."
    },
    {
      "cityName": "Williamsport",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The McMillan Plan of 1901 helped restore and beautify the downtown core area, including establishing the National Mall, along with numerous monuments and museums."
    },
    {
      "cityName": "Woodley Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Woodley Park is a neighborhood in Washington, D.C., located in Northwest D.C."
    },
    {
      "cityName": "Woodley Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Primarily residential, Woodley Park hosts a commercial corridor of restaurants and shops located along Connecticut Avenue."
    },
    {
      "cityName": "Woodley Park",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighborhood is noted as the home of the National Zoological Park, part of the Smithsonian Institution."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Woodridge is a residential neighborhood located in Ward 5 of Northeast Washington, D.C."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Woodridge is contained between Eastern Avenue N.E."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "to the east, Taylor Street N.E."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "to the north, South Dakota Avenue N.E."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "to the west, and Bladensburg Road N.E."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Its central commercial strips are Rhode Island Avenue NE and Bladensburg Road N.E."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Woodridge borders the adjacent neighborhoods of Brookland, Langdon, North Michigan Park, and Fort Lincoln in Northeast Washington D.C."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "In addition to these neighborhoods in the District of Columbia, Woodridge borders the city of Mount Rainier and town of Cottage City in Maryland."
    },
    {
      "cityName": "Woodridge",
      "state": "DC",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "In terms of public transportation, residents of Woodridge have access to the Brookland-CUA and Rhode Island Avenue Metro stations."
    }
  ]
}