{
  "facts": [
    {
      "cityName": "Aberdeen",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community was named after Aberdeen, in Scotland."
    },
    {
      "cityName": "Acequia",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town is named for the Spanish word for canal."
    },
    {
      "cityName": "Albion",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The school was closed in 1951 and its teaching programs were transferred to Idaho State College (now Idaho State University) in Pocatello."
    },
    {
      "cityName": "Albion",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Beginning in 1893 it was home of the Albion State Normal School, which trained many Idaho teachers."
    },
    {
      "cityName": "Albion",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "By 2006 the campus had fallen into serious disrepair."
    },
    {
      "cityName": "Albion",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Albion is one of the few cities in the Magic Valley region of Idaho founded before 1900."
    },
    {
      "cityName": "Ammon",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "As of the 2010 US Census, the population of Ammon was 13816."
    },
    {
      "cityName": "Ammon",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "By the 2020 census, Ammon's population had grown to 17694."
    },
    {
      "cityName": "Ammon",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was one of the state's fastest growing cities from 2000 to 2010, experiencing a 123.3% growth rate based on the 2010 US Census."
    },
    {
      "cityName": "Ashton",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The district is noted for seed potato production and bills itself as the world's largest seed potato growing area."
    },
    {
      "cityName": "Athol",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its main attraction is Silverwood Theme Park."
    },
    {
      "cityName": "Bellevue",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Bellevue Historic District and the Henry Miller House are both listed on the National Register of Historic Places."
    },
    {
      "cityName": "Bellevue",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Big Wood River flows near downtown."
    },
    {
      "cityName": "Bellevue",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The city of Hailey and the Friedman Memorial Airport are a few miles north of Bellevue."
    },
    {
      "cityName": "Blackfoot",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Blackfoot is known as the Potato Capital of the World and is home to the Idaho Potato Museum, celebrating the state's famous crop."
    },
    {
      "cityName": "Blackfoot",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is the seat of Bingham County and serves as a trade center for the surrounding agricultural region of eastern Idaho."
    },
    {
      "cityName": "Blanchard",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Blanchard is located on Idaho State Highway 41 6.5 miles (10.5 km) northwest of Spirit Lake."
    },
    {
      "cityName": "Blanchard",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As of the 2010 census, its population was 379."
    },
    {
      "cityName": "Bloomington",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was first settled in 1864."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Originally established as a military outpost in 1863 during the gold rush era, Boise rapidly grew due to its location on the Oregon Trail and its proximity to mining operations in the surrounding region."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is home to the Boise Art Museum, Idaho State Capitol, the annual Treefort Music Fest, and the Basque Block, showcasing its Basque heritage."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "By the late 19th century, it had become a commercial and transportation hub, bolstered by the arrival of the railroad and irrigation projects that supported agriculture in the Treasure Valley."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "While agriculture and food processing remain important, Boise is home to major employers in the technology, manufacturing, and service sectors, including companies such as Micron Technology and Hewlett-Packard."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Located on the Boise River in southwestern Idaho, it is 41 miles (66 km) east of the Oregon border and 110 miles (177 km) north of the Nevada border."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Boise (locally ) is the capital and most populous city of the U S state of Idaho."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Government, education, and healthcare also play significant roles in the local economy."
    },
    {
      "cityName": "Boise",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Additionally, the Boise greenbelt and nearby public lands offer recreational opportunities that are integral to the city's identity."
    },
    {
      "cityName": "Bonners Ferry",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Porthill-Rykerts Border Crossing connects Bonners Ferry with Creston, British Columbia, Canada, on the Kootenay River."
    },
    {
      "cityName": "Bonners Ferry",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Eastport–Kingsgate Border Crossing connects Bonners Ferry with Yahk, British Columbia, Canada, on the Moyie River."
    },
    {
      "cityName": "Buhl",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Clear Springs Foods, located just north of Buhl, processes over 20 million pounds of rainbow trout each year, making it the world's largest producer."
    },
    {
      "cityName": "Buhl",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "U S Route 30 passes through Buhl, along the scenic Thousand Springs Scenic Byway from Twin Falls to Bliss."
    },
    {
      "cityName": "Buhl",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Known as the \"Trout Capital of the World,\" Buhl is the location of numerous hatcheries in the immediate surrounding area, which produce a majority of the rainbow trout consumed in the United States."
    },
    {
      "cityName": "Burley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Burley is the largest city in Cassia and Minidoka counties (collectively called the “Mini-Cassia” area), and the third-largest city in Idaho's Magic Valley region, after Twin Falls and Jerome."
    },
    {
      "cityName": "Caldwell",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Caldwell is a city in and the county seat of Canyon County, Idaho, United States. Caldwell is the 5th most populous city in Idaho.."
    },
    {
      "cityName": "Carey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Nearby recreational destinations include the Craters of the Moon National Monument, Carey Lake, Silver Creek and the Little Wood River."
    },
    {
      "cityName": "Carey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Further west is the Big Wood River Valley, leading to the Sun Valley resort."
    },
    {
      "cityName": "Carey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Carey is primarily an agricultural city and is the location of the Blaine County Fairgrounds."
    },
    {
      "cityName": "Cataldo",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cataldo lies on the southeast banks of the Coeur d'Alene River and Interstate 90 passes the south side of the community."
    },
    {
      "cityName": "Cataldo",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community of Kingston lies along I-90 to the east."
    },
    {
      "cityName": "Challis",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The 2020 census showed 902 residents, a 16.6% drop."
    },
    {
      "cityName": "Challis",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "And as of 2023, the population increased to 924."
    },
    {
      "cityName": "Chubbuck",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chubbuck is located immediately north of Pocatello, Idaho, and has opposed several consolidation proposals since the 1960s."
    },
    {
      "cityName": "Clayton",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is adjacent to the Salmon River."
    },
    {
      "cityName": "Coeur d'Alene",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Coeur d'Alene is a city in and the county seat of Kootenai County, Idaho, United States. It is the most populous city in North Idaho with a population of 54,628 at the 2020 census, while the Coeur d'Alene metropolitan statistical area has an estimated 188,000 people."
    },
    {
      "cityName": "Coeur d'Alene",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Coeur d'Alene is located about 30 miles (50 km) east of Spokane, Washington, with which it forms the bi-state Spokane–Coeur d'Alene combined statistical area. The city is situated on the north shore of the 25-mile (40 km) long Lake Coeur d'Alene and to the west of the Coeur d'Alene Mountains."
    },
    {
      "cityName": "Coeur d'Alene",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Locally, Coeur d'Alene is known as the \"Lake City\", or simply called by its initials, \"CDA\".."
    },
    {
      "cityName": "Conda",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Conda is 6 miles (9.7 km) northeast of Soda Springs."
    },
    {
      "cityName": "Cottonwood",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On the Camas Prairie in north central Idaho, the population was 822 at the 2020 census, down from 900 in 2010 and 944 in 2000."
    },
    {
      "cityName": "Cottonwood",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is just west of U S Route 95, between Grangeville and Lewiston."
    },
    {
      "cityName": "Craigmont",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located on the Camas Prairie in north central Idaho, it is within the Nez Perce Indian Reservation."
    },
    {
      "cityName": "Crouch",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In 2018, it has multiple commercial businesses for tourists and residents: a small grocery mart, a hardware store, three restaurants, a bar, an outdoor theater, and a community thrift store."
    },
    {
      "cityName": "Crouch",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "At that time, the construction of the Banks/Lowman road 2512A, The \"Wildlife Canyon Scenic Byway highway, transformed a small unpaved road unto a paved modern road between Crouch and Lowman."
    },
    {
      "cityName": "Crouch",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Now it is a fully modern paved roadway with informational and white water rafting pull outs which serves to transport tourists, rafters, commuters, and other traffic across the middle Idaho region."
    },
    {
      "cityName": "Crouch",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city was founded in 1934, and then incorporated as a City in 1951 to bring legal alcohol and gambling to the area."
    },
    {
      "cityName": "Dalton Gardens",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is considered a suburb of Coeur d'Alene and borders the city to the north and east."
    },
    {
      "cityName": "Dalton Gardens",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city of Dalton Gardens is also part of the larger Spokane-Coeur d'Alene Combined Metropolitan Statistical Area which encompasses Kootenai County, Idaho."
    },
    {
      "cityName": "Donnelly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The City of Donnelly, named after a prominent railroad man, was incorporated in 1914."
    },
    {
      "cityName": "Donnelly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Donnelly is the world headquarters of the celebrated Donnelly Show Ski Team which was established in 2008."
    },
    {
      "cityName": "Donnelly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Donnelly is in the Long Valley of Valley County, on the northeast shore of Lake Cascade (Cascade Reservoir), between the two major cities in the county."
    },
    {
      "cityName": "Donnelly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Tamarack Resort is across the reservoir to the southwest."
    },
    {
      "cityName": "Donnelly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "McCall is 13 miles (21 km) north, and Cascade is 16 miles (26 km) to the south, via Highway 55."
    },
    {
      "cityName": "Downey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community was reportedly named after one Mr. Downey, a director of the Union Pacific Railroad."
    },
    {
      "cityName": "Downey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "However, researchers have been unable verify existence of said Mr. Downey."
    },
    {
      "cityName": "Downey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Notwithstanding, some have asserted he was a track worker, not a director."
    },
    {
      "cityName": "Driggs",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located within city limits is the Driggs-Reed Memorial Airport, a class II airport that can accommodate private aircraft on its 7300-foot (2225 m) runway."
    },
    {
      "cityName": "Dubois",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Six miles (10 km) north of town is the U S Sheep Experiment Station, the county's second largest employer."
    },
    {
      "cityName": "Dubois",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city was named in 1892 for Fred Dubois (1851−1930), a prominent politician in Idaho's early years."
    },
    {
      "cityName": "Dubois",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "He came to Idaho in 1880, later becoming the state's first U S Senator, serving two non-consecutive terms (1891−97, 1901−07)."
    },
    {
      "cityName": "Dubois",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The station studies sheep breeds to support U S farmers."
    },
    {
      "cityName": "Eagle",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Eagle is one of the fastest-growing cities in Idaho, located in the Boise metropolitan area along the Boise River."
    },
    {
      "cityName": "Eagle",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city was named after Eagle Island, which got its name from the bald eagles that nested along the Boise River in the area."
    },
    {
      "cityName": "Elk River",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is accessed from State Highway 8 from Bovill, to the west in adjacent Latah County."
    },
    {
      "cityName": "Elk River",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Formerly the site of a Potlatch sawmill, it was phased out after several decades during the 1930s."
    },
    {
      "cityName": "Ferdinand",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "At the southern end of the Nez Perce Indian Reservation, it was founded by F M Bieker shortly after the reservation was opened for settlement in 1895."
    },
    {
      "cityName": "Ferdinand",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was named after Ferdinand, Indiana, where his mother's family had lived."
    },
    {
      "cityName": "Fernan Lake Village",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It borders Fernan Lake to the east in which the town gets its name."
    },
    {
      "cityName": "Filer",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Filer is located just west of the intersection of U S Routes 93 and 30."
    },
    {
      "cityName": "Fruitland",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fruitland is named after apple orchards that surround the community, and its slogan is \"The Big Apple of Idaho.\" As of the 2020 census, the city had a total population of 6072, up from 4684 in 2010."
    },
    {
      "cityName": "Fruitland",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It lies along U S Route 95 in the Treasure Valley of southwest Idaho, about 50 miles (80 km) west of Boise on the border with Oregon."
    },
    {
      "cityName": "Garden City",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Garden City was named for gardens raised by Chinese immigrants who lived in the area."
    },
    {
      "cityName": "Garden City",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Garden City is nearly surrounded by Boise but retains a separate municipal government."
    },
    {
      "cityName": "Garden City",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The name of the city's only main street, Chinden Boulevard, is a portmanteau of the words \"China\" and \"garden.\" In the second decade of the 21st century, it became a haven for artists' studios."
    },
    {
      "cityName": "Garden Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The mountain setting and recreation opportunities attract visitors from the Boise area."
    },
    {
      "cityName": "Garden Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Life there during the pioneer days was quite harsh and economic opportunity was based on logging, mining, and ranching."
    },
    {
      "cityName": "Garden Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As of the 2020 census, its population was 377, a decrease of the 394 count on the 2010 census."
    },
    {
      "cityName": "Garden Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In later years there was work as hunting guides."
    },
    {
      "cityName": "Genesee",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known for its grain production."
    },
    {
      "cityName": "Genesee",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city was named for the Genesee region of western New York, although it may also be a modification of the biblical Genesis."
    },
    {
      "cityName": "Genesee",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The first area of permanent settlement in the county, it was incorporated 137 years ago on October 23, 1889."
    },
    {
      "cityName": "Genesee",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The town is on the edge of Latah County and many of the rural residents live in Nez Perce county."
    },
    {
      "cityName": "Genesee",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "There is one school in the town, a consolidated K-12 school within the Genesee School District."
    },
    {
      "cityName": "Georgetown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was settled by Mormon pioneers on the route of the Oregon Trail and was named after George Q. Cannon."
    },
    {
      "cityName": "Georgetown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Georgetown was first settled in 1864 The population was 503 at the 2020 census."
    },
    {
      "cityName": "Georgetown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "U S Route 30 passes through the town."
    },
    {
      "cityName": "Glenns Ferry",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is adjacent to Interstate 84 and the Snake River."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The world's largest factory for barrel cheese, the raw product for processed cheese, is located in Gooding."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is named for Frank R. Gooding, a local sheep rancher who became a prominent political figure in Idaho in the early 20th century, serving as both Governor of Idaho and a United States Senator."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The original name of Gooding was Toponis."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Gooding is home to the Idaho School for the Deaf and the Blind."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It has a capacity of 120000 metric tons per year of barrel cheese and belongs to the Glanbia group."
    },
    {
      "cityName": "Gooding",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Gooding is also home to Gooding Elementary, Gooding Middle, and Gooding High schools."
    },
    {
      "cityName": "Grangeville",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population was 3308 at the 2020 census, up from 3141 in 2010."
    },
    {
      "cityName": "Greenleaf",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town was established by Quakers in the early-1900s and is named after Quaker poet and abolitionist John Greenleaf Whittier."
    },
    {
      "cityName": "Hagerman",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hagerman is home to a national fish hatchery, a university research station, and extensive aquaculture, assisted by an abundance of geothermal water for temperature regulation."
    },
    {
      "cityName": "Hagerman",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The area is noted for its fossil beds and the Thousand Springs of the Eastern Snake Plain Aquifer."
    },
    {
      "cityName": "Hailey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hailey is the site of Friedman Memorial Airport (SUN), the airport for the resort area of Sun Valley/Ketchum, 12 miles (19 km) north."
    },
    {
      "cityName": "Hailey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is named after John Hailey, a two-time Congressional delegate from the Idaho Territory."
    },
    {
      "cityName": "Hailey",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town of Bellevue is a few miles south."
    },
    {
      "cityName": "Harrison",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Harrison is located on the eastern shore of Lake Coeur d'Alene, immediately south of where the Coeur d'Alene River flows into the lake."
    },
    {
      "cityName": "Hayden",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the northern portion of the state, it is a suburb of nearby Coeur d'Alene and its population was 15570 at the 2020 census."
    },
    {
      "cityName": "Homedale",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was, at one time, the terminus of a branch of the Oregon Short Line Railroad."
    },
    {
      "cityName": "Homedale",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town name was chosen by drawing names from a hat during a community picnic."
    },
    {
      "cityName": "Horseshoe Bend",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population of 715 at the 2020 census was the largest in the county."
    },
    {
      "cityName": "Horseshoe Bend",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is named for its location at the horseshoe-shaped U-turn of the Payette River, whose flow direction changes from south to north before heading west to the Black Canyon Reservoir."
    },
    {
      "cityName": "Idaho City",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Idaho City is part of the Boise City−Nampa, Idaho Metropolitan Statistical Area."
    },
    {
      "cityName": "Idaho Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is served by the Idaho Falls Regional Airport and is home to the College of Eastern Idaho, Museum of Idaho, Idaho Falls Idaho Temple, and the Idaho Falls Chukars baseball team of the Pioneer League, as well as the Idaho Falls Spud Kings."
    },
    {
      "cityName": "Idaho Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As of the 2020 census, the population of Idaho Falls was 64818."
    },
    {
      "cityName": "Idaho Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In the 2010 census, the population of Idaho Falls was 56813 (2019 estimate: 62888), with a metro population of 133265."
    },
    {
      "cityName": "Idaho Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "As of the 2020 census, the Idaho Falls Metropolitan Statistical Area had a population of 154855."
    },
    {
      "cityName": "Idaho Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Idaho Falls serves as the commercial, cultural, and healthcare hub for Eastern Idaho, as well as parts of western Wyoming and southern Montana."
    },
    {
      "cityName": "Inkom",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the home of the smallest airport in the world, Simko Field Airport 1ID9, with a runway length of 122 meters (400 feet)."
    },
    {
      "cityName": "Island Park",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city was incorporated by owners of the many lodges and resorts along U S Route 20 in 1947, primarily to circumvent Idaho's liquor laws that prohibited the sale of liquor outside of city limits."
    },
    {
      "cityName": "Island Park",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city's population was 193 at the 2020 census, down from 286 in 2010."
    },
    {
      "cityName": "Island Park",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is only 500 feet (150 m) wide in most locations and at 33 miles (53 km), claims to have the longest \"Main Street\" in the world."
    },
    {
      "cityName": "Jerome",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Jerome's economy is largely agrarian, with dairy farming being one of the main revenue sources for the local economy."
    },
    {
      "cityName": "Juliaetta",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town was named after the daughters of an early settler."
    },
    {
      "cityName": "Juliaetta",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In 2020, Juliaetta had a population of 624."
    },
    {
      "cityName": "Kamiah",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The largest city in Lewis County, it extends only a small distance into Idaho County, south of Lawyer Creek."
    },
    {
      "cityName": "Kamiah",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city lies in the narrow valley of the Clearwater River; downstream are Orofino and Lewiston, at the confluence with the Snake River."
    },
    {
      "cityName": "Kellogg",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city lies near the Coeur d'Alene National Forest and about 36 miles (58 km) east-southeast of Coeur d'Alene along Interstate 90."
    },
    {
      "cityName": "Kellogg",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As of the 2010 United States census, the city had a total population of 2120, down by a third from its population in 1980."
    },
    {
      "cityName": "Kendrick",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population was 303 at the 2010 census, a decrease from 369 in 2000."
    },
    {
      "cityName": "Ketchum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the Wood River Valley, Ketchum is adjacent to Sun Valley and the communities share many resources: both sit in the same valley beneath Bald Mountain, with its skiing."
    },
    {
      "cityName": "Ketchum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city also draws tourists to its fishing, hiking, trail riding, tennis, shopping, art galleries, and more."
    },
    {
      "cityName": "Ketchum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Located in the central part of the state, the population was 3551 at the 2020 census, up from 2689 in 2010."
    },
    {
      "cityName": "Ketchum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The airport for Ketchum, Friedman Memorial Airport, is approximately 15 miles (24 km) south in Hailey."
    },
    {
      "cityName": "Kimberly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kimberly was founded in 1905."
    },
    {
      "cityName": "Kimberly",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is named after Peter L. Kimberly, a major investor in the construction of Milner Dam which made commercial irrigation practical in the area."
    },
    {
      "cityName": "Kingston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kingston is located on the south bank of the Coeur d'Alene River along Interstate 90 about 2 miles (3.2 km) northwest of Pinehurst."
    },
    {
      "cityName": "Kooskia",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is at the confluence of the South and Middle forks of the Clearwater River, combining to become the main river."
    },
    {
      "cityName": "Kuna",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kuna is one of the fastest-growing areas in Idaho, having nearly tripled in population between 2000 and 2010 and a nearly additional 60 percent gain between 2010 and 2020."
    },
    {
      "cityName": "Laclede",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Laclede is located on U S Route 2 at the intersection of Riley Creek and the Pend Oreille (pronounced Pond O'Ray) River."
    },
    {
      "cityName": "Laclede",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Riley Creek Recreation Area and Pend Oreille Wildlife Management Area lie one mile (1.6 km) SW of Laclede."
    },
    {
      "cityName": "Laclede",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Laclede is surrounded by forested lands."
    },
    {
      "cityName": "Laclede",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Laclede Mill, a part of the Idaho Forest Group, is in Laclede, producing Douglas fir, Cedar, and White Pine woods for export worldwide."
    },
    {
      "cityName": "Lapwai",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population was 1137 at the 2010 census, and it is the seat of government of the Nez Perce Indian Reservation."
    },
    {
      "cityName": "Lava Hot Springs",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the mountainous valley of the Portneuf River on the old route of the Oregon Trail and California Trail, the city has become a popular resort location, noted for its numerous hot springs amenable to bathing and a turbulent inner tube run through part of the town."
    },
    {
      "cityName": "Leadore",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Leadore is an incorporated small town in Lemhi County, Idaho, United States."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lewiston was founded in 1861 in the wake of a gold rush which began the previous year near Pierce, northeast of Lewiston."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Lewiston's main industries are agriculture, paper, and timber products, and light manufacturing."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Ammunition manufacturing maintains a very important and growing presence in Lewiston, being the headquarters of ammunition makers CCI and Speer Bullet."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Lewiston is home to Lewis–Clark State College, a public undergraduate college."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Community events in Lewiston include the Dogwood Festival, Hot August Nights, and the Lewiston Roundup."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Lewiston is located at the confluence of the Snake River and Clearwater River, thirty miles (50 km) upstream and southeast of the Lower Granite Dam."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Dams and locks on the Snake and Columbia Rivers make Lewiston reachable by some ocean-going vessels."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "As of the 2020 census, the population of Lewiston was 34203, up from 31894 in 2010."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The Port of Lewiston is Idaho's only seaport, and is the farthest inland port linked to the Pacific Ocean."
    },
    {
      "cityName": "Lewiston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "The Lewiston-Nez Perce County Airport serves the city by air."
    },
    {
      "cityName": "Lewisville",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lewisville is part of the Idaho Falls Metropolitan Statistical Area."
    },
    {
      "cityName": "Mackay",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town is pronounced \"Mackie\" with the accent on the first syllable."
    },
    {
      "cityName": "Malad",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is named after the nearby Malad River, the name being French for \"sickly\"."
    },
    {
      "cityName": "Malad",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Malad City is located along Interstate 15 on the east side of the Malad Valley 13 miles (21 km) from the Utah/Idaho border."
    },
    {
      "cityName": "Malad",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In 2020 the population was 2299 people."
    },
    {
      "cityName": "McCall",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Named after its founder, Tom McCall, it is situated on the southern shore of Payette Lake, near the center of the Payette National Forest."
    },
    {
      "cityName": "McCammon",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In 1892, McCammon became the junction point between the Oregon Short Line Railroad and Utah and Northern Railway, and city gained the nickname Junction City."
    },
    {
      "cityName": "Meridian",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Meridian is considered the state's fastest-growing city and among the fastest-growing cities in the United States."
    },
    {
      "cityName": "Minidoka",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Over two thirds of the population of Minidoka identify as Hispanic or Latino."
    },
    {
      "cityName": "Montpelier",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was settled in 1863 by Mormon pioneers on the route of the Oregon Trail."
    },
    {
      "cityName": "Montpelier",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nearby to the east is the border with Wyoming."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Moscow is the home of the University of Idaho, the state's land-grant institution and primary research university."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city contains over 60% of the county's population, and whilst the university is Moscow's dominant employer, the city also serves as an agricultural and commercial hub for the Palouse region."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Located in the North Central region of the state along the border with Washington, it had a population of 25435 at the 2020 United States census."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Two major highways serve the city, passing through the city center: US-95 (north-south) and ID-8 (east-west)."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The Pullman–Moscow Regional Airport, four miles (6 km) west, provides limited commercial air service."
    },
    {
      "cityName": "Moscow",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The local newspaper is the Moscow-Pullman Daily News."
    },
    {
      "cityName": "Mountain Home",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Opened in 1943 during World War II, it was originally a bomber training base and later an operational Strategic Air Command bomber and missile base (1953–65)."
    },
    {
      "cityName": "Mountain Home",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "With the addition of the Oregon Short Line Railroad in 1883, the post office was moved downhill and west to the city's present site."
    },
    {
      "cityName": "Mountain Home",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Mountain Home was originally a post office at Rattlesnake Station, a stagecoach stop on the Overland Stage Line, about seven miles (11 km) east of the city, on present-day US-20 towards Fairfield."
    },
    {
      "cityName": "Mountain Home",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Mountain Home Air Force Base, an Air Combat Command installation, is located 12 miles (20 km) southwest of the city."
    },
    {
      "cityName": "Mountain Home",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It switched to Tactical Air Command and fighters in January 1966, which was succeeded by Air Combat Command in 1992."
    },
    {
      "cityName": "Mud Lake",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mud Lake is also home to a large lake (3094.9 acres)."
    },
    {
      "cityName": "Mud Lake",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Since then the population has grown to 419 as seen in the 2020 census."
    },
    {
      "cityName": "Mullan",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The entrance to the Lucky Friday mine is several hundred yards east of the city center; the active mine (silver, lead, & zinc) descends more than six thousand feet (1.1 mi; 1.8 km) below the surface."
    },
    {
      "cityName": "Nampa",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city has a prominent student population, home to the College of Western Idaho and Northwest Nazarene University."
    },
    {
      "cityName": "Nampa",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is Idaho's third-most populous city."
    },
    {
      "cityName": "Nampa",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Nampa is about 20 miles (32 km) west of Boise along Interstate 84, and 6 miles (9.7 km) west of Meridian."
    },
    {
      "cityName": "Nampa",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The name \"Nampa\" may have come from a Shoshoni word meaning 'moccasin' or 'footprint'."
    },
    {
      "cityName": "Nampa",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "According to toponymist William O. Bright, the name comes from the Shoshoni word /nampai/, meaning \"foot\"."
    },
    {
      "cityName": "New Meadows",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the west central part of the state, just south of the 45th parallel, the population was 517 at the 2020 census, up from 496 in 2010."
    },
    {
      "cityName": "New Meadows",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "New Meadows is located at the junction of the primary north–south highway in the state, U S Route 95, and State Highway 55, which connects it with McCall and Boise."
    },
    {
      "cityName": "New Plymouth",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was incorporated on February 15, 1896."
    },
    {
      "cityName": "New Plymouth",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the host of the annual Payette County Fair and rodeo."
    },
    {
      "cityName": "Nezperce",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Nezperce is named for the local Nez Perce tribe of Native Americans."
    },
    {
      "cityName": "Nezperce",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "(\"Nezperce\" derives from a corruption of the French words nez percé, literally \"pierced nose.\") There is one school district, Nezperce School District #302."
    },
    {
      "cityName": "Oldtown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Many homes are located in the south end on the other side of the railroad, as the Pend Oreille is somewhat further away here."
    },
    {
      "cityName": "Oldtown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Oldtown is squeezed between this boundary to the west and the river to the east, leaving the main business district on U S Route 2 with only 700 feet (210 meters) of space in which to operate on the Idaho side."
    },
    {
      "cityName": "Oldtown",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "There are no natural or physical barriers, and it is strictly a political division, separated by the straight-line state boundary."
    },
    {
      "cityName": "Onaway",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name sources from the mill works at nearby Potlatch to the west, as workers would frequent the bars after work."
    },
    {
      "cityName": "Onaway",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "When a wife called and asked where her husband was she would be told he was \"Onaway\" home."
    },
    {
      "cityName": "Onaway",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Onaway is located between Potlatch and Princeton on State Highway 6."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Originally the name was two words, Oro Fino, applied to a gold mining camp established in 1861 two miles (3 km) south of Pierce."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nearby is the historical \"Canoe Camp,\" where the Lewis and Clark expedition built five new dugout canoes and embarked on October 7, 1805, downstream to the Pacific Ocean."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The railroad, later part of the Camas Prairie Railroad, was constructed from Lewiston in 1899."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Each spring, Boomershoot, an annual precision rifle event, is held nearby."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Some four miles (6 km) north is the Dworshak Dam, third-highest dam in the United States, completed in the early 1970s."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Nearby is the Dworshak National Fish Hatchery, started to try to compensate for the loss of migratory fish upstream after the dam was constructed."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "When the United States government opened up the Nez Percé reservation to non-tribal settlers in 1895, thousands of European Americans rushed to lay claims to land."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Clifford Fuller set up a trading post on his new homestead."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The town (Orofino-on-the-Clearwater) was established the next year."
    },
    {
      "cityName": "Orofino",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Orofino is home to state institutions: Idaho State Hospital North and the Idaho Correctional Institution–Orofino."
    },
    {
      "cityName": "Osburn",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the Silver Valley mining region of northern Idaho, its population was 1555 at the 2010 census."
    },
    {
      "cityName": "Oxford",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Oxford was a city in Franklin County, Idaho, United States."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located on the western side of the Bear Lake Valley, the city's population was 541 at the 2020 census."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Paris is the location of the Bear Lake Stake Tabernacle, a sandstone church designed by Joseph Don Carlos Young and built between 1884 and 1889."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Paris was settled on September 26, 1863, by pioneer settlers of the Church of Jesus Christ of Latter-day Saints."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Paris was settled by a group of dedicated Mormons led by Charles C Rich."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "During the early years, pioneers suffered difficulties with the harsh cold climate."
    },
    {
      "cityName": "Paris",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It seats around 1400 people."
    },
    {
      "cityName": "Parma",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city was named after Parma, Italy."
    },
    {
      "cityName": "Peck",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Many residents of Peck work in nearby Orofino, Idaho."
    },
    {
      "cityName": "Peck",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Additionally, Peck residents attend high school in Orofino since Peck does not have a high school."
    },
    {
      "cityName": "Pinehurst",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located at the west end of the Silver Valley mining region, its population was 1619 at the 2010 census."
    },
    {
      "cityName": "Pingree",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pingree is located on Idaho State Highway 39 southwest of Blackfoot and northwest of Pocatello."
    },
    {
      "cityName": "Placerville",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Placerville is a populated place in Boise County, Idaho, United States."
    },
    {
      "cityName": "Pocatello",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pocatello is the county seat of and the largest city in Bannock County, with a small portion on the Fort Hall Indian Reservation in neighboring Power County, containing the city's airport."
    },
    {
      "cityName": "Pocatello",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the principal city of the Pocatello metropolitan area, which encompasses all of Bannock County in the southeastern part of the U.S. state of Idaho.."
    },
    {
      "cityName": "Ponderay",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name of the lake the city sits on, Lake Pend Oreille, is also a corruption of the Pend d'Orielles."
    },
    {
      "cityName": "Ponderay",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Ponderay's city motto is \"Little City with the Big Future\"."
    },
    {
      "cityName": "Ponderay",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its name is an English phonetic spelling of the French words “Pend d'Oreille”, the name of a local indigenous people that live in the region."
    },
    {
      "cityName": "Post Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The population is an estimated 44194 in 2022 according to the U S Census Bureau estimate, making it Idaho's ninth-largest city and the second largest city in North Idaho behind Coeur d’Alene."
    },
    {
      "cityName": "Potlatch",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "On the Palouse north of Moscow, it is served by State Highway 6, and bordered on the northeast by the small community of Onaway."
    },
    {
      "cityName": "Preston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is the seat of government of Franklin County."
    },
    {
      "cityName": "Priest River",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the Idaho Panhandle region of the state, the city is at the mouth of the Priest River on the Pend Oreille River."
    },
    {
      "cityName": "Rathdrum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named after Rathdrum, a village in County Wicklow, Ireland."
    },
    {
      "cityName": "Rathdrum",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Rathdrum is situated at the base of Rathdrum Mountain, which is part of the Selkirk Mountain Range."
    },
    {
      "cityName": "Rexburg",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is home to Brigham Young University–Idaho (BYU-Idaho), a private institution operated by the Church of Jesus Christ of Latter-day Saints (LDS Church)."
    },
    {
      "cityName": "Riggins",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Nestled deep in a canyon at the confluence of the Salmon and Little Salmon rivers in west central Idaho, it is approximately 150 highway miles (240 km) north of Boise, and 120 highway miles (190 km) south-southeast of Lewiston."
    },
    {
      "cityName": "Riggins",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "U S Route 95, the only highway for the state connecting the Panhandle to the south, runs through Riggins as Main Street."
    },
    {
      "cityName": "Rupert",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rupert is the county seat and largest city of Minidoka County, Idaho, United States."
    },
    {
      "cityName": "Sagle",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sagle has an elementary school that lies on Sagle Road, just off the main highway."
    },
    {
      "cityName": "Sagle",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The mascot of Sagle Elementary is the Hawks."
    },
    {
      "cityName": "Sagle",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Sagle area has recently seen an expansion of businesses and commerce as it lies close to the population base in Sandpoint, features major highway frontage, and has fewer regulations and restrictions than nearby Sandpoint."
    },
    {
      "cityName": "Saint Charles",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population was 161 at the 2020 census, up from 131 in 2010."
    },
    {
      "cityName": "Saint Maries",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its population was 2357 at the 2020 census, down from 2402 in 2010."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is home to Schweitzer Mountain Resort, Idaho's largest ski resort, and is on the International Selkirk Loop and two National Scenic Byways (Wild Horse Trail and Pend Oreille Scenic Byway)."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Sandpoint lies on the shores of Idaho's largest lake, 43-mile-long (69-kilometer) Lake Pend Oreille, and is surrounded by three major mountain ranges, the Selkirk, Cabinet and Bitterroot ranges."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As the largest service center in the two northern Idaho counties (Bonner and Boundary), as well as northwestern Montana, it has an active retail sector."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Sandpoint's major economic contributors include forest products, light manufacturing, tourism, recreation and government services."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Among other distinctions awarded by national media in the past decade, in 2011 Sandpoint was named the nation's \"Most Beautiful Small Town\" by Rand McNally and USA Today."
    },
    {
      "cityName": "Sandpoint",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Its population was 9777 as of the 2022 census."
    },
    {
      "cityName": "Shelley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Since 1927 Shelley has been home to the \"Idaho Annual Spud Day\", which is celebrated on the 3rd Saturday of September."
    },
    {
      "cityName": "Shelley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It typically features a parade, live bands, a Spud Tug, a spud-picking Contest, and free baked potatoes."
    },
    {
      "cityName": "Shoshone",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In contrast to the Shoshone Native American tribe for which it is named, the city's name is correctly pronounced \"Show-shown\", with a silent \"e\"."
    },
    {
      "cityName": "Smelterville",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town was named in 1929 by a voice vote of its residents; the other choices were Van Rena and Silver City (already used in southwestern Idaho)."
    },
    {
      "cityName": "Smelterville",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The presence of the Bunker Hill smelter, which started operating in 1917, caused the name to be selected."
    },
    {
      "cityName": "Soda Springs",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the 1860s, Soda Springs served as the seat of Oneida County."
    },
    {
      "cityName": "Soda Springs",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its population was 3133 at the time of the 2020 census."
    },
    {
      "cityName": "Spencer",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It serves as the base for the state's opal mine and is called the \"Opal Capital of America\": the mine proper is located 5–6 miles outside of town."
    },
    {
      "cityName": "Spencer",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Spencer is an incorporated hamlet in Clark County, Idaho, United States."
    },
    {
      "cityName": "Stanley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The center of population of Idaho in 2000 was located in Stanley."
    },
    {
      "cityName": "Star",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named in the 19th century by travelers on their way to Middleton and Boise who used the star on the school house to find east and west."
    },
    {
      "cityName": "Star",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name stuck and it became Star, Idaho."
    },
    {
      "cityName": "Star",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Today, it is a rapidly growing suburb of Boise and its schools are shared with Middleton School District and West Ada School District."
    },
    {
      "cityName": "State Line",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Stateline, officially the City of State Line, and historically known as State Line Village, is a city in Kootenai County, Idaho, United States, and is both the easternmost suburb of Spokane, Washington and the westernmost suburb of Coeur d'Alene, Idaho."
    },
    {
      "cityName": "State Line",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is known for the adult services it provides which attract business from nearby Spokane and Coeur d'Alene."
    },
    {
      "cityName": "Stites",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the lower canyon of the South Fork of the Clearwater River, it is about four miles (6 km) upstream and south of Kooskia on State Highway 13."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Among skiers, the term \"Sun Valley\" refers to the alpine ski area, which consists of Bald Mountain, the main ski mountain adjacent to Ketchum."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Dollar Mountain, which is adjacent to Sun Valley, is suited for novice and lower intermediate skiers."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The term \"Sun Valley\" is used more generally to speak of the region surrounding the city, including the neighboring city of Ketchum and the Wood River Valley area winding south to Hailey and Bellevue."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Visitors are relatively close to the Sawtooth National Recreation Area, accessed over Galena Summit on State Highway 75, the Sawtooth Scenic Byway."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Bald Mountain, or \"Baldy\", best suited for intermediate to advanced and expert skiers, has a summit of 9150 feet (2790 m) and a vertical drop of 3400 feet (1035 m)."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The treeless \"Dollar\" at 6638 feet (2023 m) has a moderate vertical drop of 628 feet (191 m)."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The region has been a seasonal home to the rich and famous since first being brought to public attention by Ernest Hemingway in the late 1930s."
    },
    {
      "cityName": "Sun Valley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Scheduled passenger airline service is available at Friedman Memorial Airport (SUN) in Hailey, approximately fifteen miles (25 km) south."
    },
    {
      "cityName": "Tensed",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is within the Coeur d'Alene Reservation, and is accessed by U S Route 95, the state's primary north–south highway."
    },
    {
      "cityName": "Troy",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the eastern part of the Palouse region, its population was 862 at the 2010 census."
    },
    {
      "cityName": "Twin Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located on a broad plain at the south rim of the Snake River Canyon, Twin Falls is where daredevil Evel Knievel attempted to jump across the canyon in 1974 on a steam-powered rocket."
    },
    {
      "cityName": "Twin Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The border town resort community of Jackpot, Nevada, 50 mi (80 km) south at the state line, is unofficially considered part of the greater Twin Falls area."
    },
    {
      "cityName": "Twin Falls",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The jump site is northeast of central Twin Falls, midway between Shoshone Falls and the Perrine Bridge."
    },
    {
      "cityName": "Ucon",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ucon was first settled in 1883."
    },
    {
      "cityName": "Victor",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Nearby Teton Pass is accessed south from Victor on State Highway 33, which continues east of the state border as Wyoming Highway 22 to Jackson Hole."
    },
    {
      "cityName": "Wallace",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Founded in 1884, Wallace sits alongside the South Fork of the Coeur d'Alene River (and Interstate 90)."
    },
    {
      "cityName": "Wallace",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town's population was 791 at the 2020 census."
    },
    {
      "cityName": "Wallace",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Trail of the Coeur d'Alenes rail trail passes through Wallace."
    },
    {
      "cityName": "Wardner",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located in the Silver Valley mining region, the population was 188 at the 2010 census, down from 215 in 2000."
    },
    {
      "cityName": "Weippe",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In September 1805, the starving Lewis and Clark Expedition first met the Nez Perce on the Weippe Prairie, south of the city."
    },
    {
      "cityName": "Weiser",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city sits at the confluence of the Weiser River with the Snake River, which marks the border with Oregon."
    },
    {
      "cityName": "Weiser",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city supports farm, orchard, and livestock industries."
    },
    {
      "cityName": "Weston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community was so named due to its location at the west bank of the Bear River."
    },
    {
      "cityName": "Weston",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was first settled in 1865."
    },
    {
      "cityName": "Wilder",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Wilder is part of the Boise City–Nampa, Idaho Metropolitan Statistical Area."
    },
    {
      "cityName": "Winchester",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Winchester Lake State Park lies south of the city."
    },
    {
      "cityName": "Worley",
      "state": "ID",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is within the Coeur d'Alene Indian Reservation."
    }
  ]
}