{
  "facts": [
    {
      "cityName": "Aberdeen",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Aberdeen is a city located in Harford County, Maryland, United States, 26 miles (42 km) northeast of Baltimore."
    },
    {
      "cityName": "Aberdeen",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Aberdeen is the largest municipality in Harford County."
    },
    {
      "cityName": "Abingdon",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies 25 miles (40 km) northeast of Baltimore on Maryland Route 7, near the Bush River, between Exits 77 and 80 of Interstate 95."
    },
    {
      "cityName": "Abingdon",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Abingdon's location, combined with its historical roots and modern amenities, makes it an appealing place to live for those seeking a balance between suburban comfort and easy access to urban conveniences."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "An accident is an unintended and usually undesirable event that is not deliberately caused by humans."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The term usually implies the presence of unrecognized or unaddressed risks."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Many researchers and professionals in injury prevention discourage the use of the word accident, instead emphasizing preventable factors that increase risk and worsen outcomes."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "For example, while a tree falling in a windstorm may not involve human intention, factors such as its condition, placement, or maintenance may contribute to the outcome."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "An “accident” suggests there is no fault, no guilt, no control, and that the situation was unpreventable and could not have been anticipated."
    },
    {
      "cityName": "Accident",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Similarly, most road collisions stem from risky behaviour or preventable circumstances rather than being truly \"accidental\", a perception strengthened in the mid-20th century due to automobile industry influence through media."
    },
    {
      "cityName": "Accokeek",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a part of the Washington metropolitan area."
    },
    {
      "cityName": "Adelphi",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Adelphi includes the following subdivisions; Adelphi, Adelphi Park, Adelphi Hills, Adelphi Terrace, Adelphi Village, Buck Lodge, Chatham, Cool Spring Terrace, Hillandale Forest, Holly Hill Manor, Knollwood, Lewisdale, and White Oak Manor."
    },
    {
      "cityName": "Andrews Afb",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Prince George's County is located in the U.S. state of Maryland bordering the eastern portion of Washington, D.C."
    },
    {
      "cityName": "Andrews Afb",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the most populous African American-majority county in the United States, as well as the second most affluent African American-majority county behind neighboring Charles County."
    },
    {
      "cityName": "Annapolis",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Annapolis is the capital of the U.S. state of Maryland."
    },
    {
      "cityName": "Annapolis",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Situated on the Chesapeake Bay at the mouth of the Severn River, 25 miles (40 km) south of Baltimore and about 30 miles (50 km) east of Washington, D.C., Annapolis forms part of the Baltimore–Washington metropolitan area."
    },
    {
      "cityName": "Arnold",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located 18.78 miles south of Baltimore, and 29.97 miles east of Washington, D.C."
    },
    {
      "cityName": "Arnold",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Neighborhoods straddle College Parkway and Maryland Route 2."
    },
    {
      "cityName": "Arnold",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Arnold is located on the scenic Broadneck Peninsula."
    },
    {
      "cityName": "Arnold",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It is bordered by Severna Park to the northwest, Cape Saint Claire to the southeast, Annapolis to the southwest, and Lake Shore to the northeast."
    },
    {
      "cityName": "Ashton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The commercial center of Ashton lies at the junction of Route 108 and New Hampshire Avenue."
    },
    {
      "cityName": "Ashton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The etymology of Ashton is unclear, as some longtime residents claim that it comes from reference to a large ash tree that stood at the junction of routes 108 and 650."
    },
    {
      "cityName": "Ashton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Others have stated that it is a portmanteau of the names of two Thomas family homes, Ashland and Clifton, each located one mile from the junction."
    },
    {
      "cityName": "Aspen Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located 6 miles north of Washington D.C."
    },
    {
      "cityName": "Ballenger Creek",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a part of the Frederick, Maryland urban area and is adjacent to Frederick's southern city limits."
    },
    {
      "cityName": "Baltimore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Baltimore, also known as Baltimore City, is the most populous city in the U.S. state of Maryland."
    },
    {
      "cityName": "Baltimore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is also part of the Washington–Baltimore combined statistical area, which had a population of 9.97 million in 2020."
    },
    {
      "cityName": "Baltimore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Baltimore was designated as an independent city by the Constitution of Maryland in 1851."
    },
    {
      "cityName": "Baltimore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Though not located under the jurisdiction of any county in the state, it forms part of the Central Maryland region together with the surrounding county that shares its name."
    },
    {
      "cityName": "Barnesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Barnesville is a town in Montgomery County, Maryland, United States."
    },
    {
      "cityName": "Belcamp",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The term \"Riverside\" is generally used interchangeably with \"Belcamp\"; both names are accepted for the U.S. Postal Service's ZIP Code of 21017."
    },
    {
      "cityName": "Beltsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community was named for Truman Belt, a local landowner."
    },
    {
      "cityName": "Bennsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The area is not an official postal designation, but is part of the Waldorf or Pomfret postal area."
    },
    {
      "cityName": "Bennsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Bennsville area is growing with new residential development, encouraged by the extension in the 1990s of Maryland Route 228 which provides quick access to Maryland Route 210."
    },
    {
      "cityName": "Bennsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bennsville has experienced the 2006 opening of North Point High School and the straightening of Middletown Road in 2008."
    },
    {
      "cityName": "Berlin",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Berlin is a town in Worcester County, Maryland, United States which includes its own historical Berlin Commercial District."
    },
    {
      "cityName": "Berlin",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Berwyn Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Berwyn Heights is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Berwyn Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by College Park to the west, Greenbelt to the northeast, and Riverdale Park to the south."
    },
    {
      "cityName": "Bethesda",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located just northwest of Washington, D.C., it is a major business and government center of the Washington metropolitan region and a national center for medical research."
    },
    {
      "cityName": "Bethlehem",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bethlehem is a populated place in Caroline County, Maryland, United States."
    },
    {
      "cityName": "Bethlehem",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Bethlehem is located at the intersection of Maryland routes 331 and 578, northwest of Preston."
    },
    {
      "cityName": "Big Pool",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is between Clear Spring, Maryland and Hancock, Maryland along Interstate 70 and is officially a part of the Hagerstown Metropolitan Area."
    },
    {
      "cityName": "Bishopville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bishopville is a town in Lee County, South Carolina, United States."
    },
    {
      "cityName": "Bladensburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bladensburg is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Bladensburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Areas in Bladensburg are located within ZIP code 20710."
    },
    {
      "cityName": "Bladensburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bladensburg is 8.6 miles (13.8 km) from Washington, D.C."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bolton Hill is a neighborhood in Baltimore, Maryland, with 20 blocks of mostly preserved buildings from the late 19th century."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is listed on the National Register of Historic Places, preserved as a Baltimore City Historic District, and included within the boundaries of Baltimore National Heritage Area."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The neighborhood is bounded by North Avenue, Mount Royal Avenue, Cathedral Street, Dolphin Street, and Eutaw Place."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Bolton Hill is a largely residential neighborhood with three-story row houses with red brick, white marble steps, and high ceilings."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "There are also larger more ornate originally single-family houses, many houses of worship, parks, monuments, and a few large apartment buildings."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Many significant residents have lived in the neighborhood, including F."
    },
    {
      "cityName": "Bolton Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Scott Fitzgerald, Woodrow Wilson, the Cone sisters, and Florence Rena Sabin."
    },
    {
      "cityName": "Boonsboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Boonsboro is a town in Washington County, Maryland, United States, located at the foot of South Mountain."
    },
    {
      "cityName": "Boonsboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It nearly borders Frederick County and is proximate to the Antietam National Battlefield."
    },
    {
      "cityName": "Bowie",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bowie has grown from a small railroad stop to the largest municipality in Prince George's County; it is also the fifth most populous city and third largest city by area in the U.S. state of Maryland."
    },
    {
      "cityName": "Bowie",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is home to Bowie State University, Maryland's oldest historically black university."
    },
    {
      "cityName": "Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brentwood is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Brentwood is located within 1-mile (1.6 km) of Washington, D.C."
    },
    {
      "cityName": "Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The municipality of Brentwood is located just outside the northeast boundary of the District of Columbia and surrounded by the communities of Mount Rainier, Cottage City, North Brentwood, and the nearby Hyattsville."
    },
    {
      "cityName": "Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Along the Route 1 Corridor, Brentwood is part of the Gateway Arts District."
    },
    {
      "cityName": "Brookeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Brookeville is a town in Montgomery County, Maryland, located 20 km (12 mi) north of Washington, D.C., and 2 km (1.2 mi) north of Olney."
    },
    {
      "cityName": "Brookeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Historically a farming town, Brookeville is now at the northern edge of the densely developed Washington suburbs."
    },
    {
      "cityName": "Brooklandville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The general area is a part of Lutherville, and some addresses in the area are considered to be in Lutherville, though Brooklandville has a postal zone and post office of its own."
    },
    {
      "cityName": "Brooklandville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Some notable landmarks in the area, including the St. Paul's Schools are technically within Brooklandville, as noted by their mailing addresses."
    },
    {
      "cityName": "Brooklandville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "However, addresses within the main office complex in the area, Green Spring Station, are considered to be within Lutherville."
    },
    {
      "cityName": "Brunswick",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city is located on the north bank of the Potomac River; Loudoun County, Virginia occupies the opposite shore."
    },
    {
      "cityName": "Brunswick",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "There are three schools serving Brunswick: Brunswick Elementary School, Brunswick Middle School, and Brunswick High School."
    },
    {
      "cityName": "Burtonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is situated in the northeast corner of Montgomery County, right on the border of both Howard and Prince George's counties."
    },
    {
      "cityName": "Burtonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is considered a suburban town in the Washington, D.C."
    },
    {
      "cityName": "California",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "There are department stores and numerous shopping centers situated along Maryland Highway 235."
    },
    {
      "cityName": "California",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Maryland Route 4 crosses Highway 235 in California, providing access to the narrow Governor Thomas Johnson Bridge and the popular weekend resort town of Solomons on its opposite side."
    },
    {
      "cityName": "California",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Bridge-bound traffic is notorious for backing up during rush hour."
    },
    {
      "cityName": "Callaway",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The elevation is 105 feet (32 m)."
    },
    {
      "cityName": "Cambridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cambridge is the fourth most populous city in Maryland's Eastern Shore region, after Salisbury, Elkton and Easton."
    },
    {
      "cityName": "Cambridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Almost half of Cambridge's residents were African American in 2020."
    },
    {
      "cityName": "Camp Springs",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Camp Springs is not an official post office designation; the area is divided among the surrounding mailing addresses of Temple Hills, Fort Washington, Clinton, and Suitland."
    },
    {
      "cityName": "Capitol Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Capitol Heights is a town in Prince George's County, Maryland, United States, located on the border of both the Northeast & Southeast quadrants of Washington."
    },
    {
      "cityName": "Capitol Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town of Capitol Heights is officially bounded between Southern Avenue NE/SE to the north, Yost Place, and Eastern Avenue NE to the east, the Watts Branch Stream, Brooke Road, and Capitol Heights Boulevard to the south, and Marlboro Pike to the west."
    },
    {
      "cityName": "Capitol Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The zip code of Capitol Heights is 20743."
    },
    {
      "cityName": "Catonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community is a streetcar suburb of Baltimore along the city's western border."
    },
    {
      "cityName": "Catonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is known for its proximity to the Patapsco River and Patapsco Valley State Park, making it a regional mountain biking hub."
    },
    {
      "cityName": "Catonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town is also notable as a local hotbed of music, earning it the official nickname of \"Music City, Maryland.\" Catonsville contains the majority of the University of Maryland, Baltimore County (UMBC), a major public research university with close to 14,000 students."
    },
    {
      "cityName": "Cecilton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cecilton is a town in Cecil County, Maryland, United States."
    },
    {
      "cityName": "Centreville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The ZIP code is 21617 and the area codes are 410 and 443."
    },
    {
      "cityName": "Centreville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The primary local telephone exchange is 758."
    },
    {
      "cityName": "Centreville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It hosts the Queen Anne's County Fair each summer and was home to three franchises during the existence of the Eastern Shore Baseball League—the Colts, Red Sox, and Orioles."
    },
    {
      "cityName": "Charlotte Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Maryland Veterans Home for disabled veterans, is located on the site of the former Charlotte Hall Military Academy."
    },
    {
      "cityName": "Charlotte Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Academy site was declared the Charlotte Hall Historic District, and listed on the National Register of Historic Places in 1975."
    },
    {
      "cityName": "Charlotte Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Since 1940, a sizable Amish farming community has existed nearby, along with numerous strip mall businesses along Maryland Route 5 continuing into the adjacent community of Mechanicsville."
    },
    {
      "cityName": "Charlotte Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "A former large sprawling flea market complex was demolished in 2024."
    },
    {
      "cityName": "Charlotte Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "A U.S. Veterans Affairs clinic is across the highway from the Veterans Home."
    },
    {
      "cityName": "Chesapeake Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chesapeake Beach is a town in Calvert County, Maryland, United States."
    },
    {
      "cityName": "Chesapeake Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its major attractions include the Chesapeake Beach Railway Station, the Chesapeake Beach Rail Trail, a water park, marinas, piers, and charter boat fishing."
    },
    {
      "cityName": "Chesapeake Ranch Estates",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Chesapeake Ranch Estates (CRE), also known locally as the Ranch Club, is located in Lusby, Maryland, United States, in southern Calvert County."
    },
    {
      "cityName": "Chesapeake Ranch Estates",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "CRE was founded in 1958 and is governed by a homeowners' association, which is officially called the \"Property Owner's Association of the Chesapeake Ranch Estates\" (POACRE)."
    },
    {
      "cityName": "Chesapeake Ranch Estates",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Today, CRE is composed of over 4,000 homes."
    },
    {
      "cityName": "Chesapeake Ranch Estates-Drum Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The communities are only a few minutes from the popular weekend resort town Solomons as well as the Calvert Cliffs Nuclear Power Plant, Calvert Cliffs State Park and fossil grounds, and the Dominion Cove Point liquefied natural gas terminal."
    },
    {
      "cityName": "Chestertown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chestertown is a town in Kent County, Maryland, United States."
    },
    {
      "cityName": "Cheverly",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cheverly is a town in Prince George's County, Maryland, United States, located very close to Washington, D.C., though not bordering it directly."
    },
    {
      "cityName": "Cheverly",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Cheverly borders the communities of Tuxedo, Chapel Oaks, Landover, Landover Hills, Villa Heights, and Bladensburg."
    },
    {
      "cityName": "Chevy Chase",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Most of these derive from a late-19th-century effort to create a new suburb that its developer dubbed Chevy Chase after a colonial land patent."
    },
    {
      "cityName": "Chevy Chase Section Three",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Most of these derive from a late-19th-century effort to create a new suburb that its developer dubbed Chevy Chase after a colonial land patent."
    },
    {
      "cityName": "Chevy Chase View",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Chevy Chase View is a town in Montgomery County, Maryland, United States."
    },
    {
      "cityName": "Church Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Church Hill is a town in Queen Anne's County, Maryland, United States."
    },
    {
      "cityName": "Clarksburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located at the northern end of the Interstate 270 technology corridor, approximately four miles north of Germantown."
    },
    {
      "cityName": "Clarksville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community is named for William Clark, a farmer who owned much of the land on which the community now lies and served as a postal stop that opened on the 4th of July 1851."
    },
    {
      "cityName": "Clear Spring",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Clear Spring is a town in Washington County, Maryland, United States."
    },
    {
      "cityName": "Clinton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Clinton was formerly known as Surrattsville until after the time of the Civil War, and Robeystown from 1865 to 1878."
    },
    {
      "cityName": "Clinton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Clinton is historically known for its role in the American Civil War concerning the Abraham Lincoln assassination."
    },
    {
      "cityName": "Clinton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Clinton is adjacent to Camp Springs, Rosaryville, Melwood, and Andrews Air Force Base."
    },
    {
      "cityName": "Coldstream Homestead Montebello",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Coldstream-Homestead-Montebello community, often abbreviated to C-H-M, is a neighborhood in northeastern Baltimore, Maryland."
    },
    {
      "cityName": "Coldstream Homestead Montebello",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A portion of the neighborhood has been listed on the National Register of Historic Places as the Coldstream Homestead Montebello Historic District, recognized for the development of a more suburban style of rowhouses."
    },
    {
      "cityName": "College Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "College Park is a city in Prince George's County, Maryland, United States, located approximately four miles (6.4 km) from the northeast border of Washington, D.C."
    },
    {
      "cityName": "College Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the home of the University of Maryland, College Park."
    },
    {
      "cityName": "Colmar Manor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Colmar Manor is a town located in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Colmar Manor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "As the town developed at the beginning of the 20th century, it assumed a name derived from its proximity to the District of Columbia—the first syllable of Columbia and that of Maryland were combined to form \"Colmar\"."
    },
    {
      "cityName": "Columbia",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Columbia is a planned community in Howard County, Maryland, United States, consisting of 10 self-contained villages."
    },
    {
      "cityName": "Columbia",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Columbia proper consists only of territory governed by the Columbia Association, a not-for-profit management company."
    },
    {
      "cityName": "Conowingo",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Conowingo is a community in northwestern Cecil County, Maryland, United States."
    },
    {
      "cityName": "Conowingo",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community replaced a previous one that was inundated by a reservoir."
    },
    {
      "cityName": "Cottage City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cottage City, officially the Town of Cottage City, is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Cottage City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Cottage City is a small, quiet community lying between Eastern Avenue, Brentwood, Colmar Manor, and the Anacostia River."
    },
    {
      "cityName": "Cottage City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Cottage City was developed, beginning in 1870, under the name of \"The Highlands\"."
    },
    {
      "cityName": "Cresaptown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cresaptown's post office was established December 22, 1800."
    },
    {
      "cityName": "Cresaptown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Cresaptown is located 6 miles (10 km) southwest of Cumberland."
    },
    {
      "cityName": "Crisfield",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Crisfield is a city in Somerset County, Maryland, United States, located on the Tangier Sound, an arm of the Chesapeake Bay."
    },
    {
      "cityName": "Crisfield",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Cross Country",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Maryland Terrapins, commonly referred to as the Terps, consist of 19 men's and women's varsity intercollegiate athletic teams that represent the University of Maryland, College Park in National Collegiate Athletic Association (NCAA) Division I competition."
    },
    {
      "cityName": "Cross Country",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Maryland was a founding member of the Southern Conference in 1921, a founding member of the Atlantic Coast Conference in 1952, and a member of the Big Ten Conference since 2014."
    },
    {
      "cityName": "Crownsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It hosts the Anne Arundel County Fair each September, as well as the annual Maryland Renaissance Festival for several summer weekends."
    },
    {
      "cityName": "Crownsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A state psychiatric hospital was formerly in Crownsville."
    },
    {
      "cityName": "Crownsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The area offers waterfront scenery and easy access to urban metropolitan areas and culture."
    },
    {
      "cityName": "Cumberland",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located on the Potomac River, Cumberland is a regional business and commercial center for Western Maryland and the Potomac Highlands of West Virginia."
    },
    {
      "cityName": "Cumberland",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the primary city of the Cumberland micropolitan area, which had 95,044 residents in 2020."
    },
    {
      "cityName": "Damascus",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Damascus is located at the intersection of three major roads in upper Montgomery County: Ridge Road, Damascus Road and Woodfield Road."
    },
    {
      "cityName": "Darnestown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Seneca Creek borders portions of its north and west sides."
    },
    {
      "cityName": "Darnestown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "is about 22 miles (35 km) to the southeast."
    },
    {
      "cityName": "Davidsonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a semi-rural community composed mostly of farms and suburban-like developments and is a good example of an \"exurb.\" Davidsonville has relatively little commercial development and no high-density housing."
    },
    {
      "cityName": "Davidsonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The community is generally not served by public water, sewer or natural gas utilities, so homes generally employ well-and-septic systems."
    },
    {
      "cityName": "Davidsonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The nominal, if not geographic, center of Davidsonville is the intersection of Maryland routes 424 and 214, located at 38.9229°N 76.6284°W."
    },
    {
      "cityName": "Davidsonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Davidsonville Historic District was listed on the National Register of Historic Places in 1992."
    },
    {
      "cityName": "Deale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has a scenic view of Chesapeake Bay and is popular with boaters."
    },
    {
      "cityName": "Deale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Sudley was listed on the National Register of Historic Places in 1973."
    },
    {
      "cityName": "Delmar",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Delmar is a town in Wicomico County, Maryland, United States."
    },
    {
      "cityName": "Delmar",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Delmar",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "When the population is added to Delmar, Delaware, the town's total population is 4,600."
    },
    {
      "cityName": "Denton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Denton is a town in Caroline County, Maryland, United States."
    },
    {
      "cityName": "Derwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies just north of Rockville, southeast of Gaithersburg, southwest of Olney, and northwest of the greater Silver Spring area."
    },
    {
      "cityName": "Derwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Derwood was originally \"Deer Park\" and was then \"Deer Wood\" before getting its current name."
    },
    {
      "cityName": "District Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "For more information, see the separate articles on Forestville and Suitland."
    },
    {
      "cityName": "Dowell",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city once had its own zip code, that being 20629, but it was changed to 20688, shared with Solomons."
    },
    {
      "cityName": "Dowell",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Solomons now encompasses the entirety of the Dowell peninsula."
    },
    {
      "cityName": "Dundalk",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after the town of Dundalk in County Louth, Ireland."
    },
    {
      "cityName": "Dundalk",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Dundalk is considered one of the first inner-ring suburbs of Baltimore."
    },
    {
      "cityName": "Easton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The primary ZIP Code is 21601, and the secondary is 21606."
    },
    {
      "cityName": "Easton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The primary phone exchange is 822, the auxiliary exchanges are 690, 819, 820, 763, and 770, and the area code is 410."
    },
    {
      "cityName": "Eden",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Eden zip code (21822) also includes parts of Wicomico and Worcester counties."
    },
    {
      "cityName": "Eden",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Edgemere",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Founded in 1899 as Edgemere being renamed from previous name \"Fitzell\"."
    },
    {
      "cityName": "Edgemere",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Meeting held at the Fitzell Farm which was situated where the old Rheem plant was located."
    },
    {
      "cityName": "Eldorado",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "El Dorado is a mythical city of gold supposedly located somewhere in South America."
    },
    {
      "cityName": "Eldorado",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The king of this city was said to be so rich that he would cover himself from head to foot in gold dust – either daily or on certain ceremonial occasions – before diving into a sacred lake to wash it off."
    },
    {
      "cityName": "Eldorado",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The legend was first recorded in the 16th century by Spanish colonists in the Americas; they referred to the king as el Dorado, the Golden One, a name which eventually came to be applied to the city itself."
    },
    {
      "cityName": "Elkridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Founded early in the 18th century, Elkridge is adjacent to two other counties, Anne Arundel and Baltimore."
    },
    {
      "cityName": "Elkton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was formerly called Head of Elk because it sits at the head of navigation on the Elk River, one of the five tributary rivers that flow into the north of the Chesapeake Bay, east of the Susquehanna River and North East River, and north of the Bohemia River, and Sassafras River."
    },
    {
      "cityName": "Elkton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town constitutes part of the Philadelphia metropolitan area."
    },
    {
      "cityName": "Ellerslie",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ellerslie is part of the Cumberland, MD-WV Metropolitan Statistical Area."
    },
    {
      "cityName": "Emmitsburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Emmitsburg is a town in Frederick County, Maryland, United States, 0.3 miles (0.5 km) south of the Mason-Dixon line separating Maryland from Pennsylvania."
    },
    {
      "cityName": "Essex",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Essex history dates back to 1909."
    },
    {
      "cityName": "Fairmount Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fairmount Heights is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "Fairmount Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is composed of six subdivisions: Fairmount Heights (1900), Waterford (1907), Mount Weissner (1909), North Fairmount Heights (1910), West Fairmount Heights (1911) and Sylvan Vista (1923)."
    },
    {
      "cityName": "Fallston",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fallston is a semi-rural community consisting mostly of farms and suburban-like developments."
    },
    {
      "cityName": "Federalsburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Federalsburg is a town in Caroline County, Maryland, United States."
    },
    {
      "cityName": "Federalsburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has one high school, Colonel Richardson High School."
    },
    {
      "cityName": "Fells Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Fells Point is a historic waterfront neighborhood in southeastern Baltimore, Maryland, established around 1763 along the north shore of the Baltimore Harbor and the Northwest Branch of the Patapsco River."
    },
    {
      "cityName": "Fells Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located 1.5 miles east of Baltimore's downtown central business district, Fells Point is known for its maritime history and character."
    },
    {
      "cityName": "Finksburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the location of the National Security Agency's EKMS Central Facility."
    },
    {
      "cityName": "Finksburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Finksburg is located at the intersection of Maryland Routes 91 and 140, on the border of Carroll and Baltimore counties."
    },
    {
      "cityName": "Finksburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is approximately one mile northwest of the Liberty Reservoir and six miles southeast of Westminster."
    },
    {
      "cityName": "Forest Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The main part of town is located at the intersection of Maryland Route 24 and Jarrettsville Road."
    },
    {
      "cityName": "Forest Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Until 1958, this community was served by the Maryland and Pennsylvania Railroad at milepost 30.3."
    },
    {
      "cityName": "Forestville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community is a mixture of garden apartments, single-family homes, and shopping centers built mostly from the 1930s through 1970s, adjacent to the communities of District Heights, Suitland, Morningside, Westphalia and Camp Springs."
    },
    {
      "cityName": "Fort George G Mead Junction",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Potts was a career officer in the United States Army."
    },
    {
      "cityName": "Fort George G Mead Junction",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Appointed as a second lieutenant directly from civilian life in 1867, he served until 1914 and attained the rank of brigadier general."
    },
    {
      "cityName": "Fort George G Mead Junction",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Potts received the Silver Star for heroism during the Spanish–American War, and he was also a veteran of Philippine–American War and Mexican Border War."
    },
    {
      "cityName": "Fort George G Mead Junction",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Potts' commands included the 3rd Field Artillery Regiment, 5th Field Artillery Regiment, US Army Coast Artillery School, Department of the Gulf, Department of Luzon, United States Army Command and General Staff College, Central Division, 4th Brigade, and 7th Brigade."
    },
    {
      "cityName": "Fort Meade",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the home to the National Security Agency, Central Security Service, United States Cyber Command and the Defense Information Systems Agency, which are located on the U.S. Army post Fort George G."
    },
    {
      "cityName": "Fort Washington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It borders the Potomac River, situated 20 miles south of downtown Washington, D.C."
    },
    {
      "cityName": "Fort Washington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Fort Washington community is located west of Maryland Route 210, with some additional area to the east of the highway."
    },
    {
      "cityName": "Frederick",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a part of the Washington metropolitan area and the greater Washington–Baltimore combined statistical area."
    },
    {
      "cityName": "Friendsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Friendsville is a town in Garrett County, Maryland, United States."
    },
    {
      "cityName": "Frostburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located at the head of the Georges Creek Valley, 8 miles (13 km) west of Cumberland."
    },
    {
      "cityName": "Frostburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is one of the first cities on the \"National Road\", US 40, and the western terminus of the Western Maryland Scenic Railroad."
    },
    {
      "cityName": "Frostburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is part of the Cumberland metropolitan area."
    },
    {
      "cityName": "Gaithersburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Gaithersburg is located to the northwest of Washington, D.C., and is considered a suburb and a primary city within the Washington metropolitan area."
    },
    {
      "cityName": "Gambrills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The area was named after Augustine Gambrill, a plantation owner."
    },
    {
      "cityName": "Gambrills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It also borders Davidsonville, Crownsville, Millersville, and Prince George's County, Maryland."
    },
    {
      "cityName": "Garrison",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It consists mainly of the McDonogh area and Valley Centre."
    },
    {
      "cityName": "Germantown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Germantown is located approximately 28 miles (45 km) outside the U.S. capital of Washington, D.C., and is an important part of the Washington metropolitan area."
    },
    {
      "cityName": "Glenham-Belhar",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "This list of Baltimore neighborhoods includes the neighborhoods of Baltimore, Maryland, divided into nine geographical regions: North, Northeast, East, Southeast, South, Southwest, West, Northwest, and Central."
    },
    {
      "cityName": "Glenham-Belhar",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Each district is patrolled by a respective precinct of the Baltimore Police Department."
    },
    {
      "cityName": "Glenmont",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It had a population of 16,710 in 2020."
    },
    {
      "cityName": "Glenn Dale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Glenn Dale is home to the Glenn Dale Hospital, an abandoned sanatorium, and the USDA Plant Introduction Station."
    },
    {
      "cityName": "Goddard",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after the physicist Robert H."
    },
    {
      "cityName": "Grantsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Grantsville is a town in the northern part of Garrett County, Maryland, United States, near the Pennsylvania border."
    },
    {
      "cityName": "Green Haven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Green Haven is a neighborhood located within Pasadena in Anne Arundel County, Maryland, United States."
    },
    {
      "cityName": "Greenbelt",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Greenbelt is a city in Prince George's County, Maryland, United States, and a suburb of Washington, D.C."
    },
    {
      "cityName": "Greensboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Greensboro is a town located on the banks of the Choptank River in Caroline County, Maryland, United States."
    },
    {
      "cityName": "Greensboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The primary phone exchange is 482 and the area code is 410."
    },
    {
      "cityName": "Greensboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town is served by Maryland Routes 480 and 313."
    },
    {
      "cityName": "Gwynn Oak",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Gwynn Oak is north of Liberty Road and east of Rogers Avenue Windsor Mill Road."
    },
    {
      "cityName": "Gwynn Oak",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Nearby neighborhoods include: Woodlawn, Milford Mill, Windsor Mill, and Garwyn Oaks."
    },
    {
      "cityName": "Gwynn Oak",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The western edge of the community lies just outside Woodlawn town center, north-east of Windsor Mill Road where Woodlawn Drive becomes Gwynn Oaks Avenue."
    },
    {
      "cityName": "Gwynn Oak",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The community was home to the Gwynn Oak Amusement Park, now Gwynn Oak Park."
    },
    {
      "cityName": "Halethorpe",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is bordered by the main portion of Arbutus to the north, Baltimore to the North East, Elkridge to the South West, and Linthicum to the East."
    },
    {
      "cityName": "Halethorpe",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is southeast of the University of Maryland, Baltimore County."
    },
    {
      "cityName": "Halfway",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named due to its location, which is halfway between Hagerstown and Williamsport."
    },
    {
      "cityName": "Halfway",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Halfway is a major suburb in the Hagerstown-Martinsburg, MD-WV, Metropolitan Statistical Area."
    },
    {
      "cityName": "Hampstead",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hampstead is a town in Carroll County in the U.S. state of Maryland."
    },
    {
      "cityName": "Hampton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hampton is often considered a subdivision of the nearby community of Towson and is located just north of Baltimore, about twenty minutes from downtown."
    },
    {
      "cityName": "Hampton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hampton contains residences situated on lots up to several acres in a park-like setting."
    },
    {
      "cityName": "Hampton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community is anchored by its principal landmark, the Hampton National Historic Site."
    },
    {
      "cityName": "Hampton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Towson United Methodist Church is located in Hampton, flanked on the south by I-695 and Goucher College."
    },
    {
      "cityName": "Hancock",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hancock is a town in Washington County, Maryland, United States."
    },
    {
      "cityName": "Hancock",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Western Maryland community is notable for being located at the narrowest part of the state."
    },
    {
      "cityName": "Hancock",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The north–south distance from the Pennsylvania state line to the West Virginia state line is only 1.8 miles (2.9 km) at Hancock."
    },
    {
      "cityName": "Harwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Harwood is a crossroads in Anne Arundel County, Maryland, United States, south of Annapolis on Maryland Route 2."
    },
    {
      "cityName": "Havre de Grace",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Havre de Grace, abbreviated HdG, is a city in Harford County, Maryland, United States."
    },
    {
      "cityName": "Havre de Grace",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is situated at the mouth of the Susquehanna River and the head of Chesapeake Bay."
    },
    {
      "cityName": "Havre de Grace",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is named after the port city of Le Havre, France, which in full was once Le Havre de Grâce."
    },
    {
      "cityName": "Hereford",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hereford most commonly refers to the stores and residences around Exit 27, off Interstate 83, including Graul's Market, an M&T Bank branch, and an Exxon gas station."
    },
    {
      "cityName": "Hereford",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Mount Carmel Road and York Road act as vital corridors into, out of, and within the Hereford community."
    },
    {
      "cityName": "Hereford",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Hereford is best known for its unique microclimate which differs significantly from other Baltimore County communities."
    },
    {
      "cityName": "Hereford",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Addresses in Hereford are listed as being in Parkton, which also encompasses the northern Baltimore County community of Maryland Line."
    },
    {
      "cityName": "Highland Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Highland Beach is a town in Anne Arundel County, Maryland, United States."
    },
    {
      "cityName": "Highland Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town was founded late in the 19th century by affluent African Americans from Washington, D.C., and Baltimore, looking for a summer retreat on the Chesapeake Bay."
    },
    {
      "cityName": "Highland Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Celebrities with homes there have included historian and author Alex Haley, actor and comedian Bill Cosby, and tennis champion Arthur Ashe."
    },
    {
      "cityName": "Highland Beach",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Street names in the town include Crummell, Dunbar, Henson, Augusta, Douglass, Langston, and Washington, which were chosen to honor leading African Americans."
    },
    {
      "cityName": "Hillandale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hillandale is contained between the Prince George's / Montgomery County line to the east, the Anacostia River to the west, McCeney Avenue to the north, and D.C.'s Capital Beltway to the south."
    },
    {
      "cityName": "Hillandale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It borders the communities of Adelphi, Avenel, White Oak and Beltsville."
    },
    {
      "cityName": "Hillcrest Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "For mailing address purposes, it is part of the community of Temple Hills and is also near Suitland."
    },
    {
      "cityName": "Hillsboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hillsboro may refer to several places:"
    },
    {
      "cityName": "Hollywood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named in 1867, when a storeowner at Thompson's General Store near the Uniontown section of Hollywood required a name for the post office inside the store."
    },
    {
      "cityName": "Hollywood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The storeowner was inspired by the gigantic holly tree planted in front of the store and named the post office Hollywood."
    },
    {
      "cityName": "Howard Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Howard County is located in the U.S. state of Maryland."
    },
    {
      "cityName": "Howard Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Howard County is part of the Baltimore metropolitan area."
    },
    {
      "cityName": "Hughesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Truman's Place was listed on the National Register of Historic Places in 1988."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies just north of the city of Baltimore, along York Road, parallel to Interstate 83."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The nearby Loch Raven Reservoir is an important landmark and drinking water resource."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its surrounding forested watershed is one of three reservoirs established for the City of Baltimore."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Hunt Valley is located at a latitude of 39.5° North and longitude of 76.7° West."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It is served by the Cockeysville post office, and is also a neighbor of Timonium."
    },
    {
      "cityName": "Hunt Valley",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "A satellite campus of the Community College of Baltimore County, one of the three supplemental campuses of CCBC, uses a leased building located at 11101 McCormick Road, a business park in Hunt Valley, Maryland."
    },
    {
      "cityName": "Huntingtown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Many large estate homes have recently been built in small developments off routes 2/4."
    },
    {
      "cityName": "Huntingtown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has a public high school called Huntingtown High."
    },
    {
      "cityName": "Huntingtown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Calverton School is located just south of the town center."
    },
    {
      "cityName": "Huntingtown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "State-operated commuter buses and private vanpools carry residents to Washington."
    },
    {
      "cityName": "Hurlock",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Hurlock is a town in Dorchester County, Maryland, United States."
    },
    {
      "cityName": "Hyattsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is an urban suburb of Washington, D.C."
    },
    {
      "cityName": "Idlewylde",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Idylwylde is a residential neighbourhood in south east Edmonton, Alberta, Canada."
    },
    {
      "cityName": "Ijamsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town was founded by Plummer Ijams, a descendant of Welsh immigrants, from whom the town took its name."
    },
    {
      "cityName": "Ijamsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The discovery of high-quality slate in the area led to Ijamsville's brief era as a mining town, which lasted until it transitioned to agriculture in the mid-1800s."
    },
    {
      "cityName": "Ijamsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In the mid-to-late 20th century, large quantities of land in Ijamsville were purchased by developers, and the town became primarily residential as a suburb of Frederick, Baltimore, and D.C."
    },
    {
      "cityName": "Ilchester",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named after the village of Ilchester in the English county of Somerset."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Indian Head is a town in Charles County, Maryland, United States."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It has been the site of a naval base specializing in gun and rocket propellants since 1890."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Production of nitrocellulose and smokeless powder began at the Indian Head Powder Factory in 1900."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The name of the base has varied over the years from Indian Head Proving Ground, to Naval Powder Factory, to Naval Propellant Plant, to Naval Ordnance Station, to the present Naval Support Facility Indian Head."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The facility's main tenant activity is the Indian Head Naval Surface Warfare Center (NSWC/IH)."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Advanced research in energetic systems takes place at NSWC/IH."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "NSWC/IH absorbed the function of the closed Naval Ordnance Laboratory, formerly in White Oak."
    },
    {
      "cityName": "Indian Head",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "The base currently employs 3,700 people."
    },
    {
      "cityName": "Jacksonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located at latitude 39°30'59\" North, longitude 76°36'59\" West."
    },
    {
      "cityName": "Jacksonville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The United States Postal Service has assigned Phoenix the ZIP code 21131."
    },
    {
      "cityName": "Joint Base Andrews",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Joint Base Andrews (JBA) is a United States military facility located in Prince George's County, Maryland."
    },
    {
      "cityName": "Joint Base Andrews",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The facility is under the jurisdiction of the United States Air Force (USAF) 316th Wing, Air Force District of Washington (AFDW)."
    },
    {
      "cityName": "Joint Base Andrews",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The base was established in 2009, when Andrews Air Force Base and Naval Air Facility Washington were merged."
    },
    {
      "cityName": "Joppa",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Joppa is a former colonial town and current planning region of Harford County, Maryland, United States."
    },
    {
      "cityName": "Joppa",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The original boundaries of Baltimore County were defined in 1659 and contained all of modern day Baltimore County, Baltimore City, Harford and Cecil counties and parts of Howard, Carroll, Anne Arundel and Kent counties."
    },
    {
      "cityName": "Joppa",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The settlement was named for the Biblical town of Jaffa in the ancient Holy Land of modern-day Israel."
    },
    {
      "cityName": "Joppa",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Joppa's population would decline rapidly thereafter and businesses left for more prosperous environments in the new Baltimore Town."
    },
    {
      "cityName": "Joppatowne",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Serving as a bedroom community for nearby Baltimore, it was established in 1961 as a planned unit development (PUD)."
    },
    {
      "cityName": "Keedysville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Keedysville is a town in Washington County, Maryland, United States."
    },
    {
      "cityName": "Kemp Mill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known for its creekside walkways, calm suburban atmosphere, Brookside Gardens, and numerous hiking trails."
    },
    {
      "cityName": "Kemp Mill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Home to the largest Orthodox Jewish community on the East Coast between Baltimore and Miami, it hosts more than half a dozen synagogues within its boundaries."
    },
    {
      "cityName": "Kemp Mill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is commonly referred to by American Jews as a \"shtetl\"."
    },
    {
      "cityName": "Kensington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kensington is a town in Montgomery County, Maryland, United States."
    },
    {
      "cityName": "Kensington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Greater Kensington encompasses the entire 20895 ZIP code, with a population of 19,753 in 2020."
    },
    {
      "cityName": "Kettering",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Kettering is adjacent to Prince George's Community College, the upscale gated community of Woodmore, Six Flags America, Evangel Temple megachurch, and the community of Largo at the end of the Washington Metro Blue Line."
    },
    {
      "cityName": "Kettering",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Watkins Regional Park in Kettering offers a large playground, a colorful carousel, miniature golf, a miniature train ride, and various animals."
    },
    {
      "cityName": "Knoxville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Robert Clagett Farm and Magnolia Plantation are listed on the National Register of Historic Places."
    },
    {
      "cityName": "La Plata",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "La Plata is a town in Charles County, Maryland, United States."
    },
    {
      "cityName": "La Vale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is part of the Cumberland, MD-WV Metropolitan Statistical Area."
    },
    {
      "cityName": "Langley Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located inside the Capital Beltway, on the northwest edge of Prince George's County, bordering Montgomery County."
    },
    {
      "cityName": "Lanham",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The New Carrollton station as well as an Amtrak station are across the Capital Beltway in New Carrollton, Maryland."
    },
    {
      "cityName": "Lanham",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Doctors Community Hospital is located in Lanham."
    },
    {
      "cityName": "Laurel",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located between Washington, D.C., and Baltimore on the banks of the Patuxent River."
    },
    {
      "cityName": "Laurel",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Founded as a mill town in the early 19th century, Laurel expanded local industry and was later able to become an early commuter town for Washington and Baltimore workers following the arrival of the Baltimore and Ohio Railroad in 1835."
    },
    {
      "cityName": "Laurel",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Largely residential today, the city maintains a historic district centered on its Main Street."
    },
    {
      "cityName": "Laytonsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Laytonsville is a town in Montgomery County, Maryland, United States."
    },
    {
      "cityName": "Leisure World",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is an age-restricted, gated development primarily inhabited by retirees."
    },
    {
      "cityName": "Libertytown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Abraham Jones House was listed on the National Register of Historic Places in 1973."
    },
    {
      "cityName": "Linganore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It consists of the area around Lake Linganore, a residential community governed by a homeowners association, located east of the city of Frederick."
    },
    {
      "cityName": "Linganore",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The mailing address for the area is Lake Linganore, with a ZIP code of 21774."
    },
    {
      "cityName": "Linthicum",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located directly north of Baltimore–Washington International Thurgood Marshall Airport (BWI)."
    },
    {
      "cityName": "Linthicum",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The location is designed \"Linthicum Heights\" by the U.S. Postal Service, with the zip code 21090"
    },
    {
      "cityName": "Loch Raven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Loch Raven is a neighborhood extending from northeast Baltimore to the eastern part of Baltimore County, in Maryland."
    },
    {
      "cityName": "Loch Raven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The major road in the neighborhood is Loch Raven Boulevard, which stretches all the way from the I-695 beltway in Baltimore County to 25th Street in Baltimore City."
    },
    {
      "cityName": "Loch Raven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is located in the Baltimore Metro Area, and is considered one of the longest roads in the area with many different aspects of Baltimore that can be seen by riding through the area."
    },
    {
      "cityName": "Loch Raven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "This region is a diverse, but predominantly African American part of the city and county, and is also the area that consists of a large amount of Morgan State University students."
    },
    {
      "cityName": "Loch Raven",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The zip codes assigned to this area are 21218, 21239, 21286, 21284, and 21234, which is also a Parkville Zip Code."
    },
    {
      "cityName": "Lothian",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "12 miles southwest of Annapolis, 24 miles east of Washington and 31 miles south of Baltimore."
    },
    {
      "cityName": "Luke",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Luke is a town in Allegany County, Maryland, United States, located along the Potomac River just upstream of Westernport."
    },
    {
      "cityName": "Luke",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Known originally as West Piedmont, the town is part of the Cumberland, MD-WV Metropolitan Statistical Area."
    },
    {
      "cityName": "Lusby",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Residents of the Chesapeake Ranch Estates and Drum Point communities also use the Lusby ZIP code designation."
    },
    {
      "cityName": "Lutherville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Within its borders lies the Lutherville Historic District."
    },
    {
      "cityName": "Lutherville-Timonium",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Within its borders lies the Lutherville Historic District."
    },
    {
      "cityName": "Lutherville-Timonium",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Maryland State Fair is held in Timonium each year near Labor Day."
    },
    {
      "cityName": "Marlow Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Marlow Heights Shopping Center first opened in 1957, adjacent to the large community of Hillcrest Heights."
    },
    {
      "cityName": "Marlow Heights",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was joined ten years later, in 1967, by the two-level Iverson Mall, the Washington metropolitan area's first enclosed mall."
    },
    {
      "cityName": "Marlton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Marlton housing development, at first briefly called \"Brandywine Country\", grew up along U.S. Route 301 in the 1970s, and is part of the greater Upper Marlboro community."
    },
    {
      "cityName": "Marlton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Originally made up of only single-family homes, more recently townhouses have been added."
    },
    {
      "cityName": "Marydel",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its name is a portmanteau, after its location, being partially located in Maryland and partially in Delaware."
    },
    {
      "cityName": "Marydel",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Marydel was originally known as Halltown."
    },
    {
      "cityName": "Maryland City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located east of Laurel, just over the border with Prince George's County."
    },
    {
      "cityName": "Maryland City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "When the ZIP Code was created in 1963, United States Postal Service designated a large swath of land in western Anne Arundel County with 20724 \"Laurel\" despite none of 20724 being located in the City of Laurel, which is entirely in Prince George's County."
    },
    {
      "cityName": "Maryland City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Maryland City mostly consists of an older, compact housing development and is adjacent to Fort Meade army base."
    },
    {
      "cityName": "Mayo",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The beach in Mayo used to be a popular weekend resort."
    },
    {
      "cityName": "Mechanicsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is adjacent to the community of Charlotte Hall, which is known for its agriculture, Amish population, and the Maryland Veterans Home."
    },
    {
      "cityName": "Mechanicsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Mechanicsville has many small businesses and restaurants along Maryland Route 5 and Maryland Route 235, as well as an enclosed Amish produce market."
    },
    {
      "cityName": "Mechanicsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community is served by the St. Mary's County Public Schools, including Chopticon High School."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A Middle River Train Station first appeared on the 1877 G.M."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Hopkins & Co Baltimore County Map and by 1898 had a designated Post Office and modest street grid."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town expanded during the 1930s and 1940s and established the \"Aero Acres\" housing community which borders the railroad tracks and Martin Blvd."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "to serve as housing for people working at the Martin Aerospace Company."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "For this development, the architecture firm of Skidmore, Owings & Merrill designed gable-roofed Cape Cod houses with dimensions of 24 feet by 28 feet, featuring large commercial-style windows in their principal rooms."
    },
    {
      "cityName": "Middle River",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "In 1941 a total of 600 homes were built at Aero Acres using this design from Cemento .[2]"
    },
    {
      "cityName": "Middletown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Middletown is a town in Frederick County, Maryland, United States."
    },
    {
      "cityName": "Middletown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Located in the Middletown Valley that stretches between the Catoctin Mountains on the east and South Mountain on the west, the town reportedly gained its name from its location midway between those ranges."
    },
    {
      "cityName": "Monkton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has a population of approximately 4,856 people."
    },
    {
      "cityName": "Montgomery Village",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a large, planned suburban community, developed in the late 1960s and 1970s just outside Gaithersburg's city limits."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The government of the town is led by a mayor and town council."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Morningside Elementary School and Benjamin Foulois Junior High School/Elementary/Creative and Performing Arts Academy (current) as well as Michael J Polley Neighborhood Park are located within the town limits."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Morningside has one of the largest VFW posts (chapters) in the entire country."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Morningside is also the city of license of one of Washington's most prominent radio stations, from the 1960s to the present, WJFK and WPGC-FM."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Additionally, Morningside is home to one of the busiest volunteer fire departments in Prince George's County, Morningside VFD Station 827."
    },
    {
      "cityName": "Morningside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "In 2015, station 827 ran over 8,000 calls for service with 150 working fires in Morningside and the adjacent communities, and has garnered national recognition for their service to the community."
    },
    {
      "cityName": "Mount Airy",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Airy is a town in Carroll and Frederick counties in the U.S. state of Maryland."
    },
    {
      "cityName": "Mount Airy",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of both the Washington Metropolitan Area and Baltimore Metropolitan Area."
    },
    {
      "cityName": "Mount Rainier",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Mount Rainier is a city in Prince George's County, Maryland, United States, bordering Washington D.C."
    },
    {
      "cityName": "Mount Rainier",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Mount Rainier got its start as a streetcar suburb, when tracks were laid for the 82 Streetcar Line."
    },
    {
      "cityName": "Mount Rainier",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Historic U.S. 1 runs through the center of the town and serves as the main street and central business district."
    },
    {
      "cityName": "Mount Vernon",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Myersville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Myersville is a town in Frederick County, Maryland, United States."
    },
    {
      "cityName": "New Carrollton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Carrollton is a city in central Prince George's County, Maryland, 10 miles (16 km) east of Washington, D.C."
    },
    {
      "cityName": "New Market",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Market is a town in Frederick County, Maryland, United States."
    },
    {
      "cityName": "New Market",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town bills itself as the \"Antiques capital of Maryland\"."
    },
    {
      "cityName": "New Windsor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "New Windsor is a town in Carroll County, Maryland, United States."
    },
    {
      "cityName": "New Windsor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is known for having been the residence of Abstract Expressionist painter Clyfford Still during the mid to late 20th century."
    },
    {
      "cityName": "Newark",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Home to the University of Delaware, it is located 8 miles (13 km) west-southwest of Wilmington and 28 miles southwest of Philadelphia."
    },
    {
      "cityName": "Newark",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It constitutes part of the Delaware Valley, and the Philadelphia metropolitan area."
    },
    {
      "cityName": "Newburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Newburg has two stores, a lodge hall, and a fire department, as well as Piccowaxen Middle School and Dr. Thomas L."
    },
    {
      "cityName": "Newburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Higdon Elementary, both serving the entire Cobb Neck peninsula."
    },
    {
      "cityName": "Newburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Newburg also is the northbound terminus of the Harry Nice Memorial Bridge serving U.S. Route 301."
    },
    {
      "cityName": "North Bethesda",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Among its neighborhoods, the centrally located, urbanizing district of White Flint is the commercial and residential hub of North Bethesda."
    },
    {
      "cityName": "North Bethesda",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Pike & Rose development and the Pike District is an initiative of Montgomery County to brand and market this region as \"North Bethesda's Urban Core\"."
    },
    {
      "cityName": "North Bethesda",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The WMATA North Bethesda metro station and Grosvenor-Strathmore metro station serve the region."
    },
    {
      "cityName": "North Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Brentwood is a town in Prince George's County, Maryland, United States."
    },
    {
      "cityName": "North Brentwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The municipality of North Brentwood is located north of Washington and is surrounded by the communities of Brentwood, Hyattsville, and Cottage City, and the nearby Mount Rainier."
    },
    {
      "cityName": "North Chevy Chase",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Most of these derive from a late-19th-century effort to create a new suburb that its developer dubbed Chevy Chase after a colonial land patent."
    },
    {
      "cityName": "North East",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North East is a town in Cecil County, Maryland, United States."
    },
    {
      "cityName": "North East",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located between Philadelphia and Baltimore."
    },
    {
      "cityName": "North Harford Road",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Old Harford Road, one of the oldest continuously used rights-of-way in central Maryland, United States, is a southwest–northeast thoroughfare in northeast Baltimore City and eastern Baltimore County."
    },
    {
      "cityName": "North Kensington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It had a population of 9,497 in 2020."
    },
    {
      "cityName": "North Potomac",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located less than 5 miles (8.0 km) north of the Potomac River, and is about 20 miles (32 km) from Washington, D.C."
    },
    {
      "cityName": "Nottingham",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Its elevation is 62 feet (19 m)."
    },
    {
      "cityName": "Nottingham",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "There is also a historical town in Prince George's County that was named Nottingham - it is now an archeological site."
    },
    {
      "cityName": "Oakland",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is near Deep Creek Lake and the Wisp Ski Resort."
    },
    {
      "cityName": "Ocean City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ocean City, officially the Town of Ocean City, is an Atlantic resort city in Worcester County, Maryland, along the East Coast of the United States."
    },
    {
      "cityName": "Ocean City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "During the summer, Ocean City becomes the second most populated municipality in Maryland, after Baltimore."
    },
    {
      "cityName": "Ocean Pines",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is part of the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Ocean Pines",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It shares the same ZIP code as Berlin."
    },
    {
      "cityName": "Oceans City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ocean City, officially the Town of Ocean City, is an Atlantic resort city in Worcester County, Maryland, along the East Coast of the United States."
    },
    {
      "cityName": "Oceans City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "During the summer, Ocean City becomes the second most populated municipality in Maryland, after Baltimore."
    },
    {
      "cityName": "Odenton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Odenton is located west of Annapolis, south of Baltimore, and northeast of Washington, D.C."
    },
    {
      "cityName": "Olney",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located in the north central part of the county, thirteen miles (21 km) north of Washington, D.C."
    },
    {
      "cityName": "Overlea",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Students attend Overlea High School."
    },
    {
      "cityName": "Overlea",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Area roads include Belair Road and Kenwood Avenue."
    },
    {
      "cityName": "Owings Mills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Owings Mills is home to the northern terminus of the Baltimore Metro Subway, and housed the Owings Mills Mall until its closure in 2015."
    },
    {
      "cityName": "Owings Mills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also home to the Baltimore Ravens' headquarters facility, and the studios for Maryland Public Television."
    },
    {
      "cityName": "Owings Mills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In 2008, CNNMoney.com named Owings Mills number 49 of the \"100 Best Places to Live and Launch\"."
    },
    {
      "cityName": "Oxon",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Oxon Hill is a close suburb of Washington, located southeast of the downtown district and east of Alexandria, Virginia."
    },
    {
      "cityName": "Oxon Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Oxon Hill is a close suburb of Washington, located southeast of the downtown district and east of Alexandria, Virginia."
    },
    {
      "cityName": "Oxon Hill-Glassmanor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The combination is arbitrary, and in the mind of most local people there are two separate communities: Oxon Hill and Glassmanor."
    },
    {
      "cityName": "Parkton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It borders southern York County, Pennsylvania, which forms part of the Mason–Dixon line."
    },
    {
      "cityName": "Parkton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The area is mostly agricultural in nature with corn, soy beans, and other industrial use crops being the major plants grown."
    },
    {
      "cityName": "Parole",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It has several major roads intersect at the western edge of the state capital, Annapolis, and it contains the Annapolis Mall, a number of other large shopping centers, and the Anne Arundel Medical Center."
    },
    {
      "cityName": "Patterson Park Neighborhood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Patterson Park is a neighborhood in Baltimore, Maryland, United States."
    },
    {
      "cityName": "Patterson Park Neighborhood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Named for the 137-acre park that abuts its north and east sides, the neighborhood is in the southeast section of Baltimore city, roughly two miles east of Baltimore's downtown district."
    },
    {
      "cityName": "Perryville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Perryville is a town in Cecil County, Maryland, United States."
    },
    {
      "cityName": "Perryville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is located near an exit for Interstate 95, on the north side of the outlet of the Susquehanna River."
    },
    {
      "cityName": "Phoenix",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located at latitude 39°30'59\" North, longitude 76°36'59\" West."
    },
    {
      "cityName": "Phoenix",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The United States Postal Service has assigned Phoenix the ZIP code 21131."
    },
    {
      "cityName": "Pikesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pikesville is just northwest of the Baltimore city limits."
    },
    {
      "cityName": "Pikesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is the northwestern suburb closest to Baltimore."
    },
    {
      "cityName": "Pittsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pittsville is a town in Wicomico County, Maryland, United States."
    },
    {
      "cityName": "Pittsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Pittsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was named for Dr. Hillary R."
    },
    {
      "cityName": "Pittsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pitts, president of the Worcester & Pocomoke Railroad ca 1868-1870."
    },
    {
      "cityName": "Pocomoke City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pocomoke City, dubbed \"the friendliest town on the Eastern Shore\", is a city in Worcester County, Maryland, United States."
    },
    {
      "cityName": "Pocomoke City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Although renamed in a burst of civic enthusiasm in 1878, the city is regularly referred to by its inhabitants simply as Pocomoke."
    },
    {
      "cityName": "Pocomoke City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is part of the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Pocomoke City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Pocomoke City is a center for commerce on the lower shore, home to an industrial park currently playing host to defense contractors, aerospace engineering, and plastics fabrication."
    },
    {
      "cityName": "Pocomoke City",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Pocomoke City is located near the Wallops Island Flight Facility in Wallops Island, Virginia."
    },
    {
      "cityName": "Poolesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Poolesville is a U.S. town in the western portion of Montgomery County, Maryland."
    },
    {
      "cityName": "Poolesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is surrounded by the Montgomery County Agricultural Reserve, and is considered a distant bedroom community for commuters to Washington, D.C."
    },
    {
      "cityName": "Port Deposit",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Deposit is a town in Cecil County, Maryland, United States."
    },
    {
      "cityName": "Port Deposit",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located on the east bank of the Susquehanna River near its discharge into the Chesapeake Bay."
    },
    {
      "cityName": "Port Tobacco Village",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Port Tobacco, officially Port Tobacco Village, is a town in Charles County, Maryland, United States."
    },
    {
      "cityName": "Potomac",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named after the nearby Potomac River."
    },
    {
      "cityName": "Potomac",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A part of the Washington metropolitan area, many Potomac residents work in nearby Washington, D.C., and Northern Virginia."
    },
    {
      "cityName": "Princess Anne",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is included in the Salisbury, Maryland–Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Princess Anne",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is home to the University of Maryland Eastern Shore and the Teackle Mansion."
    },
    {
      "cityName": "Queen Anne",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Queen Anne is a town in Queen Anne's and Talbot counties in the U.S. state of Maryland."
    },
    {
      "cityName": "Queenstown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Queenstown is a town in Queen Anne's County, Maryland, United States."
    },
    {
      "cityName": "Randallstown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is named after Christopher and Thomas Randall, two 18th-century tavern-keepers."
    },
    {
      "cityName": "Randallstown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "At that time, Randallstown was a tollgate crossroads on the Liberty Turnpike, a major east–west thoroughfare."
    },
    {
      "cityName": "Randallstown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "In the 1990s, Randallstown transitioned to a majority African American community."
    },
    {
      "cityName": "Reservoir Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located south of Druid Hill Park, north of Bolton Hill, east of Penn-North, and west of Jones Falls."
    },
    {
      "cityName": "Reservoir Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bounded by Druid Park Lake Drive, the Jones Falls Expressway, North Avenue, and McCulloh Street."
    },
    {
      "cityName": "Reservoir Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is contained in the 21217 ZIP code."
    },
    {
      "cityName": "Ridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Bard's Field was listed on the National Register of Historic Places in 1976."
    },
    {
      "cityName": "Ridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is near the southernmost tip of the western shore of Maryland, known as Point Lookout, has bodies of water on both sides, and has two popular seafood restaurants."
    },
    {
      "cityName": "Ridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "A historically black Roman Catholic church is here, which formerly had a parochial school."
    },
    {
      "cityName": "Ridgely",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Ridgely is a town in Caroline County, Maryland, United States."
    },
    {
      "cityName": "Rising Sun",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rising Sun is a town in Cecil County, Maryland, United States."
    },
    {
      "cityName": "Riverdale",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riverdale Park, formerly known and often referred to as Riverdale, is a semi-urban town in Prince George's County, Maryland, United States, a suburb in the Washington, D.C., metropolitan area."
    },
    {
      "cityName": "Riverdale Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riverdale Park, formerly known and often referred to as Riverdale, is a semi-urban town in Prince George's County, Maryland, United States, a suburb in the Washington, D.C., metropolitan area."
    },
    {
      "cityName": "Riverside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Riverside is a neighborhood in Baltimore, Maryland, United States that lies just to the south of the city's Federal Hill, Baltimore."
    },
    {
      "cityName": "Riverside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The neighborhood is centered around Riverside Park (Baltimore) and includes the Baltimore Museum of Industry."
    },
    {
      "cityName": "Riverside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The southwest portion of Riverside corresponds to the Port Covington district under major development, which currently houses The Baltimore Sun, the Under Armour Waterfront HQ Campus, as well as the Cruise Maryland Terminal of the Port of Baltimore."
    },
    {
      "cityName": "Riverside",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Riverside is registered as Riverside Historic District on the National Register of Historic Places."
    },
    {
      "cityName": "Robinwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a part of the Hagerstown Metropolitan Area."
    },
    {
      "cityName": "Robinwood",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Robinwood is home to Hagerstown Community College."
    },
    {
      "cityName": "Rock Hall",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Rock Hall, is a waterfront town located directly on the National Chesapeake Scenic Byway in Kent County, Maryland, United States."
    },
    {
      "cityName": "Rosaryville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "including housing developments and rural open space."
    },
    {
      "cityName": "Rosaryville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was named for a local Roman Catholic church."
    },
    {
      "cityName": "Rosaryville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Close to Rosaryville are the Marlton housing development, Maryland Veterans Cemetery, the Southern Maryland Farmers Market, and Rosaryville State Park."
    },
    {
      "cityName": "Rossmoor",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is an age-restricted, gated development primarily inhabited by retirees."
    },
    {
      "cityName": "Saint Charles",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "St. Charles is a planned community in Charles County, Maryland, United States."
    },
    {
      "cityName": "Saint Charles",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is 22 miles (35 km) south-southeast of Washington, D.C., 24 miles (39 km) from northern Virginia and immediately south of Waldorf, which is the mailing address.."
    },
    {
      "cityName": "Saint Michaels",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Saint Michaels, also known as St. Michaels, is a town in Talbot County, Maryland, United States."
    },
    {
      "cityName": "Saint Michaels",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Saint Michaels derives its name from the Episcopal parish — itself named after Michael the Archangel — established there in 1677."
    },
    {
      "cityName": "Saint Michaels",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The church attracted settlers who engaged in tobacco growing and ship-building, and thence further development."
    },
    {
      "cityName": "Salisbury",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Salisbury is the principal city of the Salisbury, Maryland Metropolitan Statistical Area."
    },
    {
      "cityName": "Salisbury",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is a commercial hub of the Delmarva Peninsula."
    },
    {
      "cityName": "Sandtown-Winchester",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sandtown-Winchester is a neighborhood in West Baltimore, Maryland."
    },
    {
      "cityName": "Sandtown-Winchester",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Known locally as Sandtown, the community's name was derived from the trails of sand that dropped from wagons leaving town after filling up at the local sand and gravel quarry back in the days of horse-drawn wagons."
    },
    {
      "cityName": "Sandtown-Winchester",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is located north of Lafayette Street, west of Fremont Avenue, south of North Avenue, and east of Monroe Street, covering an area of 72 square blocks, patrolled by the Baltimore Police Department's Western District."
    },
    {
      "cityName": "Savage",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is situated close to the city of Laurel and to the planned community of Columbia."
    },
    {
      "cityName": "Savage",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The former mill town is a registered historic place, and has several original buildings preserved within and around the Savage Mill Historic District."
    },
    {
      "cityName": "Scaggsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is situated near the southeastern tip of Howard County, between Laurel and Fulton."
    },
    {
      "cityName": "Scaggsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town mainly consists of residences, with some commercial establishments."
    },
    {
      "cityName": "Scaggsville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Scaggsville generally falls within ZIP code 20723, assigned to Laurel, though the town formerly had its own post office."
    },
    {
      "cityName": "Seat Pleasant",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Two state highways pass through the community — Maryland routes 704 and 214."
    },
    {
      "cityName": "Seat Pleasant",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Washington Metro's Blue and Silver Lines are nearby."
    },
    {
      "cityName": "Seat Pleasant",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Washington Commanders' stadium is east of Seat Pleasant, near the Capital Beltway (I-95/495)."
    },
    {
      "cityName": "Secretary",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "In the modern era, they also tend to actively participate in the professional service work of the organization, such as having a hands-on involvement on the production of deliverables, other work products, and conducting other similar professional duties."
    },
    {
      "cityName": "Severna Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Severna Park is part of the Baltimore-Washington Metropolitan Area, and is located approximately 8 miles (13 km) north of Annapolis, 17 miles (27 km) south of Baltimore and 39 miles (63 km) east of Washington, D.C."
    },
    {
      "cityName": "Sharptown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sharptown is a town in Wicomico County, Maryland, United States."
    },
    {
      "cityName": "Sharptown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Smithsburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Smithsburg is a town in Washington County, Maryland, United States."
    },
    {
      "cityName": "Smithsburg",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Smithsburg is close to the former Fort Ritchie army base and just west of the presidential retreat Camp David."
    },
    {
      "cityName": "Snow Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is part of the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Solomons",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Solomons is a popular weekend destination spot in the Baltimore–Washington metropolitan area."
    },
    {
      "cityName": "South Kensington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It had a population of 8,829 in 2020."
    },
    {
      "cityName": "Sparks",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is situated approximately 20 miles (32 km) north of Baltimore and is considered to be a suburb of the City of Baltimore."
    },
    {
      "cityName": "Sparks",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Gunpowder River runs through Sparks."
    },
    {
      "cityName": "Sparrows Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Named after Thomas Sparrow, landowner, it was the site of a very large industrial complex owned by Bethlehem Steel, known for steelmaking and shipbuilding."
    },
    {
      "cityName": "Sparrows Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "In its heyday in the mid-20th century, it was the largest steel mill in the world."
    },
    {
      "cityName": "Sparrows Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The site of the former Bethlehem Sparrows Point Shipyard and steel mill is now renamed Tradepoint Atlantic in a revitalization program to clean up the environment and make it one of the largest ports on the East Coast of the United States."
    },
    {
      "cityName": "Sparrows Point",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Today Sparrows Point is home to many distribution centers, fulfillment centers, training lots, storage lots, and the like, including those operated by Under Armour, Amazon, Home Depot, Volkswagen, and McCormick & Company."
    },
    {
      "cityName": "Stevensville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The community is the eastern terminus of the Chesapeake Bay Bridge."
    },
    {
      "cityName": "Stevensville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Stevensville Historic District is one of two registered historic districts in the county, the other being the Centreville Historic District."
    },
    {
      "cityName": "Suitland",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Suitland is located approximately 1 mile (1.6 km) southeast of Washington, D.C.."
    },
    {
      "cityName": "Suitland-Silver Hill",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is approximately one mile (1.6 km) southeast of Washington, D.C., 10 miles from Alexandria, Virginia and 8.3 miles from National Harbor, Maryland."
    },
    {
      "cityName": "Summerfield",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "A suburb of Washington, D.C., the area is home to Northwest Stadium and the Prince George's County Sports and Learning Complex."
    },
    {
      "cityName": "Sunderland",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "However, as of November 2007, the former Sunderland post office had closed its doors due to a lease dispute, without opening a new location, and postal officials are determining where to locate a new post office."
    },
    {
      "cityName": "Sykesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Sykesville is a small town in Howard and Carroll counties, Maryland, United States."
    },
    {
      "cityName": "Sykesville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town lies 20 miles (32 km) west of Baltimore and 40 miles (64 km) north of Washington D.C."
    },
    {
      "cityName": "Takoma Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a suburb of Washington, and part of the Washington metropolitan area."
    },
    {
      "cityName": "Takoma Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "A planned commuter suburb, it is situated along the Metropolitan Branch of the historic Baltimore and Ohio Railroad, just northeast of Washington, D.C., and it shares a border and history with the adjacent Washington, D.C."
    },
    {
      "cityName": "Takoma Park",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is governed by an elected mayor and six elected councilmembers, who form the city council, and an appointed city manager, under a council-manager style of government."
    },
    {
      "cityName": "Taneytown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Taneytown was founded in 1754."
    },
    {
      "cityName": "Taneytown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Of the city, George Washington once wrote, \"Tan-nee town is but a small place with only the Street through wch.(sic) the road passes, built on."
    },
    {
      "cityName": "Taneytown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The buildings are principally of wood.\" Taneytown has a history museum that displays the history of the city for visitors and citizens to see."
    },
    {
      "cityName": "Taneytown",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Bullfrog Road Bridge was listed on the National Register of Historic Places in 1978."
    },
    {
      "cityName": "Temple Hills",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Temple Hills borders the communities of Hillcrest Heights, Marlow Heights, Camp Springs and Oxon Hill."
    },
    {
      "cityName": "Templeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Templeville is a town in Caroline and Queen Anne's counties, Maryland, United States."
    },
    {
      "cityName": "Templeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Templeville is located near the Maryland-Delaware line."
    },
    {
      "cityName": "Templeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was known as Bullock Town until the name was changed in 1847."
    },
    {
      "cityName": "Templeville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The name Templeville derives from the Temple family, whose most famous member was Governor William Temple of Delaware."
    },
    {
      "cityName": "Thurmont",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Thurmont is a town in Frederick County, Maryland, United States."
    },
    {
      "cityName": "Thurmont",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town is located in the northern part of Frederick County, approximately ten miles from the Pennsylvania border, along U.S. Highway 15."
    },
    {
      "cityName": "Thurmont",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is very close to Cunningham Falls State Park and Catoctin Mountain Park, the latter of which contains the presidential retreat of Camp David."
    },
    {
      "cityName": "Thurmont",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Thurmont is also home to Catoctin Colorfest, an arts and crafts festival that draws in about 125,000 people each autumn."
    },
    {
      "cityName": "Trenton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was the capital of the United States from November 1 until December 24, 1784."
    },
    {
      "cityName": "Trenton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "However, Trenton directly borders the Philadelphia metropolitan area to its west, and the city was part of the Philadelphia combined statistical area from 1990 until 2000."
    },
    {
      "cityName": "Union Bridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Union Bridge is a town in Carroll County, Maryland, United States."
    },
    {
      "cityName": "Upperco",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is adjacent to Maryland Route 30, between the much larger towns of Reistertown and Hampstead."
    },
    {
      "cityName": "Urbana",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies at the I-270/MD 80 interchange, approximately 7.5 miles (12.1 km) south-east of Frederick and about 37 miles (60 km) north-west of Washington, D.C."
    },
    {
      "cityName": "Urbana",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of the Washington metropolitan area."
    },
    {
      "cityName": "Vienna",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Vienna is a town in Dorchester County, Maryland, United States."
    },
    {
      "cityName": "Waldorf",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Located 23 miles (37 km) south-southeast of Washington, D.C., Waldorf is part of Southern Maryland."
    },
    {
      "cityName": "Waldorf",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Waldorf has experienced dramatic growth, increasing its population 16-fold from fewer than 5,000 residents in 1980 to its current population."
    },
    {
      "cityName": "Waldorf",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is now the largest commercial and residential area in Southern Maryland as well as a major suburb in the Washington metropolitan area."
    },
    {
      "cityName": "Walkersville",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Walkersville is a town in Frederick County, Maryland, United States."
    },
    {
      "cityName": "Washington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Maryland is a state in the Mid-Atlantic and Southern regions of the United States."
    },
    {
      "cityName": "Washington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It borders the states of Virginia to its south, West Virginia to its west, Pennsylvania to its north, and Delaware to its east, as well as with the Atlantic Ocean to its east, and the national capital and federal district of Washington, D.C."
    },
    {
      "cityName": "Washington",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Maryland's capital city is Annapolis, and the state's most populous city is Baltimore."
    },
    {
      "cityName": "West Elkridge",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Founded early in the 18th century, Elkridge is adjacent to two other counties, Anne Arundel and Baltimore."
    },
    {
      "cityName": "Westernport",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Westernport is a town in Allegany County, Maryland, United States, along the Georges Creek Valley."
    },
    {
      "cityName": "Westernport",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is part of the Cumberland micropolitan area."
    },
    {
      "cityName": "Westminster",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Westminster is an outlying community in the Baltimore metropolitan area, which is part of the greater Washington–Baltimore combined statistical area."
    },
    {
      "cityName": "Westover",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is located on Maryland Route 413 near its terminus at U.S. Route 13."
    },
    {
      "cityName": "Westover",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Owing to its central location in Somerset County, Westover is home to many important services and businesses."
    },
    {
      "cityName": "Wheaton",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Wheaton takes its name from Frank Wheaton (1833–1903), a career officer in the United States Army and volunteer from Rhode Island in the Union Army who rose to the rank of major-general while serving before, during, and after the Civil War."
    },
    {
      "cityName": "White Marsh",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "White Marsh is a northeast suburb of Baltimore."
    },
    {
      "cityName": "White Oak",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It had a population of 16,347 in 2020."
    },
    {
      "cityName": "White Plains",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is at latitude 38°35'25\" N, longitude 76°56'26\" W."
    },
    {
      "cityName": "White Plains",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The United States Postal Service has assigned White Plains the ZIP Code 20695."
    },
    {
      "cityName": "White Plains",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The commercial portion of White Plains lies along U.S. Route 301."
    },
    {
      "cityName": "White Plains",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The Charles County Department of Health is headquartered in White Plains, and a public golf course is also there."
    },
    {
      "cityName": "White Plains",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Plans to complete an east–west connector road in the area were mired in controversy because of alleged adverse effects on the environment."
    },
    {
      "cityName": "Willards",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Willards is a town in Wicomico County, Maryland, United States."
    },
    {
      "cityName": "Willards",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is included in the Salisbury, Maryland-Delaware Metropolitan Statistical Area."
    },
    {
      "cityName": "Woodbine",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is part of the Baltimore metropolitan area."
    },
    {
      "cityName": "Woodbine",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is located southeast of Frederick, west of Baltimore, north of Washington, D.C., and east of Mount Airy."
    },
    {
      "cityName": "Woodbine",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The community was named for the woodbine plant, which grew in the community in fields and along riverbanks."
    },
    {
      "cityName": "Woodlawn",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is home to the headquarters of the Social Security Administration (SSA) and the Centers for Medicare and Medicaid Services (CMS)."
    },
    {
      "cityName": "Woodlawn",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered by Catonsville on the south, by the Patapsco River and Howard County on the west, by Randallstown and Lochearn to the north, and by the City of Baltimore to the east."
    },
    {
      "cityName": "Woodlawn",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Parts of Woodlawn are sometimes informally referred to as Security, Maryland, due to the importance of the SSA's headquarters as well as nearby Security Boulevard and Security Square Mall."
    },
    {
      "cityName": "Woodsboro",
      "state": "MD",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Woodsboro is a town in Frederick County, Maryland, United States that was granted to Joseph Wood in 1693."
    }
  ]
}