{
  "facts": [
    {
      "cityName": "Ashaway",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The name Ashaway is derived from the American Indian name for the river that runs through the village, the Ashawague or Ashawaug, which means \"land in the middle\" or \"land between\" in the Niantic and Mohegan languages."
    },
    {
      "cityName": "Ashaway",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The name \"Ashawague River\" appears as late as 1832 on the Findley map of Rhode Island published in Philadelphia."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The construction of a railroad to Providence in 1855 further contributed to suburban development, attracting residents of neighboring urban areas and contributing to the development of manufacturing industries."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Barrington was founded by Congregationalist separatists from Swansea, Massachusetts, and incorporated in 1717."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The post–World War II baby boom increased suburbanization trends, resulting in a large population increase."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Historical sites provide examples of architectural and suburban development during various stages of the town's history, including the Allen-West House, Barrington Civic Center Historic District, and O'Bannon Mill."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Nine sites in Barrington are listed under the National Register of Historic Places."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Barrington is a suburban, residential town in Bristol County, Rhode Island, United States, approximately 7 miles (11 km) southeast of Providence."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "As of the 2020 United States Census, the population was 17153."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "It was ceded from Massachusetts to Rhode Island and merged into Warren in 1747, and in 1770 made into a separate town by the Rhode Island legislature."
    },
    {
      "cityName": "Barrington",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "It was a sparsely developed, agricultural community until the arrival of brickmaking companies in the 1850s, which employed large numbers of French-Canadians and Italians."
    },
    {
      "cityName": "Bristol",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is a deep water seaport named after Bristol, England."
    },
    {
      "cityName": "Bristol",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Major industries include boat building and related marine industries, manufacturing, and tourism."
    },
    {
      "cityName": "Bristol",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Bristol Warren Regional School District manages the unified school system for Bristol and the neighboring town of Warren."
    },
    {
      "cityName": "Bristol",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Prominent communities include Portuguese-Americans, mostly Azoreans, and Italian-Americans."
    },
    {
      "cityName": "Central Falls",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The city takes its name from a waterfall on the Blackstone River."
    },
    {
      "cityName": "Central Falls",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is one of only four incorporated places in New England that have a higher population density than the city of Boston, ranking second, behind the Massachusetts city of Somerville, an inner suburb of Boston."
    },
    {
      "cityName": "Central Falls",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Central Falls went into receivership in May 2010, then filed for bankruptcy in August 2011."
    },
    {
      "cityName": "Central Falls",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "After cutting jobs and services, it came out of bankruptcy in September 2012."
    },
    {
      "cityName": "Charlestown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Charlestown, similarly to Westerly, Rhode Island, is tourist destination during the from May through October for destinations such as the Charlestown Breachway, East Beach, and more."
    },
    {
      "cityName": "Charlestown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Charlestown is bordered by Westerly to the west, Richmond to the north divided by the Pawcatuck River, and South Kingstown to the east, with the Block Island Sound to the south."
    },
    {
      "cityName": "Chepachet",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is centered at the intersection of U S Route 44 (a.k.a."
    },
    {
      "cityName": "Chepachet",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Putnam Pike) and Rhode Island Route 102 (also known as Victory Highway and Chopmist Hill Road)."
    },
    {
      "cityName": "Chepachet",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "As of the 2010 census, the CDP had a population of 1675."
    },
    {
      "cityName": "Cranston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The official population of the city in the 2020 United States Census was 82934, making it the second-largest city in the state."
    },
    {
      "cityName": "Cranston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Town of Cranston was created in 1754 from a portion of Providence north of the Pawtuxet River."
    },
    {
      "cityName": "Cranston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The center of population of Rhode Island is located in Cranston."
    },
    {
      "cityName": "Cranston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "After losing much of its territory to neighboring towns and the city of Providence, Cranston itself became a city on March 10, 1910."
    },
    {
      "cityName": "Cumberland",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Cumberland is the northeasternmost town in Providence County, Rhode Island, United States, first settled in 1635 and incorporated in 1746."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The town is now known for its waterfront, school district, and downtown restaurant/shopping district."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Formed as Greenwich in 1677, it was named for Greenwich, England."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was renamed Dedford in 1686 but reverted to its original name in 1689."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "In 1741 the more rural western three quarters of the town was set off as West Greenwich, the remaining quarter of it thenceforth being called East Greenwich."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Until 1854, it was one of the five state capitals for Rhode Island."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The General Assembly, when meeting in East Greenwich, used the local courthouse, which is today the town hall."
    },
    {
      "cityName": "East Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "East Greenwich Village is located in the northeastern part of the town and extends north about 0.93 mi (1.5 km) into the city of Warwick, Rhode Island."
    },
    {
      "cityName": "Exeter",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Exeter extends east from the Connecticut border to the town of North Kingstown."
    },
    {
      "cityName": "Exeter",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is bordered to the north by West Greenwich and East Greenwich, and to the south by Hopkinton, Richmond, and South Kingstown."
    },
    {
      "cityName": "Glocester",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Glocester, otherwise officially called the Town of Glocester, Rhode Island, is a town in Providence County, Rhode Island, United States."
    },
    {
      "cityName": "Glocester",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The villages of Chepachet and Harmony are in Glocester."
    },
    {
      "cityName": "Glocester",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Putnam Pike (U S Route 44) runs west through the town center of Glocester into Putnam, Connecticut."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The village of Greenville is named after Revolutionary War general Nathanael Greene, who was born in Rhode Island in 1742."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The CDP is centered on the village of Greenville but also encompasses the nearby villages of West Greenville and Spragueville, as well as the Mountaindale Reservoir and beach."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The location, however, was first settled in the 17th century."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The village contains the Greenville Baptist Church (American Baptist Churches, USA), Greenville Public Library, and William Winsor School, and there are many apple orchards in the surrounding area."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The area was active in the Free Will Baptist movement in the 19th century, and the Smithville Seminary, a Free Baptist institution, was nearby."
    },
    {
      "cityName": "Greenville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "U S Route 44, known locally as \"Putnam Pike\", runs through the center of Greenville."
    },
    {
      "cityName": "Harrisville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Much of the community composes a historic district listed on the National Register of Historic Places."
    },
    {
      "cityName": "Harrisville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The village was named after nineteenth century manufacturer Andrew Harris."
    },
    {
      "cityName": "Harrisville",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It was previously named Rhodesville, after eighteenth-century privateer Captain William Rhodes."
    },
    {
      "cityName": "Jamestown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Jamestown is situated almost entirely on Conanicut Island, the second largest island in Narragansett Bay."
    },
    {
      "cityName": "Jamestown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It also includes the uninhabited Dutch Island and Gould Island."
    },
    {
      "cityName": "Johnston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Johnston is the site of the Clemence Irons House (1691), a stone-ender museum, and the only landfill in Rhode Island."
    },
    {
      "cityName": "Johnston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Incorporated on March 6, 1759, Johnston was named for the colonial attorney general, Augustus Johnston."
    },
    {
      "cityName": "Kingston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Much of the village center is listed on the National Register of Historic Places as Kingston Village Historic District."
    },
    {
      "cityName": "Kingston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was originally known as Little Rest."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Lincoln is in the lower Blackstone Valley of Rhode Island and in the John H. Chafee, Blackstone River Valley National Heritage Corridor, New England's historic National Park area."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Lincoln Woods State Park is located within the town."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Lincoln became an important mill town in the late 19th century, with many textile factories running along the Blackstone River."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Lincoln is located in northeastern Rhode Island, north of Providence."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Lincoln is part of the Providence metropolitan statistical area and the Greater Boston combined statistical area."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Lincoln was settled in the 17th century as part of the Louisquisset grant, and several colonial stone-enders still exist in the town."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "Limestone quarrying has occurred there since colonial times at the village of Lime Rock."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Lincoln was a part of the town of Smithfield until 1871, when it was split off and named in honor of Abraham Lincoln."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The city of Central Falls was part of Lincoln until it split off itself in 1895."
    },
    {
      "cityName": "Lincoln",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "Lincoln's villages include Manville, Albion, Lime Rock, Lonsdale, Fairlawn, Quinnville, and Saylesville."
    },
    {
      "cityName": "Middletown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It lies to the south of Portsmouth and to the north of Newport on Aquidneck Island, hence the name \"Middletown.\""
    },
    {
      "cityName": "Narragansett",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "With several ocean beaches and a walkable strip along the ocean front, Narragansett is a resort area in the summer season as well as a popular East Coast surfing spot due to frequent southerly swells from Atlantic Ocean."
    },
    {
      "cityName": "Narragansett",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The town of Narragansett occupies a narrow strip of land running along the eastern bank of the Pettaquamscutt River (aka Narrow River) to the shore of Narragansett Bay on the Atlantic Ocean."
    },
    {
      "cityName": "Narragansett",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "However, during the summer months the town's population more than doubles to near 34000."
    },
    {
      "cityName": "Narragansett",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "It was separated from South Kingstown in 1888 and incorporated as a town in 1901."
    },
    {
      "cityName": "Narragansett",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "For geographic and demographic information on the village of Narragansett Pier, which is part of Narragansett, see the article on Narragansett Pier."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Block Island is a popular summer tourist destination known for its bicycling, hiking, sailing, fishing, surfing and beaches."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The island is named after Dutch explorer Adriaen Block, and the town was named for Shoreham, West Sussex, in England."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "It is home to the historic lighthouses Block Island North Light, on the northern tip of the island, and Block Island Southeast Light, on the southeastern coast."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Block Island is an island of the Outer Lands coastal archipelago in New England, located approximately 9 miles (14 km) south of mainland Rhode Island and 14 miles (23 km) east of Long Island's Montauk Point."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The island is coterminous with the town of New Shoreham, Rhode Island, and is part of Washington County."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "About 40 percent of the island is set aside for conservation, and much of the northwestern tip of the island is an undeveloped natural area and resting stop for birds along the Atlantic flyway."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The Nature Conservancy includes Block Island on its list of \"The Last Great Places\", which consists of 12 sites in the Western Hemisphere."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Popular events include the annual Fourth of July Parade, celebration, and fireworks."
    },
    {
      "cityName": "New Shoreham",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "The island's population can triple over the normal summer vacation crowd."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is known as a New England summer resort and is famous for its historic mansions and its rich sailing history."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It is also the home of Salve Regina University and Naval Station Newport, which houses the United States Naval War College, the Naval Undersea Warfare Center, and an important Navy training center."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Newport hosted the first U S Open tournaments in both tennis and golf, as well as every challenge for the America's Cup between 1930 and 1983."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city has a population of about 25000 residents."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It was a major 18th-century port city and has many buildings from the colonial era."
    },
    {
      "cityName": "Newport",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "It was the location of \"Summer White Houses\" of presidents Dwight D. Eisenhower and John F. Kennedy."
    },
    {
      "cityName": "Newport East",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The CDP encompasses the portion of the urban area of the city of Newport that extends beyond the municipal boundaries."
    },
    {
      "cityName": "North Kingstown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Kingstown is the birthplace of American portraitist Gilbert Stuart, who was born in the village of Saunderstown."
    },
    {
      "cityName": "North Kingstown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Within the town is Quonset Point, location of the former Naval Air Station Quonset Point, known for the invention of the Quonset hut, as well as the historic village of Wickford."
    },
    {
      "cityName": "North Kingstown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Its population was 27732 in the 2020 census."
    },
    {
      "cityName": "North Scituate",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Much of the community is included in a historic district on the Danielson Pike and West Greenville Road."
    },
    {
      "cityName": "North Scituate",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The district was added to the National Register of Historic Places in 1979."
    },
    {
      "cityName": "North Scituate",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Since 1967, the village has been home to the Scituate Art Festival."
    },
    {
      "cityName": "North Scituate",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The district contains many nineteenth-century buildings, including the Old Congregational Church (1834) and Smithville Seminary (1839)."
    },
    {
      "cityName": "North Smithfield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "North Smithfield includes the historic villages of Forestdale, Primrose, Waterford, Branch Village, Union Village, Park Square, and Slatersville."
    },
    {
      "cityName": "North Smithfield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "North Smithfield is a town in Providence County, Rhode Island, United States, settled as a farming community in 1666 and incorporated into its present form in 1871."
    },
    {
      "cityName": "Pascoag",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Pascoag is one of eight villages that make up the town of Burrillville."
    },
    {
      "cityName": "Pawtucket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is home to Slater Mill, a historic textile mill recognized for helping to found the Industrial Revolution in the United States."
    },
    {
      "cityName": "Pawtucket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Pawtucket was an early and important center of textile manufacturing."
    },
    {
      "cityName": "Pawtucket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Pawtucket borders Providence and East Providence to the south, Central Falls and Lincoln to the north, and North Providence to the west."
    },
    {
      "cityName": "Pawtucket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city also borders the Massachusetts municipalities of Seekonk and Attleboro."
    },
    {
      "cityName": "Peace Dale",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The historic district is roughly bounded by Kersey Rd., Oakwoods Dr., Kingstown Rd., School, Church and Railroad Sts., and contains the historic core of the village."
    },
    {
      "cityName": "Peace Dale",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The Peace Dale Historic District was listed on the National Register of Historic Places as a historic district in 1987."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Providence is one of the oldest cities in New England, founded in 1636 by Reformed Baptist theologian Roger Williams, a religious exile from the Massachusetts Bay Colony."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Providence was one of the first cities in the country to industrialize and became noted for its textile manufacturing and subsequent machine tool, jewelry, and silverware industries."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Today, the city of Providence is home to eight hospitals and eight institutions of higher learning which have shifted the city's economy into service industries, though it still retains some manufacturing activity."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The city developed as a busy port, as it is situated at the mouth of the Providence River at the head of Narragansett Bay."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "Providence ( ) is the capital and most populous city of the U S state of Rhode Island."
    },
    {
      "cityName": "Providence",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "He named the area in honor of \"God's merciful Providence\" which he believed was responsible for revealing such a haven for him and his followers."
    },
    {
      "cityName": "Richmond",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It contains the villages of Alton, Arcadia, Barberville, Carolina, Hillsdale, Kenyon, Shannock, Tug Hollow, Usquepaug, Wood River Junction, Woodville, and Wyoming."
    },
    {
      "cityName": "Richmond",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Students from the Town of Richmond are part of the Chariho Regional School District, a school district shared between Charlestown and Hopkinton, Rhode Island."
    },
    {
      "cityName": "Riverside",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Despite not being an incorporated city, Riverside has its own zip code, 02915, and is an acceptable mailing address according to the United States Postal Service."
    },
    {
      "cityName": "Riverside",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Riverside has a population of approximately 20000 people."
    },
    {
      "cityName": "Riverside",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Adjoining Riverside are the town of Barrington in Bristol County to the south, Narragansett Bay to the west, the rest of East Providence to the north, and the Runnins River and Seekonk, Massachusetts to the east."
    },
    {
      "cityName": "Rumford",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Also considered a neighborhood or village, the Rumford section of East Providence borders Seekonk, Massachusetts to the east, Pawtucket, Rhode Island to the north, and the Ten Mile River (Seekonk River) to the south."
    },
    {
      "cityName": "Rumford",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Rumford is the northern section of the city of East Providence, Rhode Island, United States."
    },
    {
      "cityName": "Saunderstown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It was named in honor of John Aldrich Saunders, a member of the Saunders family."
    },
    {
      "cityName": "Saunderstown",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Its population is 6245."
    },
    {
      "cityName": "Smithfield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Incorporated in 1731, it includes the historic villages of Esmond, Georgiaville, Mountaindale, Spragueville, Stillwater, and Greenville."
    },
    {
      "cityName": "Smithfield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Smithfield is home to Bryant University, a private, four-year university."
    },
    {
      "cityName": "Wakefield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Wakefield village center along Main Street (old Boston Post Road) between Belmont Avenue and Columbia Street was listed on the National Register of Historic Places in 1996 as Wakefield Historic District, with boundary increases in 2019 and 2022."
    },
    {
      "cityName": "Wakefield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Since 1991, the Washington County Courthouse has been in Wakefield."
    },
    {
      "cityName": "Wakefield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The Sheriff's Office which handles corrections is also in Wakefield."
    },
    {
      "cityName": "Wakefield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "The district is significant for being an early commercial and industrial center."
    },
    {
      "cityName": "Wakefield",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The district includes 53 properties over an area of 400 acres (160 ha)."
    },
    {
      "cityName": "Wakefield-Peacedale",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "According to the 2020 census, its population was 8925."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Warwick was also the home of Revolutionary War General Nathanael Greene, George Washington's second-in-command, and Civil War General George S. Greene, a hero of the Battle of Gettysburg."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Warwick was founded by Samuel Gorton in 1642 and has witnessed major events in American history."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Warwick was also home to Rocky Point, which closed in 1995 and is now a state park."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Warwick is located approximately 12 miles (19 km) south of downtown Providence, Rhode Island, 63 miles (101 km) southwest of Boston, Massachusetts, and 171 miles (275 km) northeast of New York City."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "It was decimated during King Philip's War (1675–1676) and was the site of the Gaspee Affair, the first act of armed resistance against the British, preceding even the Boston Tea Party, and a significant prelude to the American Revolution."
    },
    {
      "cityName": "Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "Today, it is home to Rhode Island's main airport, T. F. Green Airport, which serves the Providence area and also functions as a reliever for Logan International Airport in Boston, Massachusetts."
    },
    {
      "cityName": "West Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "West Greenwich was named for the historic town of Greenwich, Kent, England."
    },
    {
      "cityName": "West Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "It was separated from East Greenwich in 1741."
    },
    {
      "cityName": "West Greenwich",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Students go to Exeter-West Greenwich Regional School in West Greenwich."
    },
    {
      "cityName": "West Kingston",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is the site of the Kingston Railroad Station Amtrak station, and is a part of the Town of South Kingstown."
    },
    {
      "cityName": "West Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "Prior to 1913, the town, situated on the western bank of the Pawtuxet River, was the population and industrial center of the larger town of Warwick."
    },
    {
      "cityName": "West Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "West Warwick was incorporated in 1913, making it the youngest town in the state."
    },
    {
      "cityName": "West Warwick",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "The town split because local Democratic politicians wanted to consolidate their power and isolate their section of town from the Republican-dominated farmland in the east."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "The Town of Westerly was known historically for local important granite mining and stone-cutting industry, which ran until the quarries stopped operating in the 1950s."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "Three large salt ponds lie along the coast, with sand bars of white sand such as the Misquamicut State Beach."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 3,
      "fact": "Westerly is a notable tourist destination from May through October, when the population nearly doubles."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 4,
      "fact": "Its well-known beaches include Weekapaug Beach, Westerly Town Beach, Misquamicut State Beach, East Beach, and Watch Hill Beach."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 5,
      "fact": "The western and northern borders of Westerly are defined by a natural border of the Pawcatuck River, with the bordering town of Hopkinton defined by the Pawcatuck River, while holding a straight border to the east with Charlestown."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 6,
      "fact": "The Pawcatuck River flows on the western border of Westerly, and was once renowned for its own species of Westerly salmon, three of which are displayed on the town's official seal."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 7,
      "fact": "The Pawcatuck River flows from 15 mi (24 km) inland, emptying into Little Narragansett Bay."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 8,
      "fact": "Westerly is a town on the southwestern coastline of Washington County, Rhode Island, United States, first settled by English colonists in 1661, and incorporated as a municipality in 1669."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 9,
      "fact": "It also serves as the boundary between Westerly and Pawcatuck, Connecticut."
    },
    {
      "cityName": "Westerly",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 10,
      "fact": "From west to east, these ponds are Maschaug Pond, Winnapaug Pond, and Quonochontaug Pond."
    },
    {
      "cityName": "Woonsocket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 1,
      "fact": "It is home to Landmark Medical Center, the Museum of Work and Culture, and the American-French Genealogical Society."
    },
    {
      "cityName": "Woonsocket",
      "state": "RI",
      "source": "Wikipedia",
      "factNumber": 2,
      "fact": "The city is the corporate headquarters of CVS Health, a pharmacy services provider."
    }
  ]
}